{
  "pages": [

    {
      "title": "MI Band S1 Review",
      "link": "/2016/03/MI-Band-S1-Review.html",
      "image": "https://hqgmca.dm2301.livefilestore.com/y3mtT-4ObYUSqUldwhrUZq2IPfD7WvGc4qlIIwnvINXDDkoIhpQ8pGKs58IOLakssaNCeRKAx71FgxuboV8TNJwcO7dQomlFyJqjU39ZvqmKT4YTa5pTCubKTvxJ4IRh_ldvxdUUKfv2kK6KoqtGfS00pFzJrHTYw_p-mGc3GoIwD8?width=970&height=300&cropmode=none",
      "content": "MI Band S1 Review MI Band S1 Review ช่วงนี้เทรนสุขภาพกำลังมาแรงมาก ตอนนี้หลายๆ คนเริ่มที่จะหันมาออกกำลังกายกันมากขึ้นกว่าเดิม ผมเป็นคนหนึ่งที่เริ่มหันมาออกกำลังกายเพื่อสุขภาพ จนตอนนี้กลายเป็นเอาจริงเอาจังกับการออกกำลังไปเสียแล้ว",
      "slug": "MI-Band-S1-Review",
      "detail": "<p>ช่วงนี้เทรนสุขภาพกำลังมาแรงมาก ตอนนี้หลายๆ คนเริ่มที่จะหันมาออกกำลังกายกันมากขึ้นกว่าเดิม ผมเป็นคนหนึ่งที่เริ่มหันมาออกกำลังกายเพื่อสุขภาพ จนตอนนี้กลายเป็นเอาจริงเอาจังกับการออกกำลังไปเสียแล้ว</p>\n\n<p>หลายๆ คนมีอุปกรณ์เอาไว้อำนวยความสะดวกเวลาออกกกำลังกายเช่น โทรศัพท์เอาไว้จับระยะทางการวิ่ง เดิน หรือปั่นจักรยาน บางคนใช้นาฬิกาเพื่อความสะดวกสบาย แต่ก็แลกมากับราคาที่ค่อนข้างสูง บางครั้งการออกกำลังในแต่ประเภทยังต้องอาศัยการวัดอัตราการเต้นของหัวใจ แต่ก็สามารถหาซื้อเพิ่มเติมได้ หรือแบบติดมากับนาฬิกาก็มี</p>\n\n<p>เนื่องจากราคาที่สูง ประกอบกับบางครั้งอาจจะไม่จำเป็นเพราะไม่ได้ออกกำลังกายหนักๆ และไม่จำเป็นสำหรับการใช้งานขนาดนั้น หลายๆ คนหันมาสนใจสายรัดข้อมือที่ใช้นับการก้าวเดิน การนอนหลับ แม้กระทั่งการกินอาหารในชีวิตประจำวัน</p>\n\n<p>สายรัดข้อมือประเภทนี้มีอยู่หลาบยี่ห้อ ตั้งแต่แบรนด์ดังๆ จนถึงแบรนด์ทั่วไปที่เราไม่รู้จักตอนนี้ที่กำลังมาแรงและราคาสบายๆ <em>(เมื่อเทียบกับความสามารถ)</em> ผมลองดูในหลายๆ ยี่ห้อดังๆ รวมไปถึงยี่ห้อทั่วไปจนมาตกลงปลงใจกับ Xiaomi MI Band</p>\n\n<center>\n\t<img src=\"https://wtvox.com/wp-content/uploads/2015/11/xiaomi-mi-band-1s-design-and-specs2.jpg\" alt=\"\" />\n\t<br />\n\t<a href=\"https://wtvox.com/xiaomi/xiaomi-mi-band-1s/\">Photo from wtvox.com</a>\n</center>\n\n<h2 id=\"mi-band-1s\">MI Band 1S</h2>\n\n<p>ต้องบอกตรงนี้ก่อนว่าผมไม่ได้ซื้อมาเพื่อจับการเดิน หรือการนอนหลับนั่นไม่ใช่จุดประสงค์หลักของผม แต่มีไว้ก็ไม่เสียหลายๆ หลักๆแล้วที่ผมต้องการจากสายรัดข้อมือนี้คือ Heart Rate นั่นเองครับ ซึ่งรุ่นใหม่เขามี Hear Rate ผมต้องการเพื่อจะเอาไปใช้กับแอพออกกำลังการของผมนั่นคือ Strava นั่นเองครับ ทีนี้ขอมาดูความสามารถของเจ้าตัวนี้กัน หลังจากผมใช้ได้ประมาณ 2-3 วัน</p>\n\n<p><a href=\"https://www.mi.com/en/miband/\">MI Band</a> เป็นผลิตภัณฑ์ของ <a href=\"https://www.mi.com/en/\">Xiaomi</a> สัญชาติจีนที่กำลังมาแรงในหลายๆ ผลิตภัณฑ์ มีอะไรบ้างลองไปดูในเว็บเขาครับ MI Band มีอยู่กี่รุ่นผมไม่ทราบแน่ชัด เท่าที่ทราบน่าจะสอง 555 ไม่ได้ติดตามจริงๆ รุ่นที่ผมใช้อยู่เป็นรุ่น S1 ความสามารถของมันเหมือนกันกับรุ่นก่อนหน้าทุกอย่าง เพียงแค่ว่ารุ่นนี้มีเซนเซอร์วัดอัตราการเต้นของหัวใจเข้ามาด้วยครับ</p>\n\n<p>จริงๆ MI Band ไม่ได้เปิดขายเป็นทางการในประเทศไทย ต้องหิ้วเข้ามาอย่างเดียวครับ ราคาที่จีนก็อยู่ประมาณ USD$27 หรือ 955 บาทโดยประมาณนะครับ (อาจจะถูกกว่านี้) ลองไปหาดูตามอินเทอร์เน็ตอาจจะได้ราคาที่ถูกกว่านี้ก็ได้นะ ผมได้มาจากในเน็ตเหมือนกันครับราคาก็ประมาณ 1000 ถ้วนถือว่าไม่เสียหายสำหรับผมกับราคานี้</p>\n\n<center>\n\t<img src=\"https://2.bp.blogspot.com/-IaInsnzvwi8/VkCCGpAx8hI/AAAAAAAADIg/UgeivUdfZ7I/s640/51-eMsU06WL._SL1500_%255B1%255D.jpg\" alt=\"\" /><br />\n\t<a href=\"https://techonish.blogspot.com/2015_11_01_archive.html\">Phot to from techonish</a>\n</center>\n\n<h2 id=\"แกะกล่อง\">แกะกล่อง</h2>\n\n<p>แกะกล่องออกมาเราก็จะเจอตัวเซ็นเซอร์เป็นปุ่มๆ เอาไว้เสียบเข้ากับสายคล้องข้อมือ ซึ่งผมได้แถมมาอีกหนึ่งอันจากคนขาย มีตัวชาร์ตแบตเตอรี่และคู่มีที่เป็นภาษาจีนทั้งหมด แต่สามารถหาอ่านภาษาอังกฤษได้จากในอินเทอร์เน็ต รุ่นนี้กันน้ำได้ระดับ <a href=\"https://pantip.com/topic/31726956\">IP67</a> <em>(ลองอ่านความหมายเพิ่มเติมในลิ้งค์นะครับ)</em> สำหรับ MI Band 1S <strong>กันฝุ่นละอองและสามารถจุ่มน้ำได้ที่ความลึกตั้งแต่ 15 เซนติเมตร ถึง 1 เมตร</strong> นั่นแสดงว่าเราสามารถใส่ตากฝน และใส่ออกกำลังตอนเหงื่อออกมากๆ ได้อย่างสบายใจครับ ผมลองมาแล้วเพราะเป็นคนเหงื่อเยอะ ลองใส่วิ่งตอนเหงื่ออกมากๆ ไม่มีปัญหาอะไรแค่พอออกกำลังกายเสร็จก็ถอดออกมาเช็ดให้แห้งสักหน่อยเพื่อความสะอาดและซับน้ำที่ขังอยู่ในช่องเสียบตัวเครื่องครับ</p>\n\n<h2 id=\"ตั้งค่าแอพ\">ตั้งค่าแอพ</h2>\n\n<p>MI Band จะมีแอพมาด้วย สามารถใช้ได้ทั้ง Android และ iPhone ไปโหลดกันใน Store ของแต่ละเจ้าได้เลย เมื่อโหลดมาแล้วเราจำเป็นต้องเปิด Bluetooth ก่อนเพื่อเชื่อมต่อกับ MI Band ของเราครับ หากโทรศัพท์เจอกับสายรัดข้อมือแล้ว สายรัดข้อมือจะสั่นให้เราลูบที่เซ็นเซอร์เพื่อทำการ Pair ครับเป็นอันเสร็จพิธี</p>\n\n<center><img src=\"https://ury0eg.dm2301.livefilestore.com/y3mfbWlzCpm0eXJQOUsoDrMovdx-dOtUvAa6pcddiVBXzwfvHe8tjGnu3BgCWno4fvQxVG6NCrXHqhrlA53AKo9cSj49pl2VGrZvB5lPNVB1lylmayodQR5rQ0Gf4aeayKnLkT-Lu80USZLlxAeUtYE2PXVnq-fPckjq-H24ahkce4?width=372&amp;height=660&amp;cropmode=none\" /></center>\n\n<p>จากนั้นเราสามารถสร้าง Account ผ่านแอพได้เลยทันทีหรือถ้าหากไม่สะดวกที่จะสร้างผ่านแอพก็สามารถเข้าไปสร้างในเว็บไซต์ได้นะครับโดยเข้าไปสร้างที่ https://account.xiaomi.com/ ได้เลย</p>\n\n<h3 id=\"step\">Step</h3>\n\n<center><img src=\"https://urwzng.dm2301.livefilestore.com/y3mYhInQcgW8mhXZfDmvm3DzF7FhuSYz0Y31eSbQG0cIqFQhSMDTH5FUCUDGxjYmRLZ9S1sDkAuZpXwDoAfsxLgMPUfvJMX1M6keyvF9GQJkTMB_BvGjYL4I_d3xJt5fmzYf72_R1JAb3X7eGuEgDof931-rQU0T6FBUkc4sEhqdzA?width=372&amp;height=660&amp;cropmode=none\" alt=\"\" />\n<img src=\"https://hqiukw.dm2301.livefilestore.com/y3mgL7Zzton28usEfLEXBBEzaEUF62AWeYkPZ7O4dxKbNBzUtEA46UE0l4EzUni7I-vWFN9FozJlQumHHV4AivtWsINWHw0jz0z0EeUxU_ehvIT6vVlIELrsENPdUlkG_rR0rIcFbobHxmdN6J3Sb7skGSV-T_n2cESg6AJliMrK10?width=372&amp;height=660&amp;cropmode=none\" alt=\"\" />\n<img src=\"\" alt=\"\" /></center>\n\n<p>หน้านี้จะเป็นการนับจำนวนก้าวของเราทั้งหมดซึ่งหากเปิดแอพและเชื่อมต่อกับสายรัดข้อมือตลอดเวลาจะเป็นการนับแบบ real time กันเลยทีเดียว เราสามารถตั้งเป้าหมายของเราได้ด้วยว่าในแต่ละวันเราจะต้องเดินเท่าไหร่ ส่วนตัวของของผมตั้งไว้ 10,000 ก้าว เมื่อเราทำได้ตามที่ตั้งไว้สายรัดข้อมือจะสั่นบอกเราครับ และยังมีหน้ารวม และรายงานผลอีกด้วยเจ๋งดีนะ</p>\n\n<h3 id=\"sleep\">Sleep</h3>\n\n<center>\n\t<img src=\"https://urxpkq.dm2301.livefilestore.com/y3mWAaExidFmUWUdc9RsFk5CXHtUvoSDfvk5VfI_7LQt-SLeGQVSksF7TVh6-OV6R7hDuvhIPQ5QyiUPyMWcVX6yn7VrWpPpmVPxuJ_Kr94Qc1VBZ74zMW0IWcwOxwWiKzhve3E-5h0dG_P7GF9dgILanyfqPKMFPTm3LzrH62l9pA?width=372&amp;height=660&amp;cropmode=none\" alt=\"\" />\n\t<img src=\"https://hqjdzq.dm2301.livefilestore.com/y3mawY-ItoR6ZNMW2HRl3p7Rq-G_ytTu-6bUxPb5AZFA6hHNWCHzbgPWIGWxnJN5rhxLM-78hOplZ0ZeimG1GNoBaeojWkU5juKJk4btj3vUHv4e0evrqYGzc2VZmfQwki7Ewh3lffn-0OenNC8GEP0trrhDvlApgyJjxNMrtaamRo?width=372&amp;height=660&amp;cropmode=none\" alt=\"\" />\n</center>\n\n<p>ส่วนนี้จะเป็นการดูรายงานการนอนของเราในแต่ละคืนนั่นเอง ว่าเรานอนกี่โมงหลับไปเมื่อไหร่ ตื่นกี่ครั้งในหนึ่งคืน หลับธรรมดา หลับลึก วัดได้หมดครับ <em>(ผมก็ยังงงมันวัดยังไงของมัน 555 )</em> ขนาดผมตื่นเพราะหมาเห่ามันก็ยังบอกว่าผมตื่นและหลับอีกครั้งกี่โมง บร๊ะ</p>\n\n<h3 id=\"weight\">Weight</h3>\n\n<center>\n\t<img src=\"https://hqhjoa.dm2301.livefilestore.com/y3mIWr8HX0SoGSoiibae4InUl3ZE8djV7GzzgzSy0u0omNt-5wUdqUmw_4mBBskfxjQ13KqjYkwsHZNtUOqEQgbQfh5UuKIENyLgFBowBk6YFqYxVxzG0NPq0UH5ugabRdLK_gBc9ABri1u4GjS64limHOrnhSPkXZdvUIKlAZV9oQ?width=372&amp;height=660&amp;cropmode=none\" alt=\"\" />\n\t<img src=\"https://hqgttw.dm2301.livefilestore.com/y3mU8UJXarFQS_uXnPAVVYRVwZB2wkKyvsB2kA1z2onIj4AVGF1uDyXITqiVJuGfoKna9RfxoSZT67gBAKgptelwNvvQy3iEy7kkBPmACjqwaVLNc15P-HqLGYNp2NVFjxluK5cuiuMDYhF2rz-Cwtbv5btQ5zH1lgKRfsVhtMu2IM?width=372&amp;height=660&amp;cropmode=none\" alt=\"\" />\n</center>\n\n<p>ส่วนบอกน้ำหนัก เราสามารถใส่น้ำหนักเราได้ครับ สำหรับคนที่ต้องการลดไขมัน หรือลดความอ้วนสามารถใส่น้ำหนักเพื่อดูพัฒนาการของตัวเองได้ที่ตรงนี้ แต่สำหรับผมไม่จำเป็นแฮะ ไม่เคยอ้วนเลยให้ตายสิ T_T</p>\n\n<h3 id=\"heart-rate\">Heart Rate</h3>\n\n<center>\n\t<img src=\"https://hqhcwq.dm2301.livefilestore.com/y3m5j6JnK7TitnDuZKgf_IkyqewOkGQpk2vqxOc_5yHiZC4fsGUL8FYZx2bUP4onQQuC2Kwnk8xGmhPmaVGI4_ODQHsRRpdDHCYmEl5u9d_SBeI8jzN-uDdTj0CYaKEDi71nWnmgoSss9N53KtglrtYPfTfnBwjhz0MgLBlBXzfh24?width=372&amp;height=660&amp;cropmode=none\" alt=\"\" />\n\t<img src=\"https://urxphw.dm2301.livefilestore.com/y3mxJqm4j2GAiwTUaRGOcVyGO0s19Kru6WtZbdACMnefKca0tIQeFbN4x4UHqr8zo5BzdObBCIsiu9Csq2m1AhfZTM1VZO-8u1SZ2stwIz5c5Y92hC9XQRoMRroySPimWb3p7raEgh4Pyj7jdnE-7hO5uGKmktjWZlXvBTcfeGtBG8?width=372&amp;height=660&amp;cropmode=none\" alt=\"\" />\n</center>\n\n<p>หน้าแสดงอัตราการเต้นของหัวใจ ส่วนนี้จะใช้ได้เฉพาะรุ่น 1S ที่มี Heart rate ติดมาด้วยครับ ยามใดที่เราต้องการรู้อัตราการเต้นของหัวใจตนเอง เราก็กดวัดได้เลยทันทีครับแอพก็จะสั่งให้สายรัดข้อมือยิงแสงเลเซอร์ลงไปบนแขนเรา แล้วก็แสดงตัวเลนบนแอพให้เราเห็น เรื่องความแม่นยำผมไม่รู้นะ แต่ว่ามันทำงานได้ดีเลยแหละ</p>\n\n<h3 id=\"สามารถอื่นๆ\">สามารถอื่นๆ</h3>\n\n<p>ยังมีความสามารถอีกหลายอย่างที่ผมไม่ค่อยได้ใช้เช่น การตั้งเวลาปลุกจะสั่นเมื่อถึงเวลาที่ตั้งไว้ เชื่อมต่อกับแอพ Heath ของ iPhone หรือ Google Fit และแอพต่างๆ อีกมากมาย สั่นเมื่อมีเสียงเรียกเข้า หรือปลดล็อกโทรศัพท์ยังได้ หากหาสายรัดข้อมือไม่เจอ ไม่รู้เอาไปวางไว้ไหนก็สามารถกด Locate เพื่อให้สายรัดข้อมือสั่นแต่ต้องอยู่ในระยะ Bluetooth นะ</p>\n\n<p>เยอะจังอันนิดเดียวเอง คุ้มนะผมว่ากับราคานี้ แต่มันจะดูคุ้มกว่านี้ถ้าใช้กับ Strava!!!! บล็อกหน้าจะมา Review ให้ดูครับว่าจะใช้กับ MI Band heart rate กับ Strava ยังไง</p>\n"
    }
    ,
    {
      "title": "My First Marathon 42.195",
      "link": "/2016/02/first-marathon.html",
      "image": "https://bestrangers.files.wordpress.com/2016/02/p_20160212_183625.jpg",
      "content": "ในที่สุดผมก็ผ่านมันมาจนได้กับมาราธอนแรกของผม มีเรื่องราวที่น่าจดจำมากมายบนสนามแข่งขัน มิตรภาพ ความเจ็บปวด ความอ่อนล้า ความแข็งแกร่ง ที่เอาชนะตนเองมาได้ ลากตัวเองเข้าเส้นเส้นตามเวลาที่ก่อนเวลาที่คิดไว้คือภายใน 5:00 ได้รับรู้ถึงบรรยากาศของมาราธอน บรรยากาศของผู้คนที่ออกมาเชียร์สุดยอดมากครับ งานมหาวิทยาลัยเชียงใหม่มาราธอน ปีนี้จัดเป็นครั้งแรก และเป็นมาราธอนแรกของผมด้วย ก็ต้องมีตื่นเต้นกันบ้างแหละครับ เกิดมาไม่เคยวิ่งไกลขนาดนี้ ไกลสุดก็ 27.7km นั่นแหละครับ มาพร้อมความเกรงๆ แต่หัวใจสู้ไม่ถอย",
      "slug": "first-marathon",
      "detail": "<p>ในที่สุดผมก็ผ่านมันมาจนได้กับมาราธอนแรกของผม มีเรื่องราวที่น่าจดจำมากมายบนสนามแข่งขัน มิตรภาพ ความเจ็บปวด ความอ่อนล้า ความแข็งแกร่ง ที่เอาชนะตนเองมาได้ ลากตัวเองเข้าเส้นเส้นตามเวลาที่ก่อนเวลาที่คิดไว้คือภายใน 5:00 ได้รับรู้ถึงบรรยากาศของมาราธอน บรรยากาศของผู้คนที่ออกมาเชียร์สุดยอดมากครับ</p>\n\n<p>งานมหาวิทยาลัยเชียงใหม่มาราธอน ปีนี้จัดเป็นครั้งแรก และเป็นมาราธอนแรกของผมด้วย ก็ต้องมีตื่นเต้นกันบ้างแหละครับ เกิดมาไม่เคยวิ่งไกลขนาดนี้ ไกลสุดก็ 27.7km นั่นแหละครับ มาพร้อมความเกรงๆ แต่หัวใจสู้ไม่ถอย</p>\n\n<h3 id=\"เตรียมตัวก่อนวันวิ่ง\">เตรียมตัวก่อนวันวิ่ง</h3>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/02/p_20160213_182934.jpg?w=736\" alt=\"\" /></center>\n\n<p>วันนี้วันโหลดแป้ง ต้องใช้ร่างกายให้น้อยที่สุดเพื่อเก็บแรง อันนี้อ่านมา แต่เห็นนักวิ่งที่มืออาชีพจริงๆ เขาก็ยังวิ่งอยู่นะ วันนี้ต้องเตรียมของที่จะใช้ให้ครบก่อนที่จะเข้านอนช่วง 6:00pm Power Gel มีแล้วเตรียมไป 4 รองเท้า เสื้อ กางเกง ที่ต้องหาซื้อคือ ถุงเท้า กับ Spray ส่วนกระเป๋าคาดเอวยืมของพี่กตมาใช้ก่อนงบหมดแล้วววว</p>\n\n<p>หาซื้อ Spray Uniren ตั้งแต่ลำปางยันเชียงใหม่ ก็ยังหาไม่ได้ หายากเสียจริง ในเมื่อหาไม่ได้ก็ไม่เป็นไรซื้อข้าวเย็น แล้วที่สำคัญขนมปังแผ่นจะกินตอนตีหนึ่ง  เพื่ออัดคาโบไฮเดรตเข้าไปจะได้ไม่ชนกำแพงเหมือนที่ซ้อมเอาไว้</p>\n\n<p>อุปกรณ์พร้อม ทุกอย่างพร้อมเข้านอนเพื่อตื่นตอนตีหนึ่ง</p>\n\n<h3 id=\"ปล่อยตัว\">ปล่อยตัว!!!</h3>\n\n<p>ตื่นนอนตอนตีหนึ่ง เปิดคอมดูแผนที่การวิ่ง จุดให้น้ำแต่ละจุด จุดให้อาหารและเกลือแร่ จุดพยาบาล และระยะทางว่าตรงไหนกี่กิโล เพื่อจะได้คำนวณการวิ่ง และวางแผนความเร็วไปในตัวพร้อมกับนั่งกินขนมปังไปด้วย</p>\n\n<p>ตีสองครึ่ง มาถึงที่บริเวณงาน ฝากของก่อนเลยทักทายนีโม่ นีโม่เอาเจลมาให้อีก 1 ซองขอบคุณมากครับ ยืดกล้ามเนื้อ วิ่งเหยาะๆ เพื่ออบอุ่นร่างกายและกล้ามเนื้อ ดูแต่ละคนจัดเต็มกันทั้งนั้น น่าจะแข็งเอาเรื่อง หลายๆคนวิ่งด้วยกัน ลากกันไป เพราะวันนี้เป็นวันวาเลนไทน์</p>\n\n<p>เช็คอินเข้าจุดสตาร์ท เต้นแอโรบิค วันนี้ถือว่าอากาศดีมาก ไม่หนาวจนเกินไปพอดิบพอดี ใกล้เวลาปล่อยตัวแล้วตื่นเต้นมาก ตีสามปุ๊บปล่อยตัวทันทีครับ สนามจริงเริ่มต้นขึ้นแล้ว!!!</p>\n\n<h3 id=\"10km-แรกก็เจ็บแล้ว\">10km แรกก็เจ็บแล้ว</h3>\n\n<p>เริ่มวิ่งออกจากจุดสตาร์ทจาก มช. ก็เลี้ยวขึ้นไปสักการะครูบาก่อน ตรงนี้เป็นเนินตัดกำลังเพราะต้องวิ่งขึ้นไปสูงพอสมควร ตอนวิ่งขึ้นไม่เท่าไหร่ แต่ตอนลงนี้กินหัวเข่าเอาเรื่องเหมือนกัน</p>\n\n<p>หากวิ่งเหมือนที่เคยซ้อมผมจะดูนาฬิกาตลอด แต่ว่าตอนนี้มี Pacer คอยนำวิ่งอยู่ผมก็เลยไม่ดูนาฬิกาดีกว่าคอยตาม Pacer 4:30 ไปเรื่อยๆ เพราะผมลองคำนวณดู 4:30 ชั่วโมงพอดีกับระบบการหายใจของผม ตอนนี้ก็ตามตูดเขาไปเรื่อยๆ จนกระทั่งแซงไปก่อนเพื่อเก็บระยะเผื่อเดินข้างหน้า</p>\n\n<p>เข้ากิโลเมตรที่ 5 ปวดฉี่เลยแวะฉี่ข้างทางที่ป้อมตำรวจฉี่สักพักจนลูกโป่ง 4:30 (ต่อไปจะเรียกลูกโป่งเฉยๆครับ) ผ่านไป ฉี่เสร็จก็วิ่งออกมายังตามได้อยู่ครับ ตามห่างๆสักสามนาที</p>\n\n<p>เข้าสู่กิโลเมตรที่ 6 เริ่มแล้วครับที่เดิมเข่าขวาเจ็บขึ้นมาแล้วครับ ในใจคิดว่า “นี่พึ่งเริ่มเอง ยังเหลืออีกตั้งเยอะ จะไหวไหมเนี่ย” ตัวผมเองก็หวั่นๆ กลัวมาก กลัวจะวิ่งไม่ไหวหากเจ็บขึ้นมา เริ่มคิดถึง Spray ที่พี่กตบอกให้ซื้อ พยายามไม่คิดเรื่องเจ็บ แวะกินกล้วยกับแตงโมงแล้ววิ่งต่อไป</p>\n\n<h3 id=\"15-km-เจ็บมาแทบจะไม่ไหว\">15 km เจ็บมาแทบจะไม่ไหว</h3>\n\n<p>หลังจากผ่าน 12km มาเริ่มกัดเจลซองแรกก่อนเพื่อรักษาพลังงานในร่างกายของตนเอง อาการเจ็บยังคงอยู่ และเริ่มเจ็บมากขึ้นเรื่อยๆ เจ็บมาจนจะเดินไม่ไหวแล้วพี่ที่วิ่ง Pacer 4:30 บอกว่า Spray อยู่ข้างหลังครับ นี่จะให้เราวิ่งไปหรืออย่างไร?</p>\n\n<p>15km เจ็บมากจนต้องหยุด ปล่อยลูกโป่งลอยไปไกลเรื่อยๆ คิดไว้ในใจว่าเดี๋ยวค่อยวิ่งตามเอาก็ได้ โชคดีที่หมอจักรยานตามมาพอดีขอ Spray เลยครับขอน้องพ่นตรงหัวเข่าเยอะๆ พอค่อยบรรเทาหน่อย จากนั้นก็เริ่มวิ่งได้ต่อ ช่วงนี้จะวิ่งและหยุดเป็นสักพักเนื่องจากเจ็บหัวเข่า พยายามมองหา Spray ตลอด</p>\n\n<p>วิ่งสลับเดิน ลูกโป่งค่อยๆ ลอยไปไกลขึ้นจะตามก็ไม่ไหวแล้วเปลี่ยนแผนใหม่ ต้องไม่ให้ลูกโป่ง 5:00 ทันเรา พอได้เสปรย์เราจะเริ่มวิ่งได้สักพักแล้วก็จะเจ็บอีก แย่มาก ใจคิดว่าจะเลี้ยวกลับดีไหมนะ หรือจะกัดฟันไปต่อ เราจะเจ็บกว่าเดิมไหมนะ?</p>\n\n<h2 id=\"30km-นรกมาเยือนของจริง\">30km นรกมาเยือนของจริง</h2>\n\n<p>20km ผ่านทางแยกระหว่าง  Half  กับ Full มาราธอนตัดสินใจวิ่งตรงไป นั่นหมายความว่า ผมไม่ยอมแพ้!!! ต้องรวบรวมพลังเป็นอย่างมากเพื่อชนะความคิดที่ผ่านมาเมื่อตะกี้และก็ทำได้ ตอนนี้มองไปข้างหน้าไม่เห็นลูกโป่งแล้ว ตอนนี้ผมไม่สนใจลูกโป่งแล้ว สนใจอย่างเดียวคือ Spray T_T</p>\n\n<p>ช่วง 20km – 25km น้องจักรยานพยาบาลเริ่มหายไปแล้วทำยังไงดี ช่วงนี้เริ่มเดินเยอะขึ้น กินกล้วยระหว่างทางเยอะขึ้นเพราะกลัวจะหยุดในช่วง 30km เป็นอย่างมาก เดินๆ วิ่งๆ มองดูบางคนเขาแซงขึ้นไปพร้อมกับหันมาบอกเราตลอด “สู้ๆครับ” “สู้ๆค่ะ” ก็เป็นกำลังใจให้เราเริ่มวิ่งต่อไป แต่การวิ่งก็ต้องเจ็บเข่าอีกโอยยย มันแย่มากๆ</p>\n\n<p>22km กัดเจลซองที่สองเหลือบมองไปอีกฝาก ฟร๊ะ นั่นมัน Harry Jones มองที่หนึ่งวิ่งผ่านไปวิ่งเร็วมากกกก เราก็มองตาละห้อย ควักน้ำดื่มมาล้างปากหลังจากกินเจล ตอนนี้ไม่มีเพื่อนวิ่งละ ช่วงนี้คนห่างมาก กวักมือเรียกน้องพยาบาลมาฉีดสเปรย์ต่อ</p>\n\n<p>25km แล้วลูกโป่งหายไปไหนแล้ว เหลียวมองข้างหลังลูกโป่ง 5:00 ยังไม่มา เริ่มวิ่งต่อทันที กลับตัวที่แยกสะเมิงอาการเจ็บเริ่มหนักขึ้น พยายามมองหาน้องพยาบาลไม่มีแล้วแย่จัง นี่เราต้องเดินแล้วเหรอเนี่ย แล้วจะจบทัน 5:00 ไหมเนี่ย</p>\n\n<p>เริ่มวิ่งเข้าสู้ทางพืชสวนโลกเห็นลูกโป่งวิ่งสวนออกมา เอ๊ะเขายังไปไม่ไกลๆ อาจจะตามทันอยู่ถ้ามีสเปรย์ ตอนนี้วิ่งๆ เดินๆ เพราะเจ็บหัวเข่ามาก ถามสเปรย์ทุกจุดให้น้ำไม่มีเลย T-T เข้าไปวนในพืชสวนโลกแล้วเดินออกมา ย้ำครับเดินออกมา</p>\n\n<h3 id=\"35km-ขอบคุณพี่สาวฉีดสเปรย์ให้\">35km ขอบคุณพี่สาวฉีดสเปรย์ให้</h3>\n\n<p>กิโลเมตรที่ 31-33 ช่วงนี้เดินเป็นส่วนมาก ตอนนี้ท้องฟ้าเริ่มสว่างแล้วเราก็ไม่รู้ว่าตอนนี้กี่โมงและก็ไม่สนใจด้วย ตอนนี้เลิกตามลูกโป่งแล้ว เหลียวหลังบ่อยขึ้นกลัวลูกโป่ง 5:00 ตามทันมาก พยายามกัดฟันวิ่งเข้าไป พอเจ็บมากๆก็หยุด กลายเป็นเดิน</p>\n\n<p>วิ่งๆ เดินๆ ตอนนี้เริ่มเจ็บข้อเท้าเพิ่มเข้ามาด้วย ยังไม่ทันไร โคนขาก็เริ่มมีอาการตามมา ทั้งหมดเกิดขึ้นที่ขาขวา!!! ความคิดเริ่มมาอีกแล้ว วิ่งไม่จบแน่ หารถพยาบาลดีไหม? เราก็ยังยืนยันคำเดิมว่าไม่! ชนะใจตัวเองมาลอด เดินๆ วิ่งๆ จนตอนนี้เหลืออาการเจ็บแค่หัวเข่า ไม่รู้อาการเจ็บที่ข้อเท้ากับโคนขามันหายไปไหน</p>\n\n<p>เริ่มสว่าง ผู้คนเริ่มเยอะรถเยอะขึ้น ทหาร ตำรวจที่คอยดูความเรียบร้อยค่อยๆ โบกรถให้ทุกคนขับรถผ่านก็มอง เขาคงคิดว่ามันมาวิ่งหรือมาเดิน!!! บางคนขับรถผ่านไปยังบอกให้กำลังใจเราให้สู้ๆ ผมสู้อยู่แล้วครับบบบ แต่เจ็บเข่ามากกกก</p>\n\n<p>ช่วงกิโลเมตรที่ 35km พี่สาวคนหนึ่งวิ่งตามหลังมาเห็นเรากระเผกๆ ก็ถามว่าเจ็บเหรอคะ ตอบทันทีครับ!! พี่มีสเปรย์เอาไหม เอาครับบบบบบบ จากนั้นพี่สาวก็ส่งสเปรย์ให้ สวรรค์ทรงโปรด ฉีดสเปรย์ ยกมือไหว้ขอบคุณพี่สาวแล้วเขาก็วิ่งผ่านไป เราเดินสักแป๊บรอสเปรย์ออกฤทธิ์ก็เริ่มวิ่ง อีกมินิมาราธอนก็จบแล้วววววว</p>\n\n<h3 id=\"40km-อีกนิดเดียว-อีกนิดเดียว\">40km อีกนิดเดียว อีกนิดเดียว</h3>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/02/12717251_1245182538831810_2491111134793555492_n.jpg?w=200&amp;h=300\" alt=\"\" /></center>\n\n<p>หลังจากที่ได้สเปรย์จากพี่สาว อาการเจ็บเข่าก็ดีขึ้น ดูป้ายบอกทางตอนนี้ 36km แล้วอีกนิดเดียวจริงๆ กัดเจลซองสุดท้ายเพื่อให้แล้ววิ่งต่อไป แวะกินเกลือแร่ และกล้วยแป็บพักหัวเข่าจากนั้นวิ่งต่อไป ตอนนี้ในใจคิดไปตลอด นี่เราจะทำสำเร็จแล้วนะ อีกนิดเดียววววว</p>\n\n<p>วิ่งไปเรื่อยๆ ตอนนี้เริ่มเห็นแยกเลี้ยวเข้าไปบรรจบ Half กับ Mini ข้างหน้าแล้ว อีกนิดเดียวเท่านั้น!!!</p>\n\n<h3 id=\"ทำได้-เราทำได้\">ทำได้ เราทำได้</h3>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/02/p_20160214_074935.jpg?w=274&amp;h=300\" alt=\"\" /></center>\n\n<p>เลี้ยวเข้ามาบรรจบเส้นเดียวกับ Half และ Mini เริ่มมีเพื่อนวิ่งเยอะขึ้น หลายๆมากับแฟนจูงมือกันวิ่ง บางคนเห็นเราวิ่งแซงก็ปรบมือให้มองป้าย 41km แล้ววอีกนิดเดียว</p>\n\n<p>ถึงประตูวิศวะ มีน้องพยาบาลอยู่ สวรรค์อีกแล้ว ขอฉีดสเปรย์ทันทีครับ เอาเยอะๆเลยเดี๋ยวก็จะถึงแล้ว วิ่งเข้ามาที่ตึกวิศวะฯ น้องร่วมใจกันยืนเชียร์บรรยากาศน่ารักมากครับ ให้กำลังใจทุกคนที่วิ่งผ่าน ถือว่าเป็นการสร้างกำลังใจ และสีสันให้กับนักวิ่งได้ดีเลยทีเดียว</p>\n\n<p>วิ่งขึ้นขอบอ่างแก้วแล้ว ช่วงนี้คนเยอะมากเพราะมีทุกรุ่นวิ่งผ่าน มีช่างถ่ายรูปเยอะมากตรงนี้มองดูป้ายอีก 800 เมตรแล้ววววว</p>\n\n<p>วิ่งลงอ่างแก้วเข้ามาสู่เลนที่จะเข้าเส้นชัย ตอนนี้ยังตื่นเต้นว่าจะใช้เวลาสักเท่าไหร่ก่อนโค้งสุดท้ายมองเห็นพี่สไปเดอร์แมนจอดรถเปิดเพลงอยู่เราก็เต้นให้เขานิดนึง วิ่งเข้าเส้นชัยเหลือบมองเวลา 4:46 ชั่วโมง น้ำตาแทบไหล ที่เคยเจ็บมาหายไปหมด รับเหรียญ รับเสื้อ รู้สึกดีอย่างบอกไม่ถูก เราทำได้ ชนะทุกอย่าง ที่สำคัญชนะตัวเองมาตลอด!!!</p>\n\n<p>พักเหนื่อย</p>\n\n<p>หาของกินครับ ช่วงนี้ก็ไปกินจามซุ้มต่างๆ ที่เขาจัดให้อาหารเยอะมากครับ ตระเวนหาของกินสักพักเห็นท่าไม่ค่อยดีอาการเจ็บหัวเข่ามาอีกแล้วเดินกระเผกกลับไปที่รถกลับบ้านพักผ่อนดีกว่า</p>\n\n<p>ตอนนี้อาการดีขึ้นแล้ว ที่จริงการซ้อมแค่สองอาทิตย์ไม่สมควร และไม่แนะนำด้วยครับซ้อมน้อยมาก เอาใจวิ่งจริงๆ แต่ก็ต้องแลกมาด้วยอาการบาดเจ็บ สู้ซ้อมยาวๆ วิ่งสบายๆ ดีกว่าครับ</p>\n\n<ul>\n  <li>ขอบคุณตำรวจ ทหาร คอยดูแลตั้งแต่ตีสามจนจบ</li>\n  <li>น้องๆ ตามจุดอาหาร น้ำและเกลือแร่ สุดยอดทุกคน</li>\n  <li>น้องๆ จักรยานพยาบาล ถ้าไม่มีน้องๆ พี่ตายแน่</li>\n  <li>จักรยานรักษาตรวจการณ์ ขับตาม ขับตรวจเพื่อความปลอดภัย</li>\n  <li>Pacer ทุกท่านที่คอยให้กำลังใจ เอนเตอร์เทนตลอดเวลา ทำให้วิ่งโดยไม่ต้องดูนาฬิกา</li>\n  <li>BIB จากน้องหนึ่งครับ</li>\n</ul>\n\n<p>สู้ต่อไปครับเพื่อ Ultra Marathon!!!!</p>\n"
    }
    ,
    {
      "title": "Hit Hte Wall",
      "link": "/2016/02/hit-the-wall.html",
      "image": "https://bestrangers.files.wordpress.com/2016/02/photo-1423068657086-889315a2eba8.jpeg",
      "content": "หลังจากที่เมื่ออาทิตย์ก่อนผมกด 20km ไปเรียบร้อยแล้ว สามารถอ่านได้ใน My First 20km ซึ่งเป็นการวิ่งยาวเพื่อเตรียมการวิ่งมาราธอนแรกของผมกับการซ้อมแต่สองอาทิตย์ และหากว่ากันตามตารางแล้ว วันนี้ผมต้องกด 30km ให้ได้",
      "slug": "hit the wall",
      "detail": "<p>หลังจากที่เมื่ออาทิตย์ก่อนผมกด 20km ไปเรียบร้อยแล้ว สามารถอ่านได้ใน My First 20km ซึ่งเป็นการวิ่งยาวเพื่อเตรียมการวิ่งมาราธอนแรกของผมกับการซ้อมแต่สองอาทิตย์ และหากว่ากันตามตารางแล้ว วันนี้ผมต้องกด 30km ให้ได้</p>\n\n<p>วันนี้มาด้วยความมั่นใจ 100% ว่าถ้าเราผ่าน 20km มาแล้ว 30km ก็ไม่น่าจะมีปัญหาสภาพร่างกายผมพร้อมพอสมควรหล้ามเนื้อทุกมัดได้รับการพักผ่อนไปแล้ว 48 ชั่วโมงพอดีอยู่ในสภาพที่ไม่มีล้าเหมือน 20km แน่นอน</p>\n\n<h3 id=\"ซื้อเจล\">ซื้อเจล</h3>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/02/gu-gels-enmasse.jpg?w=736\" alt=\"\" /></center>\n\n<p>เหมือนตอน 20km ผมซื้อ Energy Gel เพื่อเพิ่มพลังระหว่างวิ่งเอาไว้ด้วยเพื่อป้องกันอาการชนกำแพงที่อาจจะเกิดขึ้นโดยที่เราไม่รู้ จัดมาประมาณ 2 ซองครับแพงเอาเรื่องนะครับ 75 บาท ตั้งใจเอาไว้ว่าผมจะกินช่วง 10km และ 20km คงจะพอเป็นพลังงานให้ผมจบ 30km ได้สบายๆ</p>\n\n<h3 id=\"เตรียมตัววิ่ง\">เตรียมตัววิ่ง</h3>\n\n<p>แน่นอนว่าผมต้องวิ่งหลังเลิกงาน วันนี้ผมเลิกงานช่วง 5:30 ก็ไปวิ่งเลยครับ วันนี้จัดกางเกง เสื้อ รองเท้าพร้อมทุกอย่าง เตรียมน้ำไปสองขวดคิดว่าคงจะพอ เพราะรอบที่แล้วผมเตรียมไปขวดเดียวสำหรับ 20km ก็มีเหลืออยู่นิดหน่อย</p>\n\n<h3 id=\"10km-แรก\">10km แรก</h3>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/02/screen-shot-2559-02-09-at-11-15-12-pm.png?w=736\" alt=\"\" /></center>\n\n<p>เป็นไปตามที่หวังเอาไว้ครับ พยายามใช้การหายใจทางจมูกใช้อัตรา 3:2 วิ่งไปนับไปเรื่อยๆ วันนี้คนเยอะพอสมควรที่สนาม 700 ปีเชียงใหม่เนื่องจากมีงานกีฬา ผมยังคงใช้สูตรเดิมที่ใช้มาเมื่อวันอาทิตย์กับการวิ่งเพื่อคุม Pace ตัวเองเหมือนเดิมไม่ให้เร็ว หรือช้าจนเกินไป จะเห็นว่าเมื่อผมใช้วิธีการจับความเร็วของตัวเอง และการหายใจทางจมูก ความเร็วผมเริ่มสม่ำเสมอ Heart Rate ปรกติไม่เหนื่อยมาก แต่ข้อเสียคือต้องวิ่งแบบดูเวลาตลอด หลังจากจบ 10km จัดการโหลด Gel ซองแรกรัวๆ หวังว่าจะมีพลังให้ผมต่ออีก 10km</p>\n\n<h3 id=\"20km\">20km</h3>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/02/screen-shot-2559-02-09-at-11-20-05-pm.png?w=736\" alt=\"\" /></center>\n\n<p>ผ่าน 20km มาจนได้ผมวิ่งไม่หยุดเลย ผมหยุดตอนกินเจลเท่านั้นเอง ช่วง 10 – 20km ผมยังคงใช้สูตรเดิมเนื่องจากพลังผมยังเหลืออยู่ คงเป็นผลมาจาก Gel ด้วยแหละ หากดูตามตารางการวิ่งผมยังค่อนข้างสม่ำเสมอ แต่สิ่งที่ดีอีกอย่างคือ ผมวิ่งโดยปล่อยไหลไปตามธรรมชาติ ใช้ความรู้สึกคุมความเร็ว โดยลดการมองเวลาและระยะทาง ซึ่งผลออกมาก็ยังดีครับ ความเร็วยังสม่ำเสมอ ผมจบ 20km น้อยกว่า 2 ชั่วโมงถือว่าดีกว่าที่ตั้งเป้าไว้</p>\n\n<p>สิ่งที่แย่ที่สุดคือน้ำผมโดยใครไม่รู้เอาไป เพราะก่อนวิ่งผมจะเอาวางไว้ตรงโคนต้นไม้ ใครเอาไปขอให้ท้องเสีย มันรู้สึกแย่มากครับเพราะน้ำผมจะหมดแล้ว ที่มีเหลืออีกอึกเดียว แล้วต้องกิน Gel ด้วยมันจะแสบคอ แต่ยังดีที่มีลุงเขาแจกน้ำฟรี วันนี้เป็นฮีโร่ผมเลย</p>\n\n<h3 id=\"20km-1\">20+km</h3>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/02/screen-shot-2559-02-09-at-11-24-09-pm.png?w=736\" alt=\"\" /></center>\n\n<p>นรกมาเยือนครับ ผมเจ็บหัวเข้าตั้งแต่ 21km ทุกครั้งที่เท้าสัมผัสพื้น จี๊ดขึ้นมาเลยครับ มีครั้งหนึ่งที่ผมถึงกับต้องหยุด เพราะเจ็บมาก คิดว่าไม่เป็นกัดฟันทนเอามันต้องผ่านไปด้วยดี เพราะมาไกลเกินจะหยุดแล้ว</p>\n\n<p>นรกอย่างที่สองคือถุงเท้าครับ จากที่เมื่อก่อนคิดว่าใส่แบบไหน อะไรก็ได้ผิดครับ ถ้าหากวิ่งแค่ 10km แน่นอนครับใส่อะไรก็ได้ ตอนนี้ผมเริ่มรู้สึกว่ามันเสียดสีกับเท้าผมแล้ว นึกภาพออกเลยครับว่าถ้าผมถอดถุงเท้าออกจะเป็นเช่นไร ทนต่อไป</p>\n\n<p>ช่วงนี้ผมใช้การเดิน วิ่งแบบรักษา Pace ครับคือผมจะวิ่งจนรู้สึกว่าขาล้าผมจะเดินครับ เดินจนกว่า Pace จะแตะ 7:00 ผมจะเริ่มวิ่งอีกครั้ง กล่าวคือผมจะเดินเมื่อขาเริ่มล้า และไม่ให้หลุด 7:00 ผมทำได้ครับ และผลออกมาดีด้วย ตอนนี้ความเร็วผมอยู่ที่ 6 ไม่เกิน 7 นั่นหมายความว่าผมสามารถจบ 30km ที่ 3 ชั่วโมงครับ</p>\n\n<h3 id=\"27km-hit-the-wall\">27km Hit the wall</h3>\n\n<p>พอเข้าสู่กิโลเมตรที่ 27 ผมเริ่มรู้สึกปวดที่ขาทั้งสองข้าง หัวเข่าเริ่มไม่พร้อมใช้งาน ตอนนี้ผมรู้เลยครับว่าพลังผมไม่มีเหลือแน่ ผมต้องเดินเยอะขึ้น นั่นหมายความว่าผมจะหลุด Pace 6 แน่นอน เริ่มคิดในใจว่า Gel ทั้งสองที่กินมา จริงๆแล้วมันช่วยผมได้แค่ 4-5km เท่านั้นและตอนนี้มันหมดไปแล้วด้วย เริ่มรู้สึกหิวมาก เหมือนร่างกายจะพยายามหาอาหารเพื่อเอาไปสร้างเป็นพลังงาน ผมยังปลอบใจตัวเองต่อไปให้สู้และบอกว่ามาไกลเกินหยุดอีกนิดเดียว</p>\n\n<p>เมื่อผมประเมิณตัวเองแล้วไม่ไหวแน่นอน ขาผมยกไม่ขึ้นตัดสินใจหยุด และเดินเบาทันที ระหว่างเดินผมปวดขามาก ปวดจนต้องนั่งพัก และลุกไม่ได้อีกเลย ถ้าเป็นแบบนี้ไม่ดีแน่ ดูหัวใจตัวเองเต้นปรกติ ไม่มีอาการวิงเวียนแต่อย่างใด</p>\n\n<h3 id=\"สิ่งที่ผมได้จากการวิ่งวันนี้\">สิ่งที่ผมได้จากการวิ่งวันนี้</h3>\n\n<ul>\n  <li>ให้รู้ว่า Energy Gel ช่วยอะไรผมได้ไม่มากอย่างที่หวัง</li>\n  <li>ถุงเท้าต้องซื้อใหม่ ไม่ใส่ใจไม่ได้แล้ว</li>\n  <li>จะไม่ใส่กางเกงในวิ่งอีกเด็ดขาด แสบมากตอนอาบน้ำ</li>\n  <li>น้ำต้องพอ เกลือแร่ต้องมี</li>\n  <li>ผมพร้อมสำหรับ 42km แม่วันนี้จะไม่ถึง 30km</li>\n  <li>ต้องกินระหว่างวิ่ง</li>\n  <li>ผมวิ่งสม่ำเสมอ หลายๆ เทคนิคใช้ได้ผล</li>\n</ul>\n\n<p><strong>*ผมพร้อมแล้ว CMU Marathon!!</strong></p>\n"
    }
  ]
  ,"next": "/api/feed-8.json"

  ,"prev": "/api/feed-6.json"

}