{
  "pages": [

    {
      "title": "สร้าง Strava Route เอาไว้ใช้กับ Maps.me",
      "link": "/2017/07/create-route-maps-me.html",
      "image": "https://corp.imgsmail.ru/media/images/mapsme11.jpg",
      "content": "สำหรับนั่งวิ่งสายเทรลนั้น หลายคนอยากซ้อมในพื้นที่ที่เป็นภูเขา ซึ่งครั้นจะไปกับเพื่อนก็ไม่รู้ทาง จะตาม Maps ทั้งหลายก็ไม่รู้ว่าจะไปตามเส้นทางได้ถูกหรือเปล่า โหลดแอพ Maps.me มาเพื่อใช้ตอนไม่มีเน็ตก็ไม่รู้ว่าจะ Import Map เข้ามาได้อย่างไร วันนี้เราจะมาคุยเรื่องนี้กันครับ",
      "slug": "create-route-maps-me",
      "detail": "<p>ตามที่เกริ่นไว้ข้างต้นครับ ผมเห็นเพื่อนๆ ถามกันมาหลายคนเลยทีเดียวว่าจะใช้ <a href=\"https://maps.me/en/home\">Maps.me</a> ได้อย่างไร เช่นบางคนใช้ iphone เราจะเอา Maps ของมาใส่ได้ยังไง? แล้วอยากสร้าง map อยากลากเส้นวิ่งเองแล้วเก็บไว้ใน maps.me บทความนี้ตั้งใจจะเริ่มตั้งแต่ลากเส้นแผนที่และเอาไปใส่ไว้ใน Map เลยครับ</p>\n\n<h3 id=\"mapsme-คืออะไร\">Maps.me คืออะไร?</h3>\n<p><a href=\"https://maps.me/en/home\">Maps.me</a> เป็นบริการสำหรับดูแผนที่ซึ่งจุดเด่นคือเราสามารถดูแผนที่และตำแหน่งของเราแบบ Offline ได้ด้วยครับเหมาะสำหรับเอาไว้ใช้เดินป่า หรือเวลาเราไปในที่ที่ต้องการดูแผนที่แต่ไม่มีสัญญาณโทรศัพท์ หรืออินเตอร์เน็ต สามารถไปเขาไปดูรายละเอียดได้ที่และดาว์โหลดได้ที่ <a href=\"https://maps.me/en/home\">Maps.me</a> เลย</p>\n\n<center><img src=\"https://farm5.staticflickr.com/4258/35551846981_b40db28cbe_b.jpg\" /></center>\n\n<p>หลังจากเราติดตัง Maps.me เรียบร้อยแล้ว ขั้นตอนต่อไปเราต้องโหลด Map เพื่อเอาไว้ดู Offline มาก่อน (ผมแนะนำให้ใช้ Wifi ในการโหลด) โดยเราสามารถเลือกโหลดเป็นจังหวัดได้เราจะใช้ที่ไหนก็โหลดของจังหวัดนั้นเอาครับ เมมจะได้ไม่เต็มซะก่อน อย่างตัวอย่างผมก็จะโหลดส่วนของเชียงใหม่มาไว้ โดยไปที่ <code>Settings &gt; Download Maps</code> จากนั้นเราก็สามารถค้นหาจังหวัดที่เราต้องการโหลดแล้วโหลดโลดดดดดด</p>\n\n<h3 id=\"สร้าง-route-ด้วย-strava\">สร้าง Route ด้วย Strava</h3>\n\n<center><img src=\"https://farm5.staticflickr.com/4262/34873053243_5f3825f05a_b.jpg\" /></center>\n\n<p>สำหรับใครที่ใช้ <a href=\"https://www.strava.com\">Strava</a> เราสามารถเข้าไปสร้างแผนที่ของเราเองได้ด้วยครับ โดยไปที่ Dashboard -&gt; My Routes เราก็จะเห็น Route ทั้งหมดที่เราเคยสร้างเอาไว้นั่นเองหากใครยังไม่มี ก็กดที่ <code>Create New Route</code> ได้เลย และใครไม่สร้างไม่เป็นลองอ่านบทความของเขาดูนะ <a href=\"https://support.strava.com/hc/en-us/articles/216918387-Strava-Routes\">Strava Routes</a> ส่วนใครที่ไม่มี Strava ก็ไม่ต้องน้อยใจครับ สามารถสร้างผ่าน <a href=\"https://www.google.com/maps/d/u/0/edit?mid=1DjR5JjL9zJ0HZ4dfXA6exJU7E3k&amp;ll=18.4558348498376%2C98.96548853125&amp;z=7\">Google Map Route Planer</a> ได้เลยนะ</p>\n\n<h3 id=\"export-route\">Export Route</h3>\n<center><img src=\"https://farm5.staticflickr.com/4242/34873053053_7f9e22877d_b.jpg\" /></center>\n\n<p>สำหรับ Strava เราสามารถ Export แผนที่ออกมาได้สองแบบผมเลือกที่จะส่งออกเป็นแบบ .gpx แล้วเซฟลงเครื่องไว้เลย มาถึงตอนนี้เท่าที่ผมลองเปิด Maps.me เครื่องผม (Android) ไม่ยอมเปิดไฟล์ .gpx ผมเลยต้องแปลงไฟล์ก่อนโดยเปิด <a href=\"https://www.google.com/maps/about/mymaps/\">Google My Maps</a> ให้เลือก <strong>“สร้างแผนที่ใหม่”</strong> แล้วจากนั้นให้เราเลือก <strong>“นำเข้า”</strong></p>\n\n<center><img src=\"https://farm5.staticflickr.com/4230/35551847301_869d134eac_b.jpg\" /></center>\n\n<p>ให้เราเลือกไฟล์ .gpx ที่เรา export มาจาก Strava ได้เลย เมื่อเสร็จแล้วเราก็จะได้แผนที่ของเราใน Google My Map ตามภาพครับ</p>\n\n<center><img src=\"https://farm5.staticflickr.com/4083/35551847171_6825f4e172_b.jpg\" /></center>\n\n<h3 id=\"นำ-route-มาไว้ใน-mapsme\">นำ Route มาไว้ใน Maps.me</h3>\n\n<p>สำหรับ Android ผมใช้วิธีเปิด Google My Map แล้วโหลดลงมาที่เครื่องเลย แต่สำหรับ iPhone ผมไม่แน่ใจอาจจะทำได้เหมือน Android วิธีข้างล่าง เพราะยังไม่เคยลอง (ไม่มี iPhone T-T) หากลองแล้วไม่ได้ ให้ export ไฟล์ KML ใน Google My Map แล้วลองส่งเมล์ให้ตัวเองดูครับ แล้วเปิดเมล์ใน Mail app จากนั้นลองเปิดไฟล์แนบดูนะครับ</p>\n\n<center><img src=\"https://farm5.staticflickr.com/4152/35551846941_5b1d5d8f38_b.jpg\" /></center>\n\n<p>เข้า Google My Maps ผ่าน Browser ในโทรศัพท์ครับ</p>\n\n<center><img src=\"https://farm5.staticflickr.com/4002/35551846861_1681763b29_b.jpg\" /></center>\n\n<p>เลือกแผนที่ของเราได้เลย กดเข้าไปดูแผนที่แล้วกดที่ <strong>LEGEND</strong></p>\n\n<center><img src=\"https://farm5.staticflickr.com/4042/35551846791_4fc280fbab_b.jpg\" /></center>\n\n<p>กดที่จุดสามจุดด้ายหลังชื่อแล้วเลือก <strong>ส่งออกไปยัง KML</strong> กดดาว์โหลดแล้วเราก็จะได้ไฟล์ KML เก็บไว้ในเครื่อง</p>\n\n<center><img src=\"https://farm5.staticflickr.com/4142/34873052123_366d63a5b0_b.jpg\" /></center>\n\n<p>ไปที่ดาว์โหลดแล้วกดที่ไฟล์ KML ได้เลย แผนที่จะถูกเปิดโดย maps.me ครับ ไปดูแผนที่ของเราได้ที่ Bookmarl Sets ในแอฟ maps.me ได้เลยยยยย</p>\n\n<center><img src=\"https://farm5.staticflickr.com/4240/35551846601_fc5fe024a4_b.jpg\" /></center>\n\n<p>คราวนี้ก็เอาไปวิ่งแบบไม่ต้องกลัวหลงกันได้แล้วครับ ^^</p>\n\n<hr />\n\n<p>cover image from : <a href=\"https://corp.mail.ru/en/mobile/releases/9866/\">corp.mail.ru</a></p>\n"
    }
    ,
    {
      "title": "Ionic 2–3 Nav Guards",
      "link": "/2017/06/Ionic-2-3-Nav-Guards.html",
      "image": "https://cdn-images-1.medium.com/max/800/1*d_w0M8RoJdXy4l84fsePhg.jpeg",
      "content": "หากใครที่เขียน Angular 2 ~ 4 คงรู้จัก และคุ้นเคยกับ Routing Guards กันอยู่แล้ว พอหันกลับมาเขียน Ionic 2–3 กันบ้างซึ่งเราไม่ได้ใช้ Routes แต่เราใช้ NavController สำหรับการ Push หรือ Pop หน้าต่างๆ ภายใน Ioninc App ทาง Ionic 2–3 ก็มี Feature นี้ให้เหมือนกันนะครับ ชื่อว่า Nav Guards",
      "slug": "Ionic-2–3-Nav-Guards",
      "detail": "<p>หากใครที่เขียน Angular 2 ~ 4 คงรู้จัก และคุ้นเคยกับ <strong>Routing Guards</strong> กันอยู่แล้ว พอหันกลับมาเขียน Ionic 2–3 กันบ้างซึ่งเราไม่ได้ใช้ Routes แต่เราใช้ <strong>NavController</strong> สำหรับการ Push หรือ Pop หน้าต่างๆ ภายใน Ioninc App ทาง Ionic 2–3 ก็มี Feature นี้ให้เหมือนกันนะครับ ชื่อว่า Nav Guards</p>\n\n<p>หลักการเดียวกันกับ Routing Guards ครับ Ionic 2–3 มีเมธอด <strong>ionViewCanEnter</strong> และ <strong>ionViewCanLeave</strong> เพื่อให้เราได้ควบการการเปลี่ยนหน้าต่างๆ ในแอพของเรา</p>\n\n<blockquote>\n  <p>**ionViewCanEnter: boolean/Promise<void>:** Runs before the view can enter. This can be used as a sort of “guard” in authenticated views where you need to check permissions before the view can enter</void></p>\n\n  <p>**ionViewCanLeave: boolean/Promise<void>:** Runs before the view can leave. This can be used as a sort of “guard” in authenticated views where you need to check permissions before the view can leave</void></p>\n</blockquote>\n\n<p><strong>ionViewCanEnter</strong> จะถูกเรียกก่อน เพื่อให้เราได้กระทำการใดๆ ก่อนตัดสินใจว่าจะเข้าสู่เพจนี้หรือไม่\nionViewCanLeave จะถูกเรียกเมื่อจะออกจากเพจนั้นๆ ก่อนที่จะไปยังเพจอื่นๆ</p>\n\n<script src=\"https://gist.github.com/ichaiwut/2bcf42996e0ba89bd3f482956a9869f1.js\"></script>\n\n<p>จากตัวอย่างข้างบนเราจะเห็นว่าก่อนที่เราจะ <em>push(DetailPage)</em> หรือออกจากเพจนี้ไป DetailPage, <strong>ionViewCanLeave()</strong> จะถูกเรียกใช้งาน isValid() เป็น condition ที่เราใช้ตรวจสอบก่อนตัดสินใจออกจากหน้านี้ หากค่าที่ได้ False, .catch() จะทำงาน\nเช่นเดียวกับ <strong>ionViewCanEnter</strong> เพียงตรวจสอบว่าก่อนที่จะเข้าเพจนี้ จรงตาม condition ที่เราตั้งไว้หรือเปล่า</p>\n\n<script src=\"https://gist.github.com/ichaiwut/3e83ba9ac92f50a0d3e0cfece7624b8e.js\"></script>\n\n<p>ทั้งหมดคือการทำงานของ Nav Guards โดยคร่าวๆ ครับลองเอาไปใช้กันดู หรือลองอ่านดูใน Doc ของ <a href=\"https://ionicframework.com/docs/api/navigation/NavController/#nav-guards\">ionic 2–3</a> ก็ได้ครับ</p>\n"
    }
    ,
    {
      "title": "Suunto Ambit3 Peak",
      "link": "/2017/01/suunto-ambit3-peak.html",
      "image": "https://bestrangers.files.wordpress.com/2017/01/suunto-ambit3-peak-foto.jpg?w=1462",
      "content": "เปิดหัวเรื่องมาขนาดนี้แล้วคงหนีไม่พ้นรีวิวนาฬิกาแน่นอนครับบบ Suunto Ambit3 Peak คือเจ้านาฬิกาวัดค่าการออกกำลังกายตัวใหม่ของผมแทนที่อันเดิม Garmin Forerunner 235 ที่ปลดประจำการไปเรียบร้อยแล้วใช้ได้ไม่ถึงปีเลย ใครได้เป็นเจ้าของนี่ถือว่าโชคดีมากเลยนะครับ สำหรับบทความนี้จะมารีวิวเจ้านาฬิกาตัวใหม่นี้กันสักหน่อย ถึงแม้ตัว Spatan จะออกมาแล้วแต่ผมก็ยังคงเลือก Ambit3 Peak เพราะอะไรกันนน",
      "slug": "suunto-ambit3-peak",
      "detail": "<p>เปิดหัวเรื่องมาขนาดนี้แล้วคงหนีไม่พ้นรีวิวนาฬิกาแน่นอนครับบบ Suunto Ambit3 Peak คือเจ้านาฬิกาวัดค่าการออกกำลังกายตัวใหม่ของผมแทนที่อันเดิม <a href=\"http://chaiwut.me/2016/03/08/garmin-forerunner-235\">Garmin Forerunner 235</a> ที่ปลดประจำการไปเรียบร้อยแล้วใช้ได้ไม่ถึงปีเลย ใครได้เป็นเจ้าของนี่ถือว่าโชคดีมากเลยนะครับ สำหรับบทความนี้จะมารีวิวเจ้านาฬิกาตัวใหม่นี้กันสักหน่อย ถึงแม้ตัว Spatan จะออกมาแล้วแต่ผมก็ยังคงเลือก Ambit3 Peak เพราะอะไรกันนน</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2017/01/partnerseite_suunto-logo.jpg\" alt=\"\" /></center>\n\n<p>หลังจากหันมาเอาดีทางเทรลก็ไม่ค่อยได้ลงแข่งทางถนนอีกเลย พอมาเทรลก็กลายเป็นอัลตร้าเทรลอีกต่างหาก หลายๆ อย่างที่ต้องเปลี่ยนแปลงทั้งชุด รองเท้า ฯลฯ แต่อีกอย่างที่จำเป็นไม่แพ้กันและไม่เคยคิดเลยว่าจะต้องเปลี่ยนนั่นก็คือนาฬิกาของผมนั่นเอง ไม่น่าเชื่อเจ้า <a href=\"http://chaiwut.me/2016/03/08/garmin-forerunner-235\">Forerunner 235</a> ไม่ตอบโจทย์ผมสำหรับการวิ่งเทรลเลยจริงๆ</p>\n\n<h3 id=\"เริ่มใช้นาฬิกากับการวิ่ง\">เริ่มใช้นาฬิกากับการวิ่ง</h3>\n\n<p>ย้อนกลับไปเมื่อกลางปีที่แล้วหลังจากจบมาราธอนแรกที่ CMU ตอนนั้นยังใช้โทรศัพท์มือกับ <a href=\"https://www.strava.com/athletes/11408799\">Strava</a> ในการ Track กิจกรรมการวิ่งทั้งระยะทาง ความเร็ว ฯลฯ ซึ่งทั้งหมดใช้ <a href=\"https://www.strava.com/athletes/11408799\">Strava</a> ในการแทร็ค สิ่งที่ได้กลับมาคือโทรศัพท์พังเพราะเปียกเหงื่อ เมื่อเริ่มจริงจังกับการวิ่งมากขึ้น เริ่มเก็บสถิติมากขึ้น ก็มองหานาฬิกาที่ตอบโจทย์การวิ่ง และการซ้อม ณ เวลานั้นจนสุดท้ายไปลงเอยกับเจ้า <a href=\"http://chaiwut.me/2016/03/08/garmin-forerunner-235\">Garmin Foreruner 235</a></p>\n\n<p>ใช้ 235 มาตลอดตั้งแต่ได้มา ดูทุก Feature ใช้ทุกความสามารถของมันจนมันช่วยทำให้ผมมีการวิ่งที่ดีขึ้นมาจนทุกวันนี้ ตั้งแต่งาน <a href=\"http://chaiwut.me/2016/05/06/payao-lake\">วิ่งรอบกว๊าน</a> งานแรกที่ใส่นาฬิกาวิ่งจนกระทั่งงานสุดท้ายที่ใส่เจ้า 235 คือ <a href=\"http://chaiwut.me/2016/12/20/Ultatrail-panoramic\">Ultra-Trail Panoramic 100km</a> ไม่เคยรวน ไม่เคยแฮ้ง ทำงานได้ยอดเยี่ยม แต่สุดท้ายเมื่อเปลี่ยนแผนการวิ่ง 235 จึงไม่เข้ากับกิจกรรมของผม</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2017/01/ambit3.jpg?w=680\" alt=\"\" /></center>\n\n<p>เทรลต้องการรายละเอียดอีกหลายอย่างๆ ในระหว่างวิ่งซึ่งงานที่ทำให้ผมตัดสินใจเปลี่ยนก็คือ Panoramic เมื่อเดือนธันวาคมที่ผ่านมา ซึ่งการวิ่งอัลตร้าเทรลระยะไกลๆ ผมต้องการความสามารถที่มากกว่านั้น และเป็นความสามารถเฉพาะทางที่เหมาะกับกิจกรรมลักษณะนี้ จนต้องมาลงเอยที่ Suunto Ambit3 Peak</p>\n\n<h3 id=\"ทำไมต้อง-abit3-peak\">ทำไมต้อง Abit3 Peak?</h3>\n\n<p>ก่อนที่ผมจะตัดสินฟังธงว่าจะเอาก็ได้ทดสอบและ หาข้อมูลมามากมายพอสมควร ทั้งถามคนที่เคยใช้ ทั้งถามคนที่ไม่ใช้ว่าทำไมไม่เอา เอาข้อดีข้อเสียมาดูกัน ทั้งคนใช้ Fenix 3 และ Suunto ซึ่งจากข้อมูลที่ได้มาบอกได้เลยว่า กินกันไม่ลง แต่ที่ดูแล้วจะเขากับกิจกรรมของผมมากที่สุดก็คงจะเป็น Suunto และราคาที่เป็นมิตร บอกลา Fenix กันไปเลยทีเดียว ทีนี้ผมตัด Garmin ออกเหลือยี่ห้อเดียวต่อไปก็มาเลือกดูว่ารุ่นไหนที่ตรงกับการใช้งานของผมมากที่สุด</p>\n\n<p><strong>Suunto Spartan</strong></p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2017/01/suunto-spartan-3-1467858457601-1jpyosstvwcfu-630-354.jpg\" alt=\"\" />\n<small>http://www.bikeradar.com/road/news/article/suunto-spartan-watch-price-weight-details-47497/</small></center>\n\n<p>รุ่นใหม่ล่าสุดเพิ่มเปิดตัวมาไม่นานด้วยราคาที่ไม่ค่อยเป็นมิตรเลย แต่ก็ต้องดูก่อนว่าความสามารถของมันมีอะไรบ้าง ด้วยความที่มันเป็นตัวแพงสุดของยี่ห้อนี้ และตัวใหม่จอสีสดใส Feature ของมันก็ไม่ต้องพูดถึงครบเครื่องแน่นอนแต่ที่ไม่ถูกใจเลยคือราคานั่นเอง ผมว่ามันแพงไป เก็บไว้ก่อน</p>\n\n<p><strong>Suunto Traverse</strong></p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2017/01/suunto-traverse-outdoor-watch-7.png\" alt=\"\" />\n<small>http://www.lapolicegear.com/suunto-traverse-outdoor-watch.html\n</small></center>\n\n<p>ข้ามมาที่ Traverse กันบ้างมีอะไรน่าสนใจบ้างเอ่ย รุ่นนี้น่าสนใจขึ้นมาอีกหน่อยด้วยราคาที่พอจะเอื้อมถึงมี GPS Glonass ด้วยมันต้องแม่นยำและไม่ช้าแน่นอน และสามารถเพิ่ม Points of Interest (POIs) ได้ถึง 250 จุด แต่ว่าไม่มี  Route Planning หรือ Out Door Map อย่าง Google หรือ MapsBox กด Lap ไม่ได้ และไม่รองรับ FootPod ไม่มีการคำนวณ Personal HR zone โอยยยยยย สรุปมาง่ายๆ คือไม่เหมาะสำหรับใช้งานทางกีฬา เหมาะสำหรับการไปเดินป่า ใช้ชีวิตอยู่ในป่าซะมากว่า เพราะไม่ค่อยเน้น Sport Mode เลยครับ ข้ามๆ ไม่ตอบโจทย์ผมอีกแล้ว</p>\n\n<p><strong>Suunto Ambit3 Sport</strong></p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2017/01/suunto-ambit-3-sport-design.jpg\" alt=\"\" />http://activitytrackerworld.com/suunto-ambit-3-sport-review/</center>\n\n<p>ละความหวังจากสองรุ่นที่ผ่านไป คราวนี้มาดูในกลุ่มของ Ambit3 กันบ้างซึ่งมีหลายโมเดลอยู่เหมือนกันเริ่มจาก Sport กันก่อนรุ่นนี้พอเห็นชื่อแล้วน่าสนใจกับคำว่า Sport เพราะว่ามันต้องใช้งานได้ดีในเรื่องของกีฬาแน่นอนมาดูความสามารถของมันดีกว่า</p>\n\n<p>ถือว่าเป็นตัวเลือกสำหรับนักกีฬาที่อย่างแท้จริงเพราะเป็น multisport watch คือสามารถใช้จับการเล่นกีฬาได้หลายประเภท แบตเตอรี่อยู่ได้นานถึง 15 วันในโหมดนาฬิกา อยู่ในโหมด GPS ได้ประมาณ 10, 15, 100 ชั่วโมงตามลำดับความถี่ของ GPS แต่ถ้าผมเอาไปวิ่ง Utratrail ก็คงจะยังไม่เพียงพอสำหรับผม และรุ่นนี้จะยังไม่มีฟังก์ชั่นที่เกี่ยวกับสภาพอากาศ เช่นความกดอากาศ หรืออุณหภูมิต่างๆ ซึ่งมันก็ไม่ค่อยจำเป็นเท่าไหร่ รุ่นนี้ตอบโจทย์ผมในเบื้องต้น เก็บไว้ก่อน ดูโมเดลอื่นต่อ</p>\n\n<p><strong>Suunto Ambit3 Run</strong></p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2017/01/suntossdds.jpg\" alt=\"\" /></center>\n\n<p>ชื่อนี่ตรงกับกิจกรรมของผมมาก”วิ่ง” ใช่มันต้องถูกออกแบบมาเพื่อตอบโจทย์การวิ่งแน่นอน ไหนลองดูความสามารถของมันสักหน่อยว่ามีอะไรที่พอจะตอบโจทย์ของผมได้บ้าง</p>\n\n<p>โมเดลนี้น้ำหนักจะเบากว่ารุ่น Sport กันน้ำได้ลึก 50 เมตรเช่นเดียวกับ Sport แบตเตอรี่ในโหมดนาฬิการอยู่ได้ประมาณ 14 วัน ความอึดของแบตเตอรี่เหมือนกับ Sport รุ่นนี้ไม่สามารถสร้าง Route เพื่อใช้นำทางได้ ไม่ Support POD ของจักรยาน ในโหมดจักรยานมีแค่ความเร็ว และความเร็วเฉลี่ย โหมดว่ายน้ำมีแต่ระยะทาง ไม่มีโหมด Multisport และ Weather รู้สึกว่ามันออกแบบมาเพื่อวิ่งจริงๆ เก็บเอาไว้ก่อน</p>\n\n<p><strong>Suunto Ambit3 Peak</strong></p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2017/01/suunto20ambit320peak2031.png\" alt=\"\" /><small>http://www.activestride.com.au/buying-guides-help-articles/buying-guide-for-runners-how-to-choose-the-best-running-watch/Enter a caption</small></center>\n\n<p>Peak คือสุดยอดแสดงว่ามันตองสุดยอด ไหนขอมาดูหน่อยซิว่ามัน Peak ยังไง น้ำหนัก 89 กรัมเกือบหนึ่งขีด ถือว่าหนักพอสมควร กันน้ำลึก 100 เมตร แบตอยู่ได้นาน 30 วันในโหมดนาฬิกาอันนี้นานจริงอะไรจริง มีเข็มทิศเหมือนรุ่นอื่นๆ แบตเตอรี่ในโหมด GPS อยู่ได้ 20, 30, 200 ชั่วโมงตามลำดับความถี่ นี่วิ่งจบ Sub 20 ได้สบายๆ โดยไม่ต้องชาร์จแบตเลยนะโหดจริง</p>\n\n<p>Peak สามารถสร้าง Route โดยสามารถวิ่งในโหมด Navigation ได้อีกด้วย สามารถเพิ่มจุดต่างๆ ในเส้นทาง จะปรากฏในแผนที่และตั้งการแจ้งเตือนได้อีกด้วย วัดความเร็วแนวดิ่งโดยใช้เซ็นเซอร์ความกดอากาศทำให้แม่นยำกว่า โหมดจักรยาน โหมดว่ายน้ำ วัดได้ทุกอย่าง Swimming stroke rate, count and type, Swim styles detection with personal style teaching, Stroke efficiency (SWOLF) เต็มไปหมดเลยยยย</p>\n\n<p>อีกหนึ่งฟังก์ชั่นที่ Peak มีแต่ Sport กับ Run ไม่มีคือโหมดสภาพอากาศ ทั้งระดับน้ำทะเล อุณหภูมิ พระอาทิตย์ขึ้น และตก ความกดอากาศ แจ้งเตือนเรื่องพายุ ok พอละแค่แบตอึดทนทานก็ตอบโจทย์ผมได้</p>\n\n<h3 id=\"สัมผัสแรก\">สัมผัสแรก</h3>\n\n<p>กว่าจะหามาได้ก็ไม่ใช่ง่ายๆ เพราะที่ไหนก็หมดแว่วมาว่าเขาจะเลิกผลิตแล้วเลยหายากนิดนึง และผมอยากได้สีดำด้วยเพราะดูแล้วสวยกว่าสีอื่น พอได้มาอยู่ในมือก็ขอสัมผัสรูปร่างภายนอกก่อนละกันเพราะฟังก์ชั่นภายในต้องเสียบ USB เพื่อใช้งานครั้งแรก</p>\n\n<p>ด้วยสีดำด้านที่ดูสวยงามชอบๆ ตัวเรือนนาฬิกาขนาดค่อนข้างใหญ่ หนักพอสมควรเพราะผมไม่เคยใส่นาฬิกาวิ่งที่หนักขนาดนี้มาก่อนแต่เดี๋ยวก็ชิน รู้สึกว่าสายนาฬิกาออกจะบางไปหน่อยกลัวขาดเหลือเกิน ปุ่มกดค่อนข้างยาก แข็งๆ ไปนิดนึงอาจจะเป็นเพราะเพื่อกันเราไปโดนใส่โดยไม่ได้ตั้งใจ โดยรวมการออกแบบสวยงาม</p>\n\n<p>ขอบด้านบนทำมาจากเหล็กกล้าเพื่อความแข็งแรงป้องกันการกระแทก กระจกทำจากคริสตัล (รุ่นธรรมดา) เคสทำมาจาก Polyamide ซึ่งเป็นเทอร์โมพลาสติก  เหนียว แกร่ง ขยายตัวได้มาก ส่วนสายนาฬิกาทำมาจากซิลิโคนครับ</p>\n\n<h3 id=\"รายละเอียดทั่วไปเบื้องต้น\">รายละเอียดทั่วไปเบื้องต้น</h3>\n\n<p>Peak กันน้ำได้ลึกถึง 100 เมตร <a href=\"https://en.wikipedia.org/wiki/Water_Resistant_mark#ISO_6425_divers.27_watches_standard\">(ISO 6425)</a> ซึ่งในความเป็นจริงแล้วผมก็ไม่ได้จะเอาดำน้ำขนาดนั้นฮาาาา แต่มีไว้ก็ไม่เสียหลาย ไว้มีโอกาสจะเอาไปลองสักหน่อย แบตเตอรี่แบบ Lithium-ion อยู่ในนาน 30 วันในโหมดนาฬิกา บอกเวลาได้ 2 โซนสามารถอัพเดตเวลาตาม GPS ได้ มีตัวจับเวลาสลับหน้าจอมืดสว่างได้ แสดงหน่วยวัดได้สองแบบ Metric และ Imperial units สามารถลง App เพิ่มเติมได้</p>\n\n<h3 id=\"โหมดเข็มทิศ-และอุณหภูมิแวดล้อม\">โหมดเข็มทิศ และอุณหภูมิแวดล้อม</h3>\n\n<p>โหมดเข็มทิศของ Peak แสดงเป็นแบบดิจิทัลวัดความเอียงแบบมีการชดเชยค่า แสดงหน่วยวัด 2 หน่วยคือหน่วย<a href=\"https://th.wikipedia.org/wiki/%E0%B8%AD%E0%B8%87%E0%B8%A8%E0%B8%B2_(%E0%B8%A1%E0%B8%B8%E0%B8%A1)\">องศา (drgree) และ มิล (angular mil)</a> มีความแม่นยำในระยะ 5 องศา สามารถล็อกองศาเพื่อนำทางได้อีกด้วย อุณหภูมิที่เหมาะสมของเครื่องอยู่ที่ประมาณ -20° C ถึง +60° C และอุณหภูมิแนะนำเวลาชาร์ตแบตควรอยู่ประมาณ 0° C ถึง +35° C</p>\n\n<h3 id=\"gps-และระบบนำทาง\">GPS และระบบนำทาง</h3>\n\n<p>Peak สามารถตั้งค่าความถี่ในการบันทึก GPS ได้ 1, 5 และ 60 วินาทีซึ่งแต่ละความถี่แบตเตอร์รี่ก็จะอยู่ได้นาน 20, 30 และ 200 ชั่วโมงตามลำดับ ความแม่นยำก็จะแตกต่างกันออกไป ระบบพิกัดของแผนที่ของ Peak มีให้เลือกอยู่หลายตัวเลือกตามพื้นที่ที่เราอยู่ หรือจะไปเลือกให้เหมาะสมเพื่อจะได้พิกัดที่แม่นยำ ระบบพิกัดแผนที่ที่ Peak มีให้คือ  WGS84 Hd.d°, WGS84 Hd°m’ s.s”, WGS84 Hd°m.m, UTM, MGRS, British (BNG), Finnish (ETRS-TM35FIN), Finnish (KKJ), Irish (IG), Swedish (RT90), Swiss (CH1903), UTM, NAD27 – Alaska, UTM NAD27 – Conus, UTM NAD83, New Zealand (NZTM2000) โดยค่าเริ่มต้นอยู่ที่ WGS84 Hd.d° ซึ่งเป็นรูปแบบพิกัดของสากล <a href=\"http://www.space.mict.go.th/knowledge.php?id=wgs84\">อ่านเพิ่มเติม</a> ส่วนใครจะใช้พิกัดไหนก็หาข้อมูลกันดีๆ นะครับ</p>\n\n<p>Peak สามารถนำทางโดยแผนที่แสดงบนหน้าจอและสามารถเพิ่มหมุด หรือปักหมุดสถานที่ต่างๆ Points of Interest (POIs) ได้มากถึง 250 เลยทีเดียว นอกจากนั้นเรายังสามารถสร้างแผนที่ของเราเอง หรือเวลามีงานแข่งสามารถโหลดไฟล์ .gpx เข้ามาได้อีกด้วย</p>\n\n<h3 id=\"ตัววัดระยะความสูง\">ตัววัดระยะความสูง</h3>\n\n<p>Peak มาพร้อม Brometer วัดความสูงด้วยความกดอากาศ ซึ่งเราสามารถเลือกได้ในเมนูว่าจะวัดความสูงด้วย GPS หรือ Baromatic หรือหากไม่ใจเพื่อความแม่นยำสามารถใช้ฟีเจอร์  <a href=\"http://www.suunto.com/Support/Feature-index/\">FusedAlti™</a> เป็นเครื่องหมายการค้าของเขาเลยแหละโดยการใช้ทั้งสองแบบเข้ามาวัดค่าความสูงเพื่อความแม่นยำ</p>\n\n<p>Peak ยังสามารแสดงความชันออกมาเป็น Graph และบอกทั้งความสูงที่ไต่ไปทั้งหมด และความชันที่ลดลงได้อีกด้วย และยังมาพร้อมความสามารถวัดความเร็วแนวดิ่ง โดยวัดจากความกดอากาศเป็นหลักโดยค่าความสูงที่สามารถวัดได้จะอยู่ตั้งแต่ -500 ไปจนถึง 9999 เมตรเลยทีเดียว</p>\n\n<p><a href=\"https://jothailand744.wordpress.com/2014/10/17/pressure-altitude/\">หากใครยังงๆ เรื่องการใช้ความกดอากาศวัดความสูงลองอ่านที่นี่ครับ</a></p>\n\n<h3 id=\"ตัววัดสภาพอากาศ\">ตัววัดสภาพอากาศ</h3>\n\n<p>อีกความสามารถที่น่าสนใจของ Peak ก็คือสามารถตรวจสอบสภาพอากาศได้ วัดค่าความดันที่ระดับน้ำทะเล (Sea Level Pressure: SLP) ได้และแสดงออกมาเป็นกราฟ ดูความเปลี่ยนแปลงของความกดอากาศที่ผ่านมาเพื่อคำนวณแน้วโน้มในการเกิดพายุครับ แสดงอุณหภูมิปัจจุบันได้โดยจะมีค่าระหว่าง -20° C ถึง +60° C  แสดงพระอาทิตย์ขึ้นและตก และมีเตือนภัยพายุด้วยครับ ดีจริงๆ</p>\n\n<h3 id=\"ตัววัดความเร็วและระยะทาง\">ตัววัดความเร็วและระยะทาง</h3>\n\n<p>Peak สามารถวัดความเร็วในการออกกำลังกายชนิดต่างๆ และสร้าง Lap ขึ้นมาเองได้ หรือเราจะตั้งค่า Lap ด้วยตนเองก็ได้ และสามารถสร้าง Lap ในการออกกำลังการแต่ละครั้งได้ถึง 1000 laps เลยทีเดียว มี Auto Pause ให้เวลาหยุดอยู่กับที่นานๆ รวมไปถึงยังรองรับ Foot Pod หรือ Bike Pod อีกด้วยครับ</p>\n\n<h3 id=\"อัตราการเต้นของหัวใจ\">อัตราการเต้นของหัวใจ</h3>\n\n<p>การวัด HR นั้นจำเป็นต้องอาศัยสายคาดอกซึ่งแถมมาใน Peak อยู่แล้ว สามารถวัดคลื่นไฟฟ้าหัวใจ RR Interval (คือระยะห่างระหว่างR wave กับ R waveที่ติดกันหน่วยเป็นsec) วัดการเต้นหัวใจต่อหนึ่งนาที BPM หรือจะแสดงเป็น % ก็ได้วัดได้แบบ real time สามารถคำนวณการเผาผลาญแคลลอรี่ สามารถแสดงค่า EPOC แบบ real time <a href=\"http://oorrunningblog.blogspot.com/2016/05/fitness-plan-with-training-effect.html\">(อะไรคือ EPOC)</a></p>\n\n<h3 id=\"multi-sport-and-running-mode\">Multi-Sport and Running Mode</h3>\n\n<p>Peak มาพร้อมกับโหมด Multisport ซึ่งเราสามารถเรื่องเก็บสถิติในหลายๆ ชนิดกีฬาโดยรวมไปถึงไตรกีฬาอีกด้วย สามารถที่จะเปลี่ยนชนิดกีฬาในขณะที่กำลังทำกิจกรรมอยู่ก็ได้ แต่ในโพสนี้ขอพูดถึงแค่ วิ่ง ว่ายน้ำ แล้วก็ปั่นจักรยานแล้วกันครับ มาเริ่มกันที่โหมดวิ่งกันก่อนเลย ที่จริง Peak ยังมาพร้อมกับความสามารถในการจัดการตรางวิ่งของเราเองโดยจัดการผ่าน <a href=\"http://Movecounts.com\">Movecounts.com</a> แล้วโหลดมาไว้ที่นาฬิกาได้ หรือหากจะวิ่ง Interval ก็ตั้งในนาฬิกาได้เลย</p>\n\n<p>สำหรับการวิ่งนั้นสามารถดูความเร็วแบบ Pace การวิ่งของเราโดยสามารถดูได้ทั้งแบบเฉลี่ย (AVG Pace) หรือแบบเรียลไทม์ก็ได้ครับ ส่วน Running cadence นาฬิกาจับให้อัตโนมัติ แต่หากมี Foot POD ก็สามารถเลือกใช้ได้เช่นกัน คำนวณประสิทธิภาพการวิ่งด้วยเทคโนโลยี <a href=\"https://www.firstbeat.com/en/consumer-products/suunto/\">(Firstbeat™)</a> และยังสามารถคำนวณเวลา Recovery ด้วยครับ</p>\n\n<h3 id=\"cycling-mode\">Cycling Mode</h3>\n\n<p>มาต่อกันที่โหมดปั่นกันบ้าง จับความเร็วในโหมดปั่นเหมือนนาฬิกาทั่วไป แสดงค่าความเร็วแบบเรียลไทม์ และความเร็วแบบเฉลี่ยแบบเรียลไทม์ได้ แสดงความลาดเอียงของถนน ตัววัดพลังงานการปั่น (Bike Power (W)) สามารถตั้งความถี่ในการวัด (3s, 10s, 30s) และแสดงแบบ Graph ได้ด้วย รวมไปถึงการจับความเร็วแบบแนวดิ่งด้วยครับ</p>\n\n<h3 id=\"swimmimg-mode\">Swimmimg Mode</h3>\n\n<p>โหมดว่ายน้ำสามารถเลือกว่าจะว่าในสระ หรือว่ายนอกสระจับความเร็ว (pace) ระยะทาง สามารถกำหนดความยาวของสระ กำหนดรอบ สามารถนับ Stroke ของการว่ายน้ำ และสามารถกำหนดท่าการว่ายได้ ดูประสิทธิภาพการว่าย  Stroke Efficiency (SWOLF) และใช้ Heart Rate ขณะว่ายน้ำได้ด้วยครับ</p>\n\n<h3 id=\"การเชื่อมต่อ\">การเชื่อมต่อ</h3>\n\n<p>เชื่อมต่อผ่านโทรศัพท์ และคอมพิวเตอร์โดยสาย USB หรือ Bluetooth สามารถตั้งค่าต่างๆ ของนาฬิการผ่านมือถือได้เลยทันทีครับ ไม่จำเป็นต้องกดตั้งค่าในนาฬิกาก็ได้ทุกอย่างจะซิงค์หากันหมดเลย รวมไปถึงการเชื่อมต่อระหว่างนาฬิกากับนาฬิกาด้วยกันเอง และยังสามารถรับและเตือน Notification ของโทรศัพท์ได้ด้วยครับ</p>\n\n<p>พอละเดี๋ยวจะยาวไป โพสนี้ผมอ้างอิงมาจากเว็บไซต์ของ Suunto นะครับลองไปอ่านทั้งหมดได้ที่ <a href=\"http://www.suunto.com/Compare-Products/?products=12655\">http://www.suunto.com/Compare-Products/?products=12655</a> เลยครับเยอะอยู่เหมือนกัน</p>\n\n<p>ส่วนเจ้าอื่นๆ ที่ความสามารถใกล้ๆ กันนั้นก็ไม่ทราบเพราะผมไม่เคยใช้ครับ 555 เช่น Garmin Fenix 3 อาจจะดีกว่า หรืออาจจะแย่กว่า อันนี้ไม่ทราบจริงๆ เพราะเคยใช้แค่ 235 ครับ</p>\n\n<center><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/sdfCxZ9nTl0\" frameborder=\"0\" allowfullscreen=\"\"></iframe></center>\n"
    }
  ]
  ,"next": "/api/feed-2.json"


}