{
  "pages": [
    
    {
      "title": "วิ่งรอบกว๊าน Payao Lake 26km",
      "link": "/2016/05/payao-lake.html",
      "image": "https://bestrangers.files.wordpress.com/2016/06/1458673_194755980869798_1436171146601193090_n1.jpg",
      "content": "หลังจากห่างจากสนามวิ่งไปเดือนกว่าใช้เวลากับการซ้อมเทรล แล้วซ้อมพัฒนาตนเองก็ได้มีโอกาสออกสนามจริงอีกสักที ยังหวั่นๆว่าจะทำได้ดีแค่ไหน เพราะสนามนี้ half+ ซะด้วย และไม่ได้ซ้อมอะไรมากมายเลยซ้อมเยอะสุดก็แค่ 10km เท่านั้นเอง",
      "slug": "payao-lake",
      "detail": "<p>หลังจากห่างจากสนามวิ่งไปเดือนกว่าใช้เวลากับการซ้อมเทรล แล้วซ้อมพัฒนาตนเองก็ได้มีโอกาสออกสนามจริงอีกสักที ยังหวั่นๆว่าจะทำได้ดีแค่ไหน เพราะสนามนี้ half+ ซะด้วย และไม่ได้ซ้อมอะไรมากมายเลยซ้อมเยอะสุดก็แค่ 10km เท่านั้นเอง</p>\n\n<p>ที่จริงงานนี้สมัครไว้นานละเพราะเห็นว่าเป็นงานใหญ่แน่นอน และระยะทางเป็นอะไรที่พอดีเหมาะสำหรับการซ้อมทางเรียบสนามจริงก่อนไปเทรลที่เขาประทับช้างด้วย และอีกอย่างคุยกับตัวเองเอาไว้แล้วว่าจะไม่ลงวิ่งงานเล็กๆ หรืองานมินิทั่วไปอีกถ้าไม่จำเป็น อีกเหตุผลคือต้องการใช้เวลากับครอบครัวมากกว่าแข่ง จึงเลือกลงเฉพาะรายการใหญ่เท่านั้น</p>\n\n<h3 id=\"ซ้อมก่อนแข่ง\">ซ้อมก่อนแข่ง</h3>\n\n<p>หลายคนซ้อมก่อนแข่งนานมาก บางคนเป็นเดือน บางคนเป็นสองเดือน หลายคนเลือกสนามนี้เป็น Half แรกของพวกเขาหลายคนเลยตั้งความหวังและเอาจริงเอาจังกันมาก</p>\n\n<p>ผมเหรอ…. ไม่ได้ซ้อมยาวเลยครับมัวแต่ซ้อมเทรลวิ่งขึ้นลงบนเขา และซ้อม Interval กับวิ่งตามตารางซ้อมง่ายๆ ตาม Heart rate ซึ่งก็ไม่ได้ซ้อมสำหรับแข่งรายการนี้ซักเท่าไหร่ และซ้อมระยะไกลสุดน่าจะประมาณ 12km เท่านั้นเอง เพราะเวลาส่วนใช้เวลาใหญ่อยู่กับลูก และคิดแต่การวิ่งเทรล แต่ถึงยังไงคิดไว้ว่าคงไม่เกินความสามารถของเราหรอก (นักวิ่งสายห้าว)</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/06/13331115_10206209652510820_1726422246796534954_n.jpg?w=736\" alt=\"\" /></center>\n\n<h3 id=\"วางแผนก่อนแข่ง\">วางแผนก่อนแข่ง</h3>\n\n<p>ไปถึงพะเยาก็เกือบมืดแล้วรับ BIB ไปโรงแรมแล้วออกไปกินข้าวกับทีม ทุกคนจัดหนักโหลดคาร์โบฯ กันแบบจัดหนัก เราก็โหลดด้วยเลยมี พิซซ่า, สปาเก็ตตี้ และสลัด โหลดเยอะพรุ่งนี้ก็ต้องผลาญออกให้หมด</p>\n\n<p>สำหรับผมอีกหนึ่งอย่างที่ต้องทำคือการกินก่อนวิ่งเรื่องนี้สำคัญสำหรับผมนะ หลายคนบอกว่าเวลาไม่พอทำไม่ได้ อันนี้ก็แล้วแต่คนครับ บางคนกินแล้วย่อยไม่ทันก็มี การกินก่อนวิ่งผมจะอัดขมปังแผ่นเข้าไปครับจะประมาณ 3 แผ่นก่อนวิ่งแค่ 1 ชั่วโมง พอเริ่มกินจะอยากเข้าห้องน้ำทันทีเป็นอีกหนึ่งอย่างที่ผมทำมาตลอดก่อนวิ่ง</p>\n\n<p>จบเรื่องการกิน มาเรื่องการวิ่ง ดูจากแผนที่แล้วมีน้ำและเหลือแร่บริการอยู่ทุก 2km ดังนั้นผมไม่จำเป็นต้องถือขวดน้ำหรือนำสายคาดเอวไปด้วย ผลไม้มีอยู่หลายจุดถือว่าโอเค ทีแรกลังเลเรื่องเจลว่าจะเอาไหม แต่ก็ขอจากพี่กตมากันไว้ก่อน 1 ซองก็เพียงพอ</p>\n\n<p>การวิ่งวางเป้าหมายเอาไว้ว่าจะวิ่งใน Pace 5.40 – 6.00 เพราะกลัวไม่จบและไม่อยากเดิน อยากวิ่งตลอดทาง คิดเอาไว้ว่าถ้าวิ่งใน Pace นี้คงวิ่งแบบสบายๆ จากนั้นกลับมาทบทวนเรื่อง Heart Rate เลยเปลี่ยนใจว่าเอา Heart Rate เป็นหลักดีกว่า ไม่อยากเหนื่อยแล้วหยุดเดิน แต่หากจะเดินจริงวางแผนเอาไว้ว่าจะเดินหลังจากกิโลเมตรที่ 21 หรือจบ Half ก่อนั่นเอง</p>\n\n<center>\n    <h3>เวลาที่คาดหวังเอาไว้ 2:40 ชั่วโมง</h3>\n</center>\n\n<h3 id=\"แข่งจริง\">แข่งจริง</h3>\n\n<p>ที่จุดสตาร์ทคนไม่แน่นเท่าไหร่ หาเวลาออกไป Warmup ก่อนเพื่อเตรียมกล้ามเนื้อให้พร้อม ใช้วิธีวอร์มอัพแบบ Dynamic Stretching ประมาณ 5 นาที</p>\n\n<p>เริ่มวิ่งพยายามจะไม่วิ่งเร็วตอนแรกออกตัว แต่พอดูเวลาอยู่ Pace 5.05 – 5.10 ถือว่าเร็วกว่าที่ตั้งใจไว้แต่ Heart Rate ยังอยู่ในกรอบก็ยังประคองไปได้เรื่อยๆ</p>\n\n<p>ช่วง 10km ความเร็วที่ใช้มาถือว่าดีมากตอนนี้ประมาณ 5.20 – 5.30 ตั้งใจกับตัวเองตอนนั้นว่าจะวิ่งในช่วงนี้ไปจนจบให้ได้เพราะไม่รู้สึกเหนื่อยมาก สามารถวิ่งได้เรื่อยๆแน่ในความเร็วประมาณนี้ เริ่มแซงหลายๆ ตนขึ้นมาแต่ก็มีหลายคนแซงไปเรื่อยๆ</p>\n\n<p>ช่วง 10 – 20km ช่วงนี้เส้นทางวิ่งจะอยู่ประมาณหลังหว๊านพะเยา ติดภูเขาและน้ำถือว่าเป็นเส้นทางที่สวยงาม อีกหนึ่งสิ่งที่ประทับใจคือมีชาวบ้านออกมาเชียร์ ออกมานั่งข้างทางทำให้เรามีกำลังใจวิ่งขึ้นอีกเยอะ</p>\n\n<p>20-26km หลังจากผ่าน half ไปหลายๆคนก็เริ่มหมดแรงแต่เรายังสามารถวิ่งตาม Pace ได้อย่างสบายคิดอยู่ในใจว่านี่คงเป็นผลจากการซ้อมแบบ Interval ด้วยส่วนหนึ่ง ช่วงนี้เริ่มแซงขึ้นไปหลายคนมาก เพราะหลายๆคนเริ่มเดินกันแล้ว จำได้ว่าแซงไปประมาณสิบกว่าคนเลยทีเดียว จนกระทั่งเข้าเส้นชัย</p>\n\n<center>\n    <h4>จบงานนี้ด้วยเวลาที่ดีในระดับหนึ่ง ดีกว่าที่ตั้งไว้ และ Pace ก็ดีมากจบที่ 5.23 m/h เวลา 2.20 ชั่วโมงอันดับที่ 108 overall และอันดับที่ 15 ในรุ่นอายุ</h4>\n</center>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/06/13319884_10154266274063338_8440941527156563295_n.jpg?w=736\" alt=\"\" /></center>\n\n<h3 id=\"สรุป\">สรุป</h3>\n\n<ul>\n  <li>งานวิ่งจัดได้ดีพอสมควรอาจจะเพราะมีแขกพิเศษด้วย</li>\n  <li>เสื้อสวยแต่วงแขนแคบ หลายคนใส่วิ่งแล้วบาดรักแร้</li>\n  <li>การตกแต่งไม่สวยเลย ทั้งที่งานใหญ่และมีแขกพิเศษ น่าจะตกแต่งได้ดีกว่านี้</li>\n  <li>เรื่องน้ำ เกลือแร่ อาหาร ทำได้ดีมาก ขอชมเชย</li>\n  <li>พิธิกรเอนเตอร์เทนมากเกินไป บางเรื่องอาจดูไม่ตลกสำหรับบางคน</li>\n  <li>เหรียญสวยดี</li>\n  <li>เส้นทางสวยงาม</li>\n  <li>พิธีรับรางวัลง่ายไป ไม่ให้เกียรติคนได้รับรางวัลเลย</li>\n</ul>\n"
    }
    ,
    {
      "title": "เปลี่ยนใจมาวิ่งเทรล",
      "link": "/2016/05/to-the-trail.html",
      "image": "https://bestrangers.files.wordpress.com/2016/05/first-film-in-5-peaks-trail-running-series-pacer-films.jpg",
      "content": "ช่วงระยะหลังจากจบมหาวิทยาลัยเชียงใหม่มาราธอนเมื่อเดือนกุมภาพันธ์ที่ผ่านมา หลังจากวันนั้นก็เริ่มมีความคิดที่จะเปลี่ยนแนวการวิ่งของตัวเองทันที มินิมาราธอน ฮาร์ฟมาราธอน มาราธอน ผ่านมาหมดแล้ว ต้องลองอะไรใหม่ๆ ดูบ้างดีกว่า ความคิดนี้เริ่มมาตั้งแต่ก่อนวิ่งมาราธอน เนื่องจากติดตามกลุ่มของ Ultra Trail ใน Facebook มาตลอด ซึ่งเป็นกลุ่มที่คอยแบ่งปันข่าวสาร และติดตามการแข่งขันในรายการใหญ่ๆ ที่มีนักวิ่งไทยไปวิ่ง ก็เกิดแรงบันดาลใจว่าสักวันเราจะไปให้ถึงจุดนั้นให้ได้",
      "slug": "to-the-trail",
      "detail": "<p>ช่วงระยะหลังจากจบมหาวิทยาลัยเชียงใหม่มาราธอนเมื่อเดือนกุมภาพันธ์ที่ผ่านมา หลังจากวันนั้นก็เริ่มมีความคิดที่จะเปลี่ยนแนวการวิ่งของตัวเองทันที มินิมาราธอน ฮาร์ฟมาราธอน มาราธอน ผ่านมาหมดแล้ว ต้องลองอะไรใหม่ๆ ดูบ้างดีกว่า</p>\n\n<p>ความคิดนี้เริ่มมาตั้งแต่ก่อนวิ่งมาราธอน เนื่องจากติดตามกลุ่มของ Ultra Trail ใน Facebook มาตลอด ซึ่งเป็นกลุ่มที่คอยแบ่งปันข่าวสาร และติดตามการแข่งขันในรายการใหญ่ๆ ที่มีนักวิ่งไทยไปวิ่ง ก็เกิดแรงบันดาลใจว่าสักวันเราจะไปให้ถึงจุดนั้นให้ได้</p>\n\n<p>หลังจากจบมาราธอนแรก ก็เริ่มมีความคิดว่านี่คือที่สุดของการวิ่งแล้วเหรอ? วิ่งๆ วิ่งไปเรื่อยๆ จนถึงเส้นชัยก็จบ ไม่น่ามีอะไรตื่นเต้นมากไปกว่าความเร็วของการวิ่ง บางคนใช้เวลาเป็นปีตั้งเริ่มวิ่งจนจบมาราธอนแรก ผมใช้เวลา 4 เดือน ที่จริงมันก็ไม่ได้มีอะไรมาก แต่วิ่งให้จบแค่นั้นเอง</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/05/povoavarzim.jpg?w=736\" alt=\"\" /></center>\n\n<p>มันน่าเบื่อไปไหมกับการวิ่งแบบนี้? นี่คือคำถามแรกหลังจากวันที่วิ่งมาราธอนแรกจบ จริงๆมันเป็นความรู้สึกส่วนตัวไม่ได้เกิดขึ้นกับทุกคนนะ โดยเฉพาะคนที่ยังหลงไหลในความเร็ว คำว่าน่าเบื่อสำหรับผมคือการที่ต้องวิ่งแบบเดิมซ้ำๆ ไปเรื่อยๆ ไม่มีอะไรน่าตื่นเต้นไปมากกว่าความเร็ว และถนนลาดยางเท่านั้นเอง ลองวิ่งในป่าดูไหม</p>\n\n<p>ผมติดตามผู้คนที่วิ่งเทรลหลายๆคน ทั้งในเฟสบุ๊ค และ Strava ได้เห็นประสบการณ์ เส้นทาง สภาพเส้นทางวิ่ง สภาพแวดล้อมต่างๆ ผ่านทางภาพถ่ายที่นักวิ่งถ่ายระหว่างวิ่ง ช่างเป็นอะไรที่น่าสนใจและท้าทายเหลือเกิน เป็นการวิ่งที่แทบจะไม่ต้องคำนึงถึงความเร็ว ปล่อยวางเรื่อง Pace ต่างๆ สนใจในธรรมชาติ จดจ่อกับสภาพเส้นทาง เทคนิคการวิ่ง ฯลฯ</p>\n\n<h3 id=\"อะไรที่ต่างจากวิ่งบนถนน\">อะไรที่ต่างจากวิ่งบนถนน?</h3>\n\n<p>เส้นทางวิ่ง แน่นอนสิ่งแรกที่มองเห็นได้ชัดคือเส้นทางวิ่ง ถนนก็คือถนนลาดยาง คอนกรีต อาจจะมีลูกรังบ้างนั่นคือถนนที่ทุกคนใช้วิ่ง แต่การวิ่งเทรลเส้นทางวิ่งคือดิน หิน โคลน ลำธาร ฯลฯ ส่วนใหญ่จะมีความชันมากหรือน้อยขึ้นอยู่กับสถานที่และสภาพแวดล้อมด้วย ดังนั้นวิธีการวิ่งก็ต่างกันออกไปด้วย พื้นที่ไม่เรียบและไม่สม่ำเสมอท่าวิ่งของเราก็ต้องเปลี่ยนไปตามสภาพเส้นทาง การลงเท้าที่ไม่แน่นอน การใช้สมาธิไหวพริบ ทุกก้าวที่เหยียบลงไป มีอันตรายเสมอเพราะความไม่เรียบของเส้นทาง</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/05/trailrunning_ne2.jpg\" alt=\"\" /></center>\n\n<p>ความเร็ว เราไม่สามารถใช้ความเร็วเหมือนการวิ่งบนถนนหรือพื้นราบ เพราะวิ่งเทรลจะมีขึ้นเขา ลงเขา บางครั้งเราอาจจะต้องลดความเร็วเมือขึ้นเนิน ลงเนิน หรือเมื่อสภาพเส้นทางนั้นไม่เอื้อสำหรับการวิ่ง ไม่จำเป็นที่เราต้องวิ่งตลอดทาง เดินเมื่อจำเป็นต้องเดิน</p>\n\n<p>ธรรมชาติ นี่คือสิ่งที่หาได้น้อยจากการวิ่งบนถนน การวิ่งเทรลทำให้เราใกล้ชิดธรรมชาติมากขึ้น บางครั้งเราวิ่งขึ้นเขาแบบเหนื่อยๆ แต่พอไปถึงขัางบน ได้เจอกับความเย็นสบายของธรรมชาติ สิ่งต่างๆรอบตัวที่ดูแล้วผ่อนคลาย ทำให้เรามีความสุขอย่างบอกไม่ถูก</p>\n\n<h3 id=\"สรุป\">สรุป</h3>\n\n<p>ความท้าทาย  ความยาก ความฟิต เป็นสิ่งที่ผมชอบเราสามารถวิ่งช้า แต่เรามีความอึด ได้เจอกับธรรมขาติที่สวยงาม ได้ใช้สติ ความคิดในการวิ่ง ทำให้ผมไม่เคยเบื่อ และเปลี่ยนใจมาวิ่งเทรล!</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/05/bl_hq_150220_alpine-performance_wallpapers-trail_robert-boesch_2-1_800x400.jpg?w=736\" alt=\"\" /></center>\n"
    }
    ,
    {
      "title": "Salomon Speedcross 3",
      "link": "/2016/05/salomon-speed-cross.html",
      "image": "https://bestrangers.files.wordpress.com/2016/05/salomon-cover.jpg",
      "content": "เมื่ออาทิตย์ที่ผ่านมาถือโอกาสเริ่มซ้อมวิ่งเทรลในสภาพใกล้เคียงกับสนามจริง เพราะตัวผมเองมีโปรแกรมเขาประทับช้างเทรลกลางเดือนมิถุนายนนี้ ถึงเวลาที่ผมต้องเริ่มซ้อมจริงจังกับการวิ่งในป่า และสภาพขึ้นเนินลงเนิน ลองซ้อมอยู่หนึ่งรอบในป่าหลังห้วยตึงเฒ่า ผลที่ออกมาคือได้แผลที่นิ้วเท้า และเสียเล็บเท้าไปอย่างน้อย 2 นิ้ว นี่จึงเป็นอีกหนึ่งเหตุผลที่ผมต้องใช้รองเท้าเทรล",
      "slug": "salomon-speed-cross",
      "detail": "<p>เมื่ออาทิตย์ที่ผ่านมาถือโอกาสเริ่มซ้อมวิ่งเทรลในสภาพใกล้เคียงกับสนามจริง เพราะตัวผมเองมีโปรแกรมเขาประทับช้างเทรลกลางเดือนมิถุนายนนี้ ถึงเวลาที่ผมต้องเริ่มซ้อมจริงจังกับการวิ่งในป่า และสภาพขึ้นเนินลงเนิน ลองซ้อมอยู่หนึ่งรอบในป่าหลังห้วยตึงเฒ่า ผลที่ออกมาคือได้แผลที่นิ้วเท้า และเสียเล็บเท้าไปอย่างน้อย 2 นิ้ว นี่จึงเป็นอีกหนึ่งเหตุผลที่ผมต้องใช้รองเท้าเทรล</p>\n\n<p>ซ้อมวิ่งในป่าครั้งแรกใช้รองเท้าคู่เดิม New Balance 890 V5 ซึ่งเป็นรองเท้าวิ่งคู่ใจของผมเอง แต่ผลที่ได้รับกลับไม่ค่อยปลื้ม ได้รับบาดเจ็บที่เท้าค่อนข้างเยอะ เพราะรองเท้าไม่ได้ออกแบบมาสำหรับวิ่งบนพื้นที่ไม่เรียบ เช่น พื้นดิน หรือหิน เลยซัพพอร์ทเท้าเราได้ไม่ดีพอ</p>\n\n<p>มองหารองเท้าเทรลที่ใช่ เหมาะสมกับเราทั้งเรื่องการใช้งานและราคาอยู่นานแสนนาน หารีวิว ไปดูตามร้านต่างๆ ในห้าง ลองมาหลายๆ ยี่ห้อจนในที่สุดก็มาจบที่ Salomon Speedcrosss 3 คู่นี้</p>\n\n<p>รองเท้าคู่ที่สองในชีวิต ในราคาที่เอื้อมถึงและคุณภาพที่เหมาะสมกับราคา และความพอใจของผมเอง</p>\n\n<h3 id=\"รูปร่างลักษณะภายนอก\">รูปร่างลักษณะภายนอก</h3>\n\n<p>Speedcross 3 ออกแบบมาเพื่อการเดินเขา และวิ่งเทรลรูปร่างอาจจะบึกบึนถึงกับใหญ่กว่ารองเท้าเทรลยี่ห้ออื่นพอสมควร แต่ก็ไม่น่าเกลียดจนเกินไป เนื้อผ้าหนาๆ ดูแล้วรู้สึกว่าใส่แล้วต้องร้อนแน่นอน ลิ้นรองเท้าที่ขยับได้แค่ส่วนบน ส่วนที่เหลือติดกับตัวรองเท้าคงจะน่ารำคาญไม่น้อย</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/05/02752-03.png\" alt=\"\" /></center>\n\n<p>รูปทรงลวดลายดูสวยงาม และสีสันสะดุดตา ผมชอบสีเจ็บๆ แบบนี้นะ สีเขียวสะท้อนแสง สีแดง สีส้มอะไรแบบนี้ ถือว่าเรื่องสีของ Speedcross 3 ทำได้ดีมาก</p>\n\n<p>สายรองเท้าเป็นแบบรูดเพื่อความสะดวกในการใส่และถอดรองเท้าและป้องกันสายรองเท้าหลุดขณะกำลังวิ่ง แต่สำหรับผมชอบสายแบบผูกมากกว่า เชือกร้องเท้าแลดูเส้นเล็กมาก แต่ก็ไม่ใช่ว่าจะขาดง่ายๆ นะครับ เหนียวเอาเรื่องครับ เมื่อรูดสายรัดแล้วสามารถเก็บไว้ไต้ลิ้นรองเท้าด้านบนได้ครับ</p>\n\n<p>น้ำหนักของรองเท้าประมาณ 310 กรัมครับดูจากรูปร่างที่ค่อนข้างเทอะทะแล้ว น่าจะมากกว่านี้ แต่ได้เท่านี้ถือว่าโอเคแล้วครับ</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/05/original.jpg\" alt=\"\" /></center>\n\n<p>รูปร่างของรองเท้าค่อนข้างเรียวครับ ไม่เหมาะอย่างยิ่งสำหรับคนหน้าเท้ากว้าง เพราะตอนปลายจะค่อนข้างเรียวมาก ตอนใส่ผมยังรู้สึกตรงนิ้วก้อยอยู่พอสมควร อาจจะเป็นเพราะถุงเท้าด้วยแหละครับ</p>\n\n<h3 id=\"พื้นรองเท้า\">พื้นรองเท้า</h3>\n\n<p>พื้นรองเท้าหากดูด้วยจะรู้สึกว่าแข็ง ถึงแข็งมาก แต่เอาเข้าจริงไม่ได้แข็งเหมือนที่เห็น ภายนอกแข็งพอประมาณ เวลาใส่ก็ยังนุ่มกระชับเท้าพอสมควร พื้นรองเท้ามีปุ่มช่วยเกาะเวลาต้องการไต่ขึ้น หรือช่วยเบรกเวลาวิ่งลงเขาอันนี้ลองมาแล้วค่อนข้างประทับใจพอสมควรครับ</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/05/20150330032221.jpg\" alt=\"\" /></center>\n\n<h3 id=\"ใช้งานจริง\">ใช้งานจริง</h3>\n\n<p>เป็นธรรมดาเมื่อใด้ของมาใหม่เราก็ต้องเห่อกันหน่อยครับ ไปวิ่งแห่เกิบ (แห่รองเท้า) กันสักหน่อยละกัน เชียงใหม่จะโชคดีที่เรามีสนามซ้อมและแข่งเทรลหลายที่ จะเก็บความชัน เก็บบรรยากาศ หรือวิ่งกินลมชมวิวก็ได้ เอาที่เราชอบ ทดสอบรองเท้าครั้งนี้ผมเลือกสถานที่หลังห้วยตึงเฒ่า เข้าป่าวิ่งทั้งหิน ทราย และดินแข็งครับ</p>\n\n<p>เริ่มจากวิ่งตามถนนลูกรังเข้าก่อน แรกสัมผัสพื้นดินให้ความรู้สึกมั่นคงดีครับ อาจจะเทอะทะไปหน่อยเพราะความใหญ่ของฟองน้ำของตัวรองเท้า (เพราะผมยังไม่คุ้นกับรองเท้า) ช่วงนี้ไม่มีอะไรมากครับเพราะเป็นทางราบ</p>\n\n<p>เข้าสู่ทางดินทราย ตรงนี้เป็นทางซ้อมของรถ ATV ครับมีลักษณะคดเคี้ยว ขึ้นเนินเล็กน้อย ตรงนี้ก็การเกาะค่อนข้างโอเคครับ เพราะพี้นรองเท้ามีปุ่มเกาะอยู่ลดการลื่นเวลาวิ่งโค้งครับ</p>\n\n<p>ทางขึ้นเขา ช่วงนี้เป็นพื้นดินแข็งวิ่งเข้าในป่า พื้นรองเท้าถือว่าทำได้ดีเหมือนกัน ทางช่วงนี้มีทั้งขึ้นและลง เจ้าปุ่มที่พื้นรองเท้าช่วยไต่ได้ในระดับหนึ่ง แต่พอเจอดินแข็งๆ ก็ออกลื่นๆ เหมือนกันครับ</p>\n\n<p>ทางหินและกรวด ช่วงนี้ทางจะแข็ง ด้วยพื้นที่ค่อนข้างแข็ง บวกกับมีปุ่มเพื่อไต่ขึ้น ทำให้ความมั่นใจลดลงพอสมควร การกดเท้าลงบนพื้นหิน ด้วยพื้นรองเท้าที่ยกค่อนข้างสูง หากไม่คุ้นเคยกับรองเท้า อาจจะเจอกับข้อเท้าพลิกได้ง่ายครับ ถึงแม้รองเท้าจะช่วยป้องกันในเบื้องต้น แต่ก็ต้องระวังครับ</p>\n\n<p>พื้นแฉะ หรือน้ำ อันนี้ยังไม่เคยครับ แต่เห็นว่าสามารถกันน้ำได้ในระดับหนึ่งครับ</p>\n\n<p>###สรุป</p>\n\n<ul>\n  <li>รูปร่างค่อนข้างใหญ่ตามสไตล์รองเท้าไต่เขา</li>\n  <li>สีสันลวดลายสวยอันนี้ชอบ</li>\n  <li>กระชับเท้า ไม่เหมาะสำหรับคนเท้ากว้าง</li>\n  <li>สายรูดดูเหมือนง่าย แต่ใช้งานค่อนข้างยาก</li>\n  <li>รองเท้าหน้าเรียว บีบนิ้วก้อย</li>\n  <li>พื้นรองใช้งานได้บนพื้นทราย ดิน ส่วนหินต้องระวังเรื่องข้อเท้าพลิก</li>\n  <li>การระบายอากาศทำได้ดีในระดับหนึ่ง</li>\n  <li>ป้องกันอาการบาดเจ็บของนิ้วเท้าเวลาลงเขา</li>\n  <li>กันน้ำในระดับหนึ่ง</li>\n  <li>กันกระแทก ไม่ขาดง่าย</li>\n</ul>\n"
    }
  ]
  ,"next": "/api/feed-6.json"
  
  ,"prev": "/api/feed-4.json"
  
}