{
  "pages": [
    
    {
      "title": "น้องคีตา 1 ขวบแล้วนะ",
      "link": "/2016/02/keeta-1-year-old.html",
      "image": "https://bestrangers.files.wordpress.com/2016/02/12651014_1200053476690872_184242323770386809_n.jpeg",
      "content": "ผ่านไป 1 ฝน 1 หนาว 1 ร้อน แล้วสำหรับลูกสาวที่น่ารักของผม หนึ่งปีตั้งแต่เขามาอยู่กับเรามาเติมเต็มคำว่าครอบครัวมากยิ่งขึ้นกว่าเดิม ก่อนหน้านั้นเคยคิดว่าถ้ามีลูกต้องเหนื่อยแน่ ต้องลำบากหลาอย่าง ต้องทำนู่น ต้องมีนี่ เยอะแยะไปหมด แต่พอมีลูกแล้วรับรู้ได้ทันทีว่ามีความสุขกว่าเดิม มีกำลังใจในการทำอะไรมากกว่าเดิมตั้งเยอะ ชีวิตดีขึ้นมากกว่าเดิมต่างหาก",
      "slug": "keeta-1-year-old",
      "detail": "<p>ผ่านไป 1 ฝน 1 หนาว 1 ร้อน แล้วสำหรับลูกสาวที่น่ารักของผม หนึ่งปีตั้งแต่เขามาอยู่กับเรามาเติมเต็มคำว่าครอบครัวมากยิ่งขึ้นกว่าเดิม ก่อนหน้านั้นเคยคิดว่าถ้ามีลูกต้องเหนื่อยแน่ ต้องลำบากหลาอย่าง ต้องทำนู่น ต้องมีนี่ เยอะแยะไปหมด แต่พอมีลูกแล้วรับรู้ได้ทันทีว่ามีความสุขกว่าเดิม มีกำลังใจในการทำอะไรมากกว่าเดิมตั้งเยอะ ชีวิตดีขึ้นมากกว่าเดิมต่างหาก</p>\n\n<h3 id=\"วันแรกที่รู้\">วันแรกที่รู้</h3>\n\n<p>ย้อนกลับไปเมื่อเดือนมิถุนายนปีที่แล้ว เป็นวันที่ได้รู้ว่ามีน้องมาอยู่ด้วยแล้ว ตอนนั้นตื่นเต้นมากความรู้สึกเหมือนกับว่าอยากให้เขาเกิดออกมาแล้ว อยากเห็นเขา อยากแล่นกับเขาทุกๆ น้ำตาแทบไหลเมื่อแฟนส่งภาพการตรวจครรภ์มาให้ดู ตื้นตันใจอย่างบอกไม่ถูก</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/02/10868106_10205116211882427_2042933946744242988_n.jpg\" alt=\"\" /></center>\n\n<h3 id=\"อยากรู้แล้วว่าตัวเล็กเป็นหญิงหรือชาย\">อยากรู้แล้วว่าตัวเล็กเป็นหญิงหรือชาย</h3>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/02/10583051_10204164378447186_6758841327279638555_o1.jpg?w=736\" alt=\"\" /></center>\n\n<p>ทุกคนพอรู้ว่าเรามีตัวเล็ก ก็ย่อมอยากจะทราบเพศเป็นธรรมดา ตัวผมเองก็เหมือนกันรวมทั้งแฟนและคนรอบข้างด้วย แฟนดูแลครรภ์ตลอดเวลา ทำทุกอย่างเพื่อลูกน้อยในท้อง ทุกครั้งที่หมอนัดไปอัลตร้าซาวน์ เราก็มักจะลุ้นอยู่ตลอดเวลาว่า จะได้ลูกสาว หรือลูกชาย</p>\n\n<p>ทุกครั้งๆ จะมีคนเฝ้ามาถามตลอดเวลาว่าลูกสาว หรือลูกชาย แต่ก็ไม่ได้คำตอบอะไรทั้งสิ้นเพราะแม้แต่หมอที่ตรวจยังไม่ทราบเลย น้องคงอยากให้ลุ้นในวินาทีที่เกิดมามากกว่า</p>\n\n<h3 id=\"คลอดแล้วววว-1222558\">คลอดแล้วววว 12/2/2558</h3>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/02/10868169_800939129980457_9174848381609416999_n.jpg\" alt=\"\" /></center>\n\n<p>วินาทีที่ได้ยินเสียงน้องร้องไห้ดังออกมาจากห้องคลอด เป็นวินาทีที่วิเศษเป็นอย่างมาก รับรู้ได้ทันทีว่าชีวิตที่เหลือต่อจากนี้ไป เรามีอีกคนหนึ่งเป็นกำลังใจให้เราสู้ต่อไป พอพยาบาลเอาน้องออกมาจากห้องคลอด พร้อมกับบอกว่า “คุณพ่อได้ลูกสาวนะคะ” น้ำตาแทบไหลเมื่อเห็นหน้าเขาครั้งแรก</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/02/604108_995465690482986_3869605357488439353_n.jpg?w=225&amp;h=300\" alt=\"\" /></center>\n\n<blockquote>\n  <p>คีตา = เพลง, บุหรง = นกยูง\nเมื่อใดที่นกยูกกู่ร้องเรียกหาคู่ เสียงเพรียกอันไพเราะ ความสวยงามเมื่อรำแพน สวยและไพเราะยิ่งกว่าเสียงอื่นใด เป็นที่มาของชื่อคีตาบุหรง (สวยงาม และไพเราะเหมือนนกยูง)</p>\n</blockquote>\n\n<h3 id=\"ชีวิตเปลี่ยนไปจากเดิมเมื่อมีเขา\">ชีวิตเปลี่ยนไปจากเดิมเมื่อมีเขา​</h3>\n\n<p>หลังจากที่มีลูกสาวชีวิตของเราทั้งสองคนเปลี่ยนไป ผมอยู่เชียงใหม่เพราะมีภาระหน้าที่หลายๆ อย่างที่ต้องรับผิดชอบ ทุกครั้งที่ต้องห่างเขา แทบจะไม่อยากกลับมาเชียงใหม่เลยคิดถึงมาก และทุกครั้งที่เขามาเชียงใหม่แล้วเขาจากไป เราก็แทบจะทำใจไม่ได้เช่นกัน</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/02/10374919_10207680168259734_5004898916597046586_n.jpg\" alt=\"\" /></center>\n\n<p>ตอนนี้รู้แล้วว่าความรู้สึกคิดถึงลูกเป็นเช่นไร</p>\n\n<p>มีความสุขทุกครั้งที่เขาอยู่ข้างๆ มีความสุขทุกครั้งที่ได้มองอีกหนึ่งชีวิตที่เป็นสายเลือดของเราเติบโตขึ้นในแต่ละวัน ถึงบ้างครั้งอาจจะร้องไห้ หัวเราะ แต่ทุกครั้งเรามีความสุข ยิ่งเมื่อเขาค่อยๆเติบโตขึ้นเราเองกลับลุ้นว่าพัฒนาการของเขาต่อไปคืออะไร คว่ำ คลาน ยืน เดิน วิ่ง</p>\n\n<h3 id=\"คำว่าครอบครัว-สมบูรณ์แบบเมื่อมีเขา\">คำว่าครอบครัว สมบูรณ์แบบเมื่อมีเขา</h3>\n\n<p>หลายคนคิดอยู่เสมอว่าคำว่า “ครอบครัว” ก็คือการแต่งงานใช้ชีวิตอยู่ร่วมกัน อันนี้ถูกต้องแต่มันยังไม่ใช่ทั้งหมด ผมก็เคยคิดแบบนี้เช่นกัน แต่เมื่อมีเขาเข้ามา กลับทำให้เรารู้สึกว่านี่เองคือสิ่งที่มาเติมเต็มคำว่าครอบครัวให้สมบูรณ์ยิ่งขึ้นกว่าเดิม</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/02/10167967_1204381532924733_2992105602043496820_n.jpg?w=736\" alt=\"\" /></center>\n\n<p>เราทั้งสองคนมีโซ่คล้องใจ ทุกสิ่งที่ทำ ทุกอย่างที่คิด สิ่งแรกคือลูก ทุกครั้งที่ท้อ ทุกครั้งที่เหนื่อยคนแรกที่คิดถึงก็คือลูก คิดอยู่เสมอคิดอยู่ตลอดทุกอย่างไม่ใช่แค่เพื่อเรา เพื่อใครคนหนึ่ง แต่ทั้งหมดนั่นเพื่อคำว่าครอบครัว</p>\n\n<p>บางครั้งเราอาจทำได้ไม่ดีเท่าไหร่ บางทีอาจต้องใช้เวลาเพื่อปรับในหลายๆสิ่ง แต่ทุกครั้งไม่เคยเลยที่ไม่คิดถึงครอบครัวเพื่อเขา เพื่อลูก กลัวมาก กลัวเขาโตขึ้นมาไม่มีอะไรเหมือนคนอื่น กลัวเขาโตขึ้นมาแล้วลำบาก กลัวเขาโตขึ้นมาแล้วไม่มีความสุข สัญญาจะทำทุกอย่างให้เขามีความสุข</p>\n\n<h3 id=\"1-ปีแล้ว\">1 ปีแล้ว</h3>\n\n<p>ตั้งแต่วันนั้น ถึงตอนนี้ก็ 1 ปีแล้วที่มีเขาเข้ามาสร้างความเป็นครอบครัวที่สมบูรณ์ ใช่เราอาจจะเป็นพ่อที่ยังไม่ดีที่สุดที่ควรจะเป็น แต่ก็ต้องยอมรับว่าคนเป็นแม่แข็งแกร่งมากจริงๆ ทำทุกอย่างเพื่อลูก เพื่อครอบครัว เพื่อให้เขาอยู่สบายไม่ร้องไห้ ให้เขาเติบโตมาอย่างมีคุณภาพที่สุด</p>\n\n<p>ทุกพัฒนาการของเขาน่าอัศจรรย์ยิ่งนัก ตั้งแต่เริ่มคว่ำ เราก็ดีใจแล้ว คลานได้ เดินได้ พูดได้ ทุกเหตุการณ์เรายินดี และมีความสุขมาก บางครั้งดีใจจนน้ำตาไหล ต้องแอบร้องไห้ที่เขาทำได้ เพราะความดีใจ และความรู้สึกเหล่านั้นไม้อธิบายไม่ได้จริงๆ</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/02/1915310_1203776859651867_8809023510937172606_n.jpg?w=736\" alt=\"\" /></center>\n\n<p>ชีวิตเปลี่ยนไปโดยสิ้นเชิงเมื่อมีเขา เลิกในหลายสิ่ง ลดลงในหลายๆอย่าง รู้อย่างเดียวว่าเราต้องแข็งเรงเมื่อเขาโตขึ้น เพื่อที่จะอยู่ดูแล และมองดูเขาเติบโต และประสบความสำเร็จในชีวิตของเขาให้ได้ ต้องอยู่ถึงวันนั้นให้ได้</p>\n\n<p>ขอบคุณที่เข้ามาเติมเต็มหลายๆ สิ่งในชีวิต ขอบคุณที่เข้ามาเปลี่ยนชีวิตทำให้พ่อรู้ว่าอะไรที่ควรทำ อะไรที่ควรเลิก อะไรที่ควรลด และอะไรที่ควรเพิ่ม 1 ปีที่ผ่านมาอาจจะไม่ได้ดีที่สุดก็ก็จะพยายามทำทุกอย่างให้ดียิ่งกว่าเดิม เพื่อครอบครัว เพื่อลูก และเพื่ออนาคตข้าง “ฉันดีใจที่มีเธอ”</p>\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/HL1MGTbZA3E\" frameborder=\"0\" allowfullscreen=\"\"></iframe>\n"
    }
    ,
    {
      "title": "After Started Running",
      "link": "/2016/02/after-started-running.html",
      "image": "https://bestrangers.files.wordpress.com/2016/02/photo-1452626038306-9aae5e071dd3.jpeg",
      "content": "ต่อเนื่องจากบล็อกที่ผ่านมา เรื่องไปเท่ียวเยอรมนี กลับกลายเป็นว่าไม่ได้บันทึกอะไรเพิ่มเติมเลย เพราะมีอะไรที่ต้องทำหลายเรื่องเหลือเกิน ทั้งเรื่องการ และที่สำคัญการสังสรรค์ และการพบปะผู้คน ที่บางครั้งกว่าจะกลับที่พักก็ปาเข้าไปตีสองตีสาม อีกวันก็ต้องไปเที่ยวอีกเป็นต้น",
      "slug": "after-started-running",
      "detail": "<p>ต่อเนื่องจากบล็อกที่ผ่านมา เรื่องไปเท่ียวเยอรมนี กลับกลายเป็นว่าไม่ได้บันทึกอะไรเพิ่มเติมเลย เพราะมีอะไรที่ต้องทำหลายเรื่องเหลือเกิน ทั้งเรื่องการ และที่สำคัญการสังสรรค์ และการพบปะผู้คน ที่บางครั้งกว่าจะกลับที่พักก็ปาเข้าไปตีสองตีสาม อีกวันก็ต้องไปเที่ยวอีกเป็นต้น</p>\n\n<p>แต่ยังมีเรื่องราวประทับใจหลายเรื่องตอนที่อยู่เยอรมนี โดยเฉพาะเรื่องที่ต้องจดจำไปจนวันตายไม่มีทางลืมคือเรื่องของการได้เข้าไปสัมผัสบรรยากาสของลีกสูงสุดของเยอรมนี Bundesliga นั่นเอง เอาไว้อ่านในบันทึกย้อนหลังแล้วกันครับ</p>\n\n<h3 id=\"บล็อกของวันนี้\">บล็อกของวันนี้</h3>\n\n<p>กลับมาที่บล็อกของวันนี้ตามหัวเรื่องครับ <code>After I started running</code>. ความหมายก็ตรงตัวครับ เพราะจะพูดถึงเรื่องราวหลังจากที่ผมวิ่งเป็นจริงเป็นจังว่าเกิดอะไรขึ้นกับตัวเองบ้าง ก่อนจะไปถึงตรงนั้น <del>หากต้องการอ่านบันทึกเรื่องราวที่เกี่ยวกับการวิ่งของผมสามารถเข้าไปอ่านที่อีกบล็อกหนึ่ง whorun.wordpress.com ครับตรงนั้นจะเป็นเรื่องราวทั้งหมดที่ผมบันทึกเกี่ยวกับการวิ่งของผม </del></p>\n\n<p>ที่จริงเรื่องที่บันทึกวันนี้ก็เป็นเรื่องราวเกี่ยวกับการวิ่งเช่นกันครับ แต่ต้องการจะบันทึกเก็บเอาไว้ในเรื่องราวทั่วไปของตัวเองบ้างครับ</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/02/screen-shot-2559-02-09-at-1-48-25-pm.png?w=736\" alt=\"\" /></center>\n\n<p>เริ่มวิ่งครั้งแรกก็วิ่งๆเดินเพราะเรายังไม่เข้าหลักการอะไรมากมาย วิ่งไปหยุดไป เหนื่อยก็พัก ไม่รักก็พอ เอ้ยไม่ใช่ วิ่งๆ หยุดๆ อยู่อย่างนั้นักประมาณ 3 กิโลเมตรแล้วก็หยุด ตอนนี้ใช้ใช้ Strava แต่เอาไว้ดูระยะทางส่วนอื่นไม่เคยสนใจเลย</p>\n\n<h3 id=\"เปลี่ยนรองเท้า\">เปลี่ยนรองเท้า</h3>\n\n<p>หลังจากเริ่มวิ่งสองสามครั้ง หลังจากแขางฟุตบอลเสร็จก็เริ่มติดใจเอ๊ะ เราควรเปลี่ยนเปลี่ยนรองเท้าแล้วนะ เพราะเริ่มรู้สึกถึงอาการบาดเจ็บที่ฝ่าเท้าหลังจากเริ่มวิ่งในระยะทางที่เร็วขึ้น ดูบันทึกในเรื่องของ New Balance 890 v5 ว่าใช้รองเท้าอะไรมีความเป็นมายังไง พอได้รองเท้าแล้วใส่วิ่งก็เริ่มติดใจมากขึ้น เพราะหลังจากได้ได้รองเท้าทุกอย่างเปลี่ยนไปในทางที่ดีขึ้นจริงๆ นี่แหละที่เขาบอกว่าได้รองเท้าดียิ่งวิ่งได้ดีกว่าเดิม แต่หนักเรื่องราคานิดนึง</p>\n\n<h3 id=\"เริ่มดูระยะทาง-และเวลาในการวิ่ง\">เริ่มดูระยะทาง และเวลาในการวิ่ง</h3>\n\n<p>พอเราใช้ Strava ในการดูระยะทางของเรา ก็เริ่มที่จะดูรายละเอียดต่างๆ ภายในแอพมากขึ้นโดยเฉพาะเรื่องของเวลาที่ใช้ไปต่อระยะทาง หรือบางคนเรียกง่ายว่า “Pace” ยิ่งเพจต่ำเท่าไหร่แสดงว่าวิ่งได้เร็วเท่านั้น จากนั้นก็เริ่มพัฒนาตัวเองขึ้นพยายามทำเวลาให้ดีกว่าเดิม เริ่มวิ่งมากขึ้น หาเวลาวิ่งเยอะขึ้น ตัดสิ่งที่ไม่จำเป็นในชีวิตออกเพื่อหาเวลาในการวิ่งให้เยอะขึ้น เพราะมีเรื่องของมาเวลามาคอยกำหนดตัวเอง ยิ่งได้เห็นระยะเวลาการวิ่งของคนอื่นๆ ยิ่งทำให้เรามีความตั้งใจว่าจะต้องวิ่งแบบนั้นให้ได้</p>\n\n<h3 id=\"มินิมาราธอนแรก\">มินิมาราธอนแรก</h3>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/02/12195940_10153833322734835_374745590338924434_n.jpg?w=225&amp;h=300\" alt=\"\" /></center>\n\n<p>หลังจากวิ่งมาประมาณหนึ่งเดือนก็ถึงเวลาสักทีกับการลงสนามจริงสักครั้ง เลือกการแข่งขันที่น่านไปกับพี่ๆ ที่ทำงาน กระซิบรับคูโบต้า น่าน มาราธอน สนามแรกที่จะลองทำการแข่งจริงกับนักวิ่งคนอื่นดูบ้าง มีความกังวลอะไรมากมายเกิดขึ้นที่สนามแห่งนี้ ทั้งเรื่องอาการของไขข้ออักเสบซึ่งเป็นโรคประจำตัวอยู่แล้ว แต่พอได้ลงแข่งจริงกลับสนุกและเริ่มรู้สึกหลงไหลในการแข่งมากขึ้น</p>\n\n<p>วิ่งสนามนี้เป็นสิ่งดีเพราะได้มีโอกาสรู้จักกับนักวิ่งหลายๆ คนที่มีประสบการณ์ เริ่มเป็นสังคมแห่งการวิ่งมากยิ่งขึ้น น้ำใจต่างๆ บรรยากาศการแข่งขัน ทุกอย่างล้วนเป็นความทรงจำ และประสบการณ์ที่ดี แรงบันดาลใจหลายๆ อย่างเกิดขึ้นที่นั่น</p>\n\n<p>ทุกครั้งที่โฆษกสนามประกาศรายชื่อนักวิ่งมาราธอน (42km) ที่กำลังวิ่งเข้าเส้นชัยยิ่งมีความรู้สึกว่า สักวันหนึ่งเราจะต้องวิ่งระยะแบบนั้นให้ได้ โดยเฉพาะเวลาเห็นคนสูงอายุวิ่งด้วยแล้ว ใจยิ่งฮึกเหิมเข้าไปใหญ่</p>\n\n<h3 id=\"อาหาร-และการซ้อม\">อาหาร และการซ้อม</h3>\n\n<p>หลังจากผ่านสนามแรกกลับมา ด้วยความฮึกเหิมพร้อมกับอาการเจ็บหัวเข่าแต่ก็กัดฟันสู้เพื่อเราจะได้วิ่ง ก็เริ่มมาศึกษาเรื่องของอาหารที่นักวิ่งกินก่อนแข่ง หรือก่อนซ้อม การดูแลตัวเองเพื่อก้าวไปสู่มาราธอน จากนั้นก็เริ่มหาเวลาซ้อมไปเรื่อยๆ โดยตัดกิจกรรมที่ไม่เป็นประโยชน์ออกไปเพื่อให้ตัวเองมีเวลาสำหรับการวิ่งมากขึ้น เลือกรับประทานอาหารต่างๆ เพื่อทำให้ร่างกายตัวเองทนต่อสภาพการวิ่งระยะไกล</p>\n\n<h3 id=\"ลงแข่งมากขึ้น\">ลงแข่งมากขึ้น</h3>\n\n<p>เพื่อประสบการณ์ และสังคมแห่งการวิ่ง เริ่มหาสนามแข่งมากขึ้นเรื่อยๆ พยายามหาเวลาเพื่อที่จะลงแข่งรายการต่างๆ ยกตัวอย่างเช่น นกขมิ้นมินิมาราธอน, แมคคอร์มิกมินิมาราธอน, Signha Opstacle Run รวมไปถึงรายการเล็กๆต่างๆ ซึ่งจะเห็นว่าทั้งหมดนั่นเป็นแค่มินิมาราธอน แล้วเราจะไม่ลงแข่งรายการที่มีระยะไกลกว่านี้อีกแล้วเหรอ?</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/02/12321289_10156378079665389_7654076490148588560_n.jpg?w=736\" alt=\"\" /></center>\n\n<h3 id=\"เพิ่มระยะการลงแข่ง\">เพิ่มระยะการลงแข่ง</h3>\n\n<p>พอมาถึงจุดๆ หนึ่งเลยมองว่าเราต้องเพิ่มระยะทางขอเราเองแล้วล่ะ เลยพยายามหารายการที่วิ่งได้ไกลกว่าเดิมแต่ก็จะเผื่อเวลาซ้อมไว้ด้วยพร้อมกับต้องเป้าหมายเรื่องเวลาเอาไว้ด้วยเลย รายการที่มองไว้คือ  CMU Marathon รายการนี้กะจะให้เป็น Half Marathon รายการแรกของผมเอง แต่ก็พลาดเรื่องการสมัคร (อ่านบันทึกเรื่อง My First 20 km) จนในที่สุดก็ได้ BIB งานนี้มาจนได้ แต่เรื่องราวกลับพลิก เมื่อกลับกลายเป็นว่าอยากลง Full Marathon 42km</p>\n\n<h3 id=\"เพิ่มระยะการซ้อมเพื่อ-42km-แรก\">เพิ่มระยะการซ้อมเพื่อ 42km แรก</h3>\n\n<p>หลังจากตัดสินใจลงมาราธอนที่นี้ก็มาว่าถึงเรื่องของการเตรียมตัวกันบ้าง งานนี้มีเวลาเตรียมตัวแค่ 2 อาทิตย์แค่นั้นเองซึ่งไม่เพียงพอต่อการซ้อมแน่นอนเพราะเราเคยวิ่งไว้ไกลสุดแค่ 11km ก็เลยเป็นการวัดใจ ดูว่าจะทำได้หรือไม่ เลยตั้งเป้าเอาไว้ว่า อาทิตย์แรกวิ่ง 20km ให้ได้ และสี่วันก่อนแข่งต้องแตะ 30km ให้ได้ด้วยเช่นกัน หลังจากนั้นคือการพัก ฟื้นฟูกล้ามเนื้อเพื่อวันแข่ง อาทิตย์แรกทำ 20km ได้แล้วเหลืออีก 30km ต้องมาดูกัน</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/02/screen-shot-2559-02-08-at-9-23-03-pm.png?w=736\" alt=\"\" /></center>\n\n<h3 id=\"อัพเกรดชุดวิ่ง\">อัพเกรดชุดวิ่ง</h3>\n\n<p>นอกจากรองเท้าแล้ว สิ่งที่สำคัญไม่แพ้กันก็คือเสื้อ และกางเกง ชุดวิ่งที่ดีต้องป้องกัน หรือบรรเทาอาการบาดเจ็บที่อาจจะเกิดขึ้นในขณะวิ่ง อันนี้ต้องคำนึงเป็นพิเศษเพื่อจะได้ไม่เจ็บในขณะวิ่ง ผมซื้อเสื้อของ Newbalance มาหนึ่งตัว เลือกสีที่สะท้องแสงดีๆหน่อยเพราะเวลาวิ่งกลางคืนจะได้มองเห็นง่ายแบบแห้งเร็วและเบาครับ ตัวนี้ซับเหงื่อดีมาก</p>\n\n<p>กางเกงวิ่งผมมีสองตัว แบบรัดรูป และแบบขาสั้น แบบขาสั้นผมใช้ของ Adidas ใส่มาตลอดเหมือนกัน เบาสบาย แห้งเร็วดีครับ ส่วนกางเกงรัดรูปขายาวผมใช้กางกางของ CW-X ครับ เพื่อกระชับกล้ามเนื้อขาป้องกันตะคริว อาการเกร็งกล้าเนื้อ รวมไปถึงอาการกล้าเนื้อสะบัดด้วย ใช้วิ่งในระยะไกลจะรัดกล้ามเนื้อ กระชับ ทำให้กล้ามเนื่อล้าช้าลง</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/02/11bee486d3005056b711a8.jpg?w=300&amp;h=300\" alt=\"\" /></center>\n\n<h3 id=\"สิ่งที่ได้ตั้งแต่เริ่มวิ่ง\">สิ่งที่ได้ตั้งแต่เริ่มวิ่ง</h3>\n\n<p>ทั้งหมดที่กล่าวมาเกิดขึ้นหลังจากการวิ่งครั้งแรกของผม สิ่งที่หายไปคือเวลาสังสรรค์ และเวลาที่เปล่าประโยชน์ ทำให้เราใช้เวลาที่มีอยู่มีประโยชน์มากขึ้น รวมไปถึงเรื่องของการดื่มด้วยลดลงไปได้เยอะเลยทีเดียว สรุปได้สุขภาพล้วนๆ</p>\n\n<p>มาลุ้นกันว่าจะไปมาราธอนแรกสำเร็จหรือไม่!!!</p>\n"
    }
    ,
    {
      "title": "My First 20km Run",
      "link": "/2016/02/first-20km-run.html",
      "image": "https://bestrangers.files.wordpress.com/2016/02/photo-1452626038306-9aae5e071dd3.jpeg",
      "content": "เชื่อว่าในหลายเรื่องๆ ของหลายๆ คน ก็ต้องมี “ครั้งแรก” กันในทุกเรื่อง เรื่องของผมก็เช่นกัน ผ่านครั้งแรกมาอีกหนึ่งเรื่องเพื่อจะก้าวไปทำครั้งแรกในอาทิตย์หน้าเหมือนกัน แต่ครั้งแรกในวันนี้ของผมเป็นครั้งแรกในการวิ่งระยะไกลที่สุดที่เคยวิ่งมา นั่นคือการวิ่งยาวระยะ 20km ครังแรก",
      "slug": "first-20km-run",
      "detail": "<p>เชื่อว่าในหลายเรื่องๆ ของหลายๆ คน ก็ต้องมี “ครั้งแรก” กันในทุกเรื่อง เรื่องของผมก็เช่นกัน ผ่านครั้งแรกมาอีกหนึ่งเรื่องเพื่อจะก้าวไปทำครั้งแรกในอาทิตย์หน้าเหมือนกัน แต่ครั้งแรกในวันนี้ของผมเป็นครั้งแรกในการวิ่งระยะไกลที่สุดที่เคยวิ่งมา นั่นคือการวิ่งยาวระยะ 20km ครังแรก</p>\n\n<p>เรื่องมันมาที่มาที่ไปแบบนี้ ท้าวความกันสักหน่อยว่าเมื่ออาทิตย์ก่อนผมพลาดการสมัคร CMU Marathon ซึ่งผมตั้งใจไว้ว่าจะให้เป็น Half Marathon แรกของผม แต่โชคชะตามิได้นำพาเอาเสียเลยที่ทำให้ผมพลาดโอกาสในการสมัครครั้งนี้ เลยเฝ้าแต่รอว่าใครจะกันที่จะมาปล่อย BIB Half ให้ผม</p>\n\n<p>ในที่สุดโชคชะตาก็นำพาจนได้เมื่อน้องที่รู้จักกันลง Marathon 42km ไว้แต่เนื่องจากว่าความไม่พร้อมของน้องเขา หรือไม่ได้ซ้อมนั่นเองก็ยอมปล่อย BIB ให้ผม พี่ที่รู้จักกันก็บอกอยู่แล้วว่าสามารถ Down ลงไปวิ่ง Half ได้นะ เพราะเราจ่ายในราคาที่สูงกว่า ผมเลยตกลงโอเคก็ว่ากันไป</p>\n\n<p>ผ่านไปหนึ่งคืนก็มานั่งอ่านในกลุ่ม Ultra &amp; Trail Runners in Thailand ซึ่งจะเป็นกลุ่มของผู้ที่วิ่ง Trail และ Ultra marathon (ระยะที่เกินกว่า marathon คือ 43km ขึ้นไป) อ่านไปอ่านมา เห้ยนี่เขาวิ่งได้กันขนาดนั้น เราก็ต้องได้สิ</p>\n\n<p>ความคิดแรกที่ขึ้นมาเลยคือ 42km ไหวเหรอเหลืออีกสองอาทิตย์วิ่งไกลสุดแค่ 11km เอง พร้อมกับความคิดด้านแย้งก็ออกรัวๆในหัว แต่ยังยึดมั่น เอาวะ 42km ก็ 42km เริ่มซ้อมตั้งแต่วันพรุ่งนี้เลยละกัน</p>\n\n<p>การวาแผนซ้อมของผมไม่มีอะไร ผมจะวิ่งปรกติ 5-10km อาทิตย์แรกผมต้องวิ่งให้ได้ 20km หนึ่งครั้ง และก่อนแข่ง 4 วันผมต้องวิ่งระยะ 30km+ ให้ได้ มาว่ากันที่ 20km ก่อน</p>\n\n<center>\n\t<img src=\"https://bestrangers.files.wordpress.com/2016/02/gu-gels-enmasse.jpg?w=736\" alt=\"\" />\n</center>\n\n<p>ก่อนวิ่งต้องไปซื้อเจลมาก่อนครับจัด GU มาครับรสมะนาว ไอ้ซองเขียวๆข้างบนนั่นแหละครับ เพราะพี่ๆบอกว่าทุกอันรสชาติหมาไม่แดกหมดครับ มีมะนาวที่พอไปได้หน่อย การกินเจลขึ้นอยู่กับแต่ละคนครับ บางคนวิ่ง 42km อาจจะกินแค่ 2 ซองก็ได้ เจลพวกนี้เป็นเจลที่กินแล้วร่างการสามารถนำเอาสารอาหารไปใช้ได้ทันทีครับ ทำให้มีพลังงานเพิ่มขึ้นมา ส่วนใหญ่ 1 ซองจะให้พลังงานการวิ่งระดับ Aerobic ได้ประมาณ 45 นาที เพราะฉะนั้นส่วนใหญ่จะกินกันทุกๆ 45 นาที และไม่ควรเกิน 4 ซอง (มันแพงครับ) ราคาซอง 75 บาท</p>\n\n<center>\n\t<img src=\"https://bestrangers.files.wordpress.com/2016/02/screen-shot-2559-02-08-at-9-03-14-pm-copy.jpg?w=736\" alt=\"\" />\n</center>\n\n<h3 id=\"เริ่มวิ่ง\">เริ่มวิ่ง</h3>\n\n<p>หลังเลิกงานก็เตรียมเตรียมกระบอกน้ำ โทรศัพท์จนพร้อม ก็ออกวิ่งทันทีครับผมเลือกวิ่งเส้นทางตามแผนที่ข้างบนครับ ตั้งแต่ออฟฟิศเรื่อยไปจนปากทางเข้าห้วยตึงเฒ่า กลับมาวิ่งรอบสนาม 700 ปี แล้วกลับมาออฟฟิศจะได้ระยะทาง 10km วิ่งสองรอบครับจะได้ 20km พอดี ตรงนี้จะดีตรงที่ว่ามีเลนสำหรับวิ่งและจักรยานให้ เลยปลอดภัยกว่าวิ่งบนถนนนั่นเอง</p>\n\n<h3 id=\"5km-วิ่งสบายๆ\">5km วิ่งสบายๆ</h3>\n\n<p>ผ่าน 5km ไปแบบสบายๆ เพราะบังคับตัวเองสุดๆ พยายามวิ่งไม่ให้ต่ำเกิน pace 5 เพราะผมชอบวิ่งเร็ว โดยปรกติจะวิ่งช่วง pace 4 – 5 ทำให้ระยะทางการวิ่งนั้นสั้นลงไป คุมตัวเองได้ดีครับเลยไม่มีอาการเหนื่อยสักเท่าไหร่</p>\n\n<h3 id=\"10km-ได้เวลากินเจล\">10km ได้เวลากินเจล</h3>\n\n<p>เข้าสู่ช่วงกิโลเมตรที่ 10 เริ่มออกอาการเหนื่อย ตอนนี้กลับมาที่เดิมเริ่มฉีกซองเจลกินแล้วรสชาติสมคำร่ำลือไม่อร่อยเป็นที่สุดแต่ก็ต้องกินครับ หลังจาก 12km pace ตกไปที่ 6 ครับเพราะเริ่มเดินบ้างแล้ว ผมตั้งเป้าเอาไว้ว่าต้องไม่เกิน 6 ครับ เริ่มเหนื่อยมากขึ้นและเดินบ่อยขึ้น</p>\n\n<h3 id=\"15km-หยุดดีไหม-หรือเอาต่อ\">15km หยุดดีไหม หรือเอาต่อ</h3>\n\n<p>ตอนนี้อาการทุกอย่างมาพร้อมกันหมด เริ่มเดินสับวิ่ง เดินสลับแต่ก็คอยคุม Pace ตัวเองเอาไว้ตลอดเวลา ในหัวตอนนี้คือหยุดดีไหมแล้วเดินกลับ เจ็บเข่าแล้วนะหยุดเถอะ จะวิ่งอะไรกันนักหนา หัวใจเต้นเร็วแล้วละ เต็มหัวไปหมด พยายามวิ่งต่อไปสักพักลองมองดูเวลาเฮ้ย 17km แล้วอีกเดียว สลัดความกังวลทุกอย่างลุยต่อ</p>\n\n<h3 id=\"20km-ในที่สุดก็ทำได้\">20km ในที่สุดก็ทำได้</h3>\n\n<p>พอโทรศัพท์บอกระยะ 20km ก็กดหยุดทันทีตามเป้าหมายแล้วนะ ดีใจน้ำแทบไหลเราก็ทำได้นี่หว่า เหนื่อยแบบบอกไม่ถูกกล้ามเนื้อขาล้าไปหมด แถมอาการเจ็บเข่ากลับมาอีกจนได้ มาดูสรุปเวลากัน ผมทำเวลาทั้งหมด 2:01 ชั่วโมง ซึ่งเป้าหมายของผมคือจบภายใน 2 ชั่วโมงแต่ไม่เป็นไรเลยไปหนึ่งนาทีถือว่าไม่เสียหาย หากผมรักษาระดับการวิ่งแบบนี้ได้ผมอาจจบ 42km ได้ในเวลา 5 ชั่วโมง หรือแบบหล่อสุดๆ 4:30 ชั่วโมง มาดูเรื่องของ Pace บ้างผมจบที่  Pace 6, 6:03/km หรือ 6:03 นาทีต่อกิโลเมตรนั่นเอง อาจจะเยอะไปแต่ก็ไม่เลวเพราะครั้งแรกของผม</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/02/screen-shot-2559-02-08-at-9-23-03-pm1.png?w=736\" alt=\"\" /></center>\n\n<p>ลองมาคำนวณเล่นหากผมจบ 42km โดยใช้ pace นี้ 6 x 42 = 252 นาที หากลองคิดเป็นชั่วโมงกระจะประมาณ 4:20 ชั่วโมง อั๊ยยะ อาจจะจบแบบหล่อๆ ถ้าสามารถวิ่งยืนระยะนี้ได้</p>\n\n<p>ยังไม่คิดถึงอีกหลายๆ เรื่องที่ต้องเจอในวันแข่งเอาเป็นว่ากะไว้ 5:00 ชั่วโมงแล้วกันครับ ต่อจากนี้ก็ ซ้อม ซ้อม ซ้อม ซ้อม อีกอาทิตย์เดียวววววววววววว</p>\n"
    }
  ]
  ,"next": "/api/feed-9.json"
  
  ,"prev": "/api/feed-7.json"
  
}