{
  "pages": [

    {
      "title": "Foundation With iChaiwut Part 1",
      "link": "/2014/02/foundation-with-ichaiwut-1.html",
      "image": "https://farm8.staticflickr.com/7445/12324998825_d18c0a5dee_o.jpg",
      "content": "หลังจากที่ผมใช้ Bootstrap มาพักใหญ่ในที่สุดก็ตัดสินใจเปลี่ยนข้างหันมาลองใช้ Foundation ดูบ้าง ใช้ได้สักพักรู้สึกชอบติดใจเลยเอามาใช้กับ iChaiwut.me มันซะเลย",
      "slug": "foundation-with-ichaiwut-1",
      "detail": "<p>หลังจากที่ผมใช้ <a href=\"https://getbootstrap.com\">Bootstrap</a> มาพักใหญ่ในที่สุดก็ตัดสินใจเปลี่ยนข้างหันมาลองใช้\n<a href=\"https://foundation.zurb.com/\">Foundation</a> ดูบ้าง ใช้ได้สักพักรู้สึกชอบติดใจเลยเอามาใช้กับ <a href=\"https://ichaiwut.me\">iChaiwut.me</a> มันซะเลย</p>\n\n<p>โพสนี้ผมจะอธิบายว่าเจ้า Foundation เนี่ยมันมีอะไรที่น่าเล่น หรือใช้งานกันยังไงก่อนอื่นเรามาทำความรู้จักกับมันก่อนนะครับ\nFoundation ตอนนี้มาถึงเวอร์ชั่นที่ 5 แล้วนะครับ สำหรับเจ้า CSS Framework ตัวนี้ก็ไม่ต่างอะไรกับ CSS Framwork ทั่วไปนะครับ\nการทำงานหรือคุณ สมบัติก็พอๆกันอาจจะมีเหลื่อมล้ำกันบ้างอันนี้ผมจะไม่พูดถึง แต่หากถามผมว่าจะใช้ตัวไหนดีระหว่าง <a href=\"https://getbootstrap.com\">Bootstrap</a>\nกับเจ้าตัว <a href=\"https://foundation.zurb.com\">Foundation</a> ผมแนะนำให้ลองดูวิดีโอข้างล่างครับ <a href=\"https://www.sitepoint.com/video-bootstrap-foundation/\">Bootstrap Or Foundation</a></p>\n\n<center><iframe width=\"560\" height=\"315\" src=\"//www.youtube.com/embed/Eo7z9Fkzokw\" frameborder=\"0\" allowfullscreen=\"\"></iframe></center>\n\n<p>โพสนี้ผมตั้งใจจะแนะนำ Foundation ให้รู้จักกันก่อนว่ามีอะไรที่โดดเด่นหรือมีอะไรที่น่าเล่นน่าค้นหา</p>\n\n<h3 id=\"responsive-design\">Responsive Design</h3>\n<p>ตั้งแต่เวอร์ชั่นที่ 4 เป็นต้นมา Foundation ประกาศตัวเองเป็น Responsive เต็มตัวโดยไม่ต้องใส่ calss หรืออะไรเพิ่มอีกต่อไปนั่นหมายความว่า Foundation เป็น Css Framework ตัวแรกที่เป็น Completely Responsive CSS Framework</p>\n\n<h3 id=\"built-on-sass\">Built on Sass</h3>\n<p>ถูกใจคอ <a href=\"https://sass-lang.com\">SASS</a> อย่างผมไม่น้อย สามารถสร้างคลาส และยังมาพร้อมกับ <code>@mixin</code> มากมายให้เขียนกันอย่างเมามันส์</p>\n\n<h3 id=\"grid-system\">Grid System</h3>\n<p>เวอร์ชั่น 5 มาพร้อมกับ <code>small</code>, <code>medium</code> และ <code>large</code> grid ซื้งสามารถเลือกใช้งานได้ตามเหมาะสมกับอุปกรณ์ต่างๆ ได้อย่าลงตัว</p>\n\n<h3 id=\"sublime-text\">Sublime Text</h3>\n<p>สาวก <a href=\"https://www.sublimetext.com/\">Sublime Text</a> ก็ยังมี snippet มาให้อีกโอ้วววว อะไรจะสนุกขนาดนั้น ลองตามเข้าไปหาโหลดหรือลองดูที่ <a href=\"https://github.com/zurb/foundation-5-sublime-snippets\">Foundation Sublime Snippet</a></p>\n\n<p>โพสหน้าผมจะมาพูดถึง Structre เช่น <code>Media Queries</code>, <code>Grid</code>, <code>Utitlity Classses</code> กันครับ</p>\n"
    }
    ,
    {
      "title": "Jekyll with GitHub Page",
      "link": "/2014/02/jekyll-with-github-page.html",
      "image": "https://farm8.staticflickr.com/7336/12315488693_bbe5729572_o.jpg",
      "content": "มีคนถามมาหลายคนเหมือนกันว่าใช้ Wordpress ทำบล็อกนี้เหรอ? ผมตอบตรงนี้เลยแล้วกันครับว่าไมใช่ครับ บล็อกนี้ผมใช้ Jekyll แล้วเก็บไว้บน Repository ของ GitHub จากนั้นก็ชี้โดเมนเนมไปที่ GitHub Pageของผมครับ",
      "slug": "jekyll-with-github-page",
      "detail": "<p>มีคนถามมาหลายคนเหมือนกันว่าใช้ <a href=\"https://www.wordpress.org\">Wordpress</a> ทำบล็อกนี้เหรอ? ผมตอบตรงนี้เลยแล้วกันครับว่า<strong>ไมใช่ครับ</strong>\nบล็อกนี้ผมใช้ <a href=\"https://jekyllrb.com/\">Jekyll</a> แล้วเก็บไว้บน Repository ของ <a href=\"https://www.github.com/ichaiwut/ichaiwut.github.io\">GitHub</a>\nจากนั้นก็ชี้โดเมนเนมไปที่ <a href=\"https://pages.github.com\">GitHub Page</a> ของผมครับวิธีทำก็ไม่ได้ยากอะไร ถือโอกาสบอกวิธีทำเลยละกันครับ</p>\n\n<p>สามสี่วันก่อนผมคิดว่าจะทำเว็บบล็อกผมใหม่ก็พยายามหา Server ดีๆแต่ก็ยังหาไม่เจอไม่ลงตัวสักที แรกๆคิดไว้ว่าจะใช้ <a href=\"https://www.wordpress.org\">Wordpress</a>\nแล้วจัดการโมธีมตามสูตรผมที่ชอบทำ แต่ก็เอะใจขึ้นมา แค่บล็อกธรรมดาๆ ทำไมต้องไปใช้ wordpress ด้วยนะ พลันก็จำได้ว่า <a href=\"https://armno.in.th\">@armno</a> ใช้\n<a href=\"https://jekyllrb.com/\">Jekyll</a> เลยคิดว่าน่าจะลองใช้ตัวนี้เพราะมันไม่ยุ่งยากด้วย และที่สำคัญเราสามารถเก็บไว้ใน Gihub Page ของเราได้ด้วย ในที่สุดจึงตกลงปลงใจ\nด้วยวิธีนี้ เอาล่ะมาดูกันว่าทำอย่างไร</p>\n\n<h3 id=\"สร้าง-gitub-page\">สร้าง Gitub Page</h3>\n<p>ขอสมมุติเอาเลยว่าทุกคนมี Github Account เรียบร้อยแล้วนะครับ ขั้นแรกเราต้องสร้าง repository ให้เพจเราก่อนโดยการตั้งชื่อเป็น <code>username.github.io</code>\nยกตัวอย่างของผมก็็จะเป็็น <code>ichaiwut.github.io</code> ตอนนี้เราก็จะมี repo เป็นของเว็บที่เราจะเอาไว้ทำบล็อกแล้วเรียบร้อย ขั้นตอนนี้สามารถดูวิธีการตั้งค่าได้ที่\n<a href=\"https://pages.github.com\">GitHub Page</a> ครับ</p>\n\n<h3 id=\"ดาวโหลด-jekyll\">ดาวโหลด Jekyll</h3>\n<p>ผมใช้ <a href=\"https://www.ubuntu.com\">Ubuntu</a> เพราะฉะนั้นขออนุญาตอธิบายเป็น linux commandline นะครับ ก่อนอื่นทำการ Install Jekyll ก่อนนะครับหาก\nเครื่องใครยังไม่มี <code>Ruby</code> ก็ทำการลงให้เรียบร้อยครับ <code>$sudo apt-get install ruby1.9.1 ruby1.9.1-dev</code></p>\n\n<script src=\"https://gist.github.com/ichaiwut/8818519.js\"></script>\n\n<p>จากนั้นเปิด Browser แล้วพิมพ์ <code>https://localhost:4000</code> เพื่อดูเว็บไซต์ครับ</p>\n\n<p>จากนั้นให้สร้าง repository ในนี้เลยครับ <code>$git init</code> จากนั้น remote server ไปที่รีโปของเราเองตัวอย่างนะครับ <code>$git remote add oririn https://github.com/ichaiwut/ichaiwut.github.io.git</code>\ncommit แล้วก็ push เว็บไซต์ขึ้นไปได้เลยครับ วิธีเข้าไปดูง่ายๆครับแค่พิม <code>ichaiwut.github.io</code> หรือ <code>username.github.io</code> ครับ</p>\n\n<p>สำหรับใครที่มีโดเมนเนมอยู่แล้วก็แค่ชี้มาที่ Github เพจของเราก็เป็นอันจบพีธีครับผม</p>\n\n<p><strong>ข้อมูลเพิ่มเติม</strong></p>\n\n<ul>\n  <li><a href=\"https://pages.github.com\">GitHub Pages</a></li>\n  <li><a href=\"https://www.jekyllrb.com\">Jekyll Doc</a></li>\n  <li><a href=\"https://help.github.com/articles/setting-up-a-custom-domain-with-pages\">Customs URL</a></li>\n</ul>\n\n<p>้</p>\n"
    }
    ,
    {
      "title": "Time to change!",
      "link": "/2014/02/time-to-change.html",
      "image": "https://farm8.staticflickr.com/7399/14083112041_4a95e20439_b.jpg",
      "content": "ในที่สุดผมก็ตัดสินใจจนได้ ที่จริงผมก็คิดมานานเหมือนกันนะ ว่าควรจะไปหรือควรจะอยู่แต่น้ำหนักมันลงไปที่ควรจะไปมากกว่าควรจะอยู่ หลายครั้งผมคิดว่าผมเองน่าจะอยู่เพื่อพัฒนาตัวเอง ให้มากกว่านี่แต่ในที่สุดแล้วผมก็ไม่สามารถทำงานโดยไม่มีความตื่นเต้น หรือไม่มีอะไรใหม่ๆเข้ามา",
      "slug": "time-to-change",
      "detail": "<p>ในที่สุดผมก็ตัดสินใจจนได้ ที่จริงผมก็คิดมานานเหมือนกันนะ ว่าควรจะไปหรือควรจะอยู่แต่น้ำหนักมันลงไปที่ <strong>ควรจะไป</strong>มากกว่าควรจะอยู่ หลายครั้งผมคิดว่าผมเองน่าจะอยู่เพื่อพัฒนาตัวเอง\nให้มากกว่านี่แต่ในที่สุดแล้วผมก็ไม่สามารถทำงานโดยไม่มีความตื่นเต้น หรือไม่มีอะไรใหม่ๆเข้ามา</p>\n\n<p>ผมรักการทำงานที่นี่ รักในงานที่ผมทำเคารพที่ทำงาน สนุกกับงานตลอดเวลาจนถึงตอนนี้เหมือนกบว่าที่นี่<strong>ไม่น่าตื่นเต้น</strong>อีกต่อไป สิ่งใหม่ๆที่เข้ามาให้องทำก็ยังมี แต่อะไรที่ทำลงไปด้วยพลัง\nทำลงไปด้วยความตั้งใจ<strong>สุดท้ายก็ปล่อยร้างรา</strong>เหมือนที่ทำไปนั้นสูญเปล่า</p>\n\n<p>ผมรักทุกคนในทีม ทุกคนสามารถทำให้ผมพัฒนาตัวเองได้เยอะมาก เรียนรู้อะไรใหม่ๆเยอะแยะมากมายจนตอนนี้ทุกคนต่างแยกย้ายกันออกไปด้วย<strong>เหตุผลเดียวกัน</strong></p>\n\n<p>ผมตัดสินใจแล้ว และผมเคารพการตัดสินใจของตัวเองเสมอ</p>\n"
    }
  ]

  ,"prev": "/api/feed-13.json"

}