{
  "pages": [

    {
      "title": "Singha Obstacle Run V",
      "link": "/2016/02/singha-obstacle-run-v.html",
      "image": "https://bestrangers.files.wordpress.com/2016/02/dscf41671.jpg?w=1400",
      "content": "ปลายปีที่แล้วมีโอกาสไปวิ่ง Obstacle ครั้งแรกที่ไร่สิงห์จังหวัดเชียงราย ยังไม่เคยลงวิ่งลักษณะแบบนี้และไม่เคยมีมีประสบการณ์ด้วย ณ วันที่สมัครยังไม่รู้เลยว่าวิ่งลุยยังไง ต้องเจออะไรบ้าง เลยสมัครไป 7.8 km กับเพื่อนที่ทำงาน เพราะกำลังคิดว่ามันต้องเหนื่อยแน่ถ้าวิ่งไปลุยไป",
      "slug": "singha-obstacle-run-v",
      "detail": "<p>ปลายปีที่แล้วมีโอกาสไปวิ่ง Obstacle ครั้งแรกที่ไร่สิงห์จังหวัดเชียงราย ยังไม่เคยลงวิ่งลักษณะแบบนี้และไม่เคยมีมีประสบการณ์ด้วย ณ วันที่สมัครยังไม่รู้เลยว่าวิ่งลุยยังไง ต้องเจออะไรบ้าง เลยสมัครไป 7.8 km กับเพื่อนที่ทำงาน เพราะกำลังคิดว่ามันต้องเหนื่อยแน่ถ้าวิ่งไปลุยไป</p>\n\n<center>\n\t<img src=\"https://bestrangers.files.wordpress.com/2016/02/dscf4164.jpg?w=736\" alt=\"\" />\n</center>\n\n<p>งานนี้ตื่นเต้นพอสมควร เพราะอย่างที่บอกว่าผมยังไม่เคยวิ่งลักษณะนี้มาก่อนเลย มันเลยเกิดความกังวลขึ้นมามากมาย แต่ก็เอาน่าท้าทายดีออก</p>\n\n<p>งานนี้เราไปกันเป็นทีมครับ ทีมในออฟฟิศแต่ไม่ได้วิ่งเป็นทีมนะครับ วิ่งกันเองครับ 555 ต่างคนต่างวิ่งเจอกันอีกทีที่เส้นชัยครับ</p>\n\n<center>\n\t<img src=\"https://bestrangers.files.wordpress.com/2016/02/r-2792.jpg?w=736\" alt=\"\" />\n</center>\n\n<p>ดูจากสภาพอากาศและเส้นทางวิ่งแล้วคิดไว้ก่อนเลยว่าหมูแน่ พอปล่อยตัวก็วิ่งไปเรื่อยๆครับ ไม่เน้นเร็วมายังเป็นทางลูกรังธรรมดา แต่พอเจอด่านแรกเท่านั้นแหละครับ อะไรนะต้องกระโดนขึ้นเขา!!! สามชั้่นเลยนะครับด่านนี้กินแรงพอสมควรครับ ด่านนี้เสร็จก็ยังคงวิ่งไปเรื่อยๆ ขึ้นลงเขาไม่มาก มีลุยทรายบ้าง ปีนป่ายบ้าง กินแรงเยอะเลยทีเดียว</p>\n\n<center>\n\t<img src=\"https://bestrangers.files.wordpress.com/2016/02/r-2928.jpg?w=736\" alt=\"\" />\n</center>\n\n<p>นั่นแหละครับเริ่มไม่ง่ายเพราะเจอกับน้ำแล้วครับ อากาศก็เย็นพอสมควร เสื้อที่ใส่สีขาวซะด้วย ตายๆแต่ก็ไม่มีทางเลือกครับ ลุยอย่างเดียวสิครับ ยังครับ ยังไม่หมดเจอโคลนครับคราวนี้เละเลยครับ</p>\n\n<p>ผ่านไปประมาณสัก 4-5 โลก็จะเจอเส้นทางที่ผมชอบมากครับนั่นคือการวิ่งผ่านไร่ชา บรรยากาศดีมากขอบอกสวยงามจนแทบจะหยุดถ่ายรูปแต่หยุดไม่ได้ครับบบบบ เริ่มเจ็บเข่าขึ้นมาตอนนี้เริ่มเดินบ้างละครับ</p>\n\n<center>\n\t<img src=\"https://bestrangers.files.wordpress.com/2016/02/a-3465.jpg?w=736\" alt=\"\" />\n</center>\n\n<p>อีกหนึ่งด่านที่ถือว่าหินที่สุดคือด่านที่ต้องกระโดดลงไปในบ่อโคลน แล้วพยายามปีขึ้นมาอันนี้ช่วงปลายแล้วครับ แรงก็ไม่ค่อยมียังจะต้องเจอด่านนี้ แทบจะลิ้นห้อยเลยครับทีนี้</p>\n\n<center>\n\t<img src=\"https://bestrangers.files.wordpress.com/2016/02/r-3041.jpg?w=736\" alt=\"\" />\n</center>\n\n<p>ใกล้จะวิ่งจบแล้วคราวนี้เจอด่านโคลนลึกครับ!!! มันยากจนรองเท้าผมขาดไปเลยครับพื้นรองเท้าหายไปเลย T-T คราวนี้ต้องวิ่งเท้าเปล่าแล้วครับ งานเข้าเลยทีนี้ อาการเจ็บหัวเข่ากลับมาทันที แต่ก็กัดฟันวิ่งจนจบครับ</p>\n\n<center>\n\t<img src=\"https://bestrangers.files.wordpress.com/2016/02/a-3715.jpg?w=736\" alt=\"\" />\n</center>\n\n<p>แต่เราก็จบงานนี้จนได้ ได้เรียนรู้หลายๆ อย่างจากการวิ่งครั้งนี้ ได้เห็นความมีน้ำใจ และมิตรภาพของนักกีฬาทุกคนครับช่วยกันตลอดเส้นมาง ปีหน้าจะมาวิ่งอีกแน่นอน!!!</p>\n\n<center>\n\t<img src=\"https://bestrangers.files.wordpress.com/2016/02/11041264_10153404736633305_6457991729341860659_n.jpg?w=736\" alt=\"\" />\n</center>\n\n<iframe src=\"https://www.facebook.com/plugins/video.php?href=https%3A%2F%2Fwww.facebook.com%2Fama.events%2Fvideos%2F1194475127235377%2F&amp;show_text=0&amp;width=560\" width=\"560\" height=\"315\" style=\"border:none;overflow:hidden\" scrolling=\"no\" frameborder=\"0\" allowtransparency=\"true\" allowfullscreen=\"true\"></iframe>\n"
    }
    ,
    {
      "title": "New Balance 890v5",
      "link": "/2016/02/new-balance-890-v5.html",
      "image": "https://s7d5.scene7.com/is/image/NB/w890pp5_nb_35_i?$dw_temp_hero_gallery$",
      "content": "สิ่งที่จำเป็นมากที่สุดสำหรับนักวิ่งคงจะหนีไม่พ้นรองเท้าวิ่งนั่นเองครับ คงเปรียบเปรยได้เหมือนกับ “รองเท้าดี มีชัยไปกว่าครึ่ง” (อันนี้แต่งเองครับ) ผมมีโอกาสได้ซื้อเจ้าตัวนี้มาใช้ New Balance 890 v5 รองเท้าวิ่งที่เป็นทุกอย่างของผม",
      "slug": "new-balance-890-v5",
      "detail": "<p>สิ่งที่จำเป็นมากที่สุดสำหรับนักวิ่งคงจะหนีไม่พ้นรองเท้าวิ่งนั่นเองครับ คงเปรียบเปรยได้เหมือนกับ “รองเท้าดี มีชัยไปกว่าครึ่ง” (อันนี้แต่งเองครับ) ผมมีโอกาสได้ซื้อเจ้าตัวนี้มาใช้ New Balance 890 v5 รองเท้าวิ่งที่เป็นทุกอย่างของผม</p>\n\n<p>วันที่ผมเริ่มวิ่งใหม่เมื่อสี่เดือนก่อน กำลังมองหารองเท้าดีๆ สักคู่เพื่อจะได้ใส่วิ่งสบายเท้าหน่อย ไม่ต้องเจ็บฝ่าเท้าเหมือนที่ผ่านมา ที่จริงในใจที่เล็งไว้ไม่ใช่ New Balance ครับ ผมอยากได้พวก Nike หรือ Adidas มากกว่า นั่นเป็นเพราะผมยังไม่คิดว่า NB เป็นแบรนด์สำหรับกีฬาครับ พอมีโอกาสได้รับคำแนะนำจากพี่ที่วิ่งด้วยกัน เขาแนะนำ NB มาครับก็ไปซื้อด้วยกันซะเลย</p>\n\n<p>ผมตั้งงบประมาณสำหรับซื้อรองเท้าวิ่งอยู่ที่ 2,000 บาทครับ ตอนนั้นคิดว่ารองเท้าอะไรก็คงเหมือนกัน ไปที่แรกก็ชอปของ NB ก่อนเลยครับเลือกดูอยู่หลายรุ่นเหมือนกันราคาก็ไม่ได้อยู่ในงบประมาณที่เราเตรียมไว้เอาเสียเลย คู่นี้ราคาอยู่ที่ 4500 บาทครับตอนนี้มีโปรโมชั่น ถ้าจำไม่ผิดน่าจะประมาณ 30% สักอย่างนี้แหละ ผมเลยได้มาในราคาประมาณ 3500 บาท</p>\n\n<center>\n    <img src=\"https://bestrangers.files.wordpress.com/2016/02/nb890v5.jpg\" alt=\"\" />\n</center>\n\n<p>รองเท้ารุ่นนี้พื้นรองเท้าทำมาจากโฟมครับ เด้งดึ๋งๆตอนวิ่งดีครับ นุ่มใส่สบายเท้า ระบายอากาศได้เยี่ยมครับ ผ้าของส่วนหัวรองเท้าจะยืดกระชับกับหลังเท้าผมพอดีครับ ทำให้เวลาวิ่งไม่มีการเสียดสีระหว่างเท้ากับรองเท้าครับ วิ่งสบายเลยทีนี้</p>\n\n<p>ส่วนส้นรองเท้าจะยื่นๆ ออกมานิดนึงครับ บางครั้งเดินไปชอบไปโดนฟุตพาธบ้าง ก็ไม่ใช่ปัญหาครับ น้องคนขายเขาบอกว่าวิ่งเทรลได้ด้วย แต่ผมก็ยังไม่ชัวร์ครับ กลัวเอาไปลุยแล้วพัง 555 กว่าจะซื้อมาได้</p>\n\n<p>ใส่วิ่งบนถนนลูกรังมาแล้วครับไม่มีปัญหาวิ่งสบาย วิ่งตอนฝนตกก็ใส่มาแล้ว โดยรวมแล้วใส่ลุยได้ครับ ผมว่าน่าจะใช้วิ่งเทรลได้อยู่นะ ที่สำคัญรุ่นนี้มีป้องกันข้อเท้าพลิกด้วยครับวิ่งไร้กังวลไปเลย ใส่วิ่งยาวมาแล้วครับ 20km ไม่ได้ทำให้เท้าผมเจ็บเลยครับชอบมาก และอีกอย่างเล็บผม ไม่มีอาการช้ำหรือหลุดเลย สุดยอดดดดดดด</p>\n\n<center>\n    <img src=\"https://bestrangers.files.wordpress.com/2016/02/new-balance-m890v5-2.jpg?w=736\" alt=\"\" />\n</center>\n\n<p>ที่จริงรองเท้าคู่นี้เข้ากับรูปเท้าผมมากกว่าครับ เลยทำให้ไม่มีปัญหากับเท้าผม เพราะคนเรารูปเท้าไม่เหมือนกันครับ เพราะฉะนั้นการเลือกรองเท้าต้องเอาที่เข้ากับเท้าเราได้มากที่สุดครับ</p>\n\n"
    }
    ,
    {
      "title": "Activities Tracking App",
      "link": "/2016/02/activities-tracking-app.html",
      "image": "https://bestrangers.files.wordpress.com/2016/02/17u58vcz0u7u7jpg.jpg",
      "content": "พอเริ่มวิ่งทุกคนก็จะพยายามหาอุปกรณืที่สามารถดูรายละเอียดการวิ่งของตนเอง ดูเพื่อจะได้รู้ว่าเราวิ่งได้ดีแค่ไหน เอาสถิติของการวิ่งแต่ละครั้ง เอามาเปรียบเทียบกันเพื่อจะได้ใช้เป็นข้อมูลในการพัฒนาตนเองให้ดีขึ้นไปนั่นเอง แต่ในโลกนี้ก็มีเยอะซะเหลือเกิน และผมเองก็ลองมาหลายอันละ มีอะไรบ้างที่เคบลองไปดูกันครับ",
      "slug": "activities-tracking-app",
      "detail": "<p>พอเริ่มวิ่งทุกคนก็จะพยายามหาอุปกรณืที่สามารถดูรายละเอียดการวิ่งของตนเอง ดูเพื่อจะได้รู้ว่าเราวิ่งได้ดีแค่ไหน เอาสถิติของการวิ่งแต่ละครั้ง เอามาเปรียบเทียบกันเพื่อจะได้ใช้เป็นข้อมูลในการพัฒนาตนเองให้ดีขึ้นไปนั่นเอง แต่ในโลกนี้ก็มีเยอะซะเหลือเกิน และผมเองก็ลองมาหลายอันละ มีอะไรบ้างที่เคบลองไปดูกันครับ</p>\n\n<center>\n    <img src=\"https://www.dcrainmaker.com/images/2013/07/Strava_thumb.jpg\" alt=\"\" />\n</center>\n\n<p><strong>Strava</strong> เป็นแอพที่ผมยังใช้อยู่ ณ ปัจจุบันซึ่งโดยทั่วไปแล้วน่าจะเป็นแอพที่คนนิยมใช้กันมากที่สุด อันนี้ผมคิดเอาเอง 555 เพราะเพื่อนหลายคนก็ใช้อยู่ ผมชอบใช้สร้าง Route ของตนเองเวลาจะวิ่งผมจะเข้าไปสร้างรอไว้ก่อนซึ่งมันทำให้เรารู้ว่าต้องใช้ระยะทางเท่าไหร่ วิ่งผ่านตรงไหนบ้าง สะดวกดีสำหรับผม แต่เสียเงินนะครับถ้าหากจะใช้ Feature บางส่วนแต่ผมใช้ free ก็พอและครับ</p>\n\n<center>\n    <img src=\"https://bestrangers.files.wordpress.com/2016/02/logo-runtastic-gmbh-companybig.gif?w=736\" alt=\"\" />\n</center>\n\n<p><strong>Runtastic</strong> อีกหนึ่งแอพที่ผมเคยใช้ครับ เห็นพี่ๆในกลุ่มใช้กันเยอะพอสมควรครับ ตัวนี้ Fetaure ไม่เป็นรองตัวแรกครับบางอย่างอาจจะดีกว่าด้วยซ้ำ ที่ผมไม่ประทับใจและไม่ใช้ต่อจะเป็นในเรื่องของ UI ของเว็บ และโฆษณาในเว็บครับ เยอะมากกกกกก ไม่รู้จะโฆษณาอะไรกันนักหนาเนอะ</p>\n\n<center>\n    <img src=\"https://bestrangers.files.wordpress.com/2016/02/lockup_horizontal_color-1024x207.png?w=300&amp;h=61\" alt=\"\" />\n</center>\n\n<p><strong>Runkeeper</strong> แอพนี้ผมใช้แป็บเดียวครับ เหมาะสำหรับคนที่ไม่ต้องการฟีเจอร์หวือหวาอะไรมากมายนัก เอาแค่พอดูสรุปง่ายๆ ซึ่งอาจจะมีไม่ค่อยครบ ตัวผมเองคิดว่ายังไม่ดีพอสำหรับผมครับ และเพื่อนผมไม่มีใครใช้เลย น่าเศร้า</p>\n\n<center>\n    <img src=\"https://bestrangers.files.wordpress.com/2016/02/endomondo-android-app.png?w=300&amp;h=72\" alt=\"\" />\n</center>\n\n<p><strong>Endomondo</strong> ตัวนี้เพื่อนผมใช้เยอะสุดครับใครๆก็ใช้เจ้าตัวนี้ ผมเองตอนวิ่งออกกำลังกลายสองสามปีก่อนก็ใช่ตัวนี้ครับ ด้วยความที่มีคนรู้จักเยอะในบ้านเรา และมีคนใช้เยอะจึงทำให้เจ้าตัวนี้นิยมมาก Feature ผมว่ายังไม่เท่ากับ Strava และ Runtastic ครับ และ UI แบบนี้ผมไม่ชอบมากกกกก คือเหตุผลที่ผมไม่ใช้ครับ</p>\n\n<p>เป็นไงบ้างครับที่สี่แอพที่ผมเคยใช้ ความเห็นส่วนตัวล้วนๆ ครับ แต่อย่างไรก็ดีถึงผมใช้ Strava เป็นหลัก ผมเองก็ยังโหลด gpx ไฟล์แล้วอัพโหลดไปใช้ในทุกแอพครับ มีใครใช้ตัวไหนก็มาแลกเปลี่ยนกันได้ครับ</p>\n"
    }
  ]
  ,"next": "/api/feed-10.json"

  ,"prev": "/api/feed-8.json"

}