{
  "pages": [
    
    {
      "title": "Heading to Stuttgart Part 1",
      "link": "/2015/12/Heading-to-Stuttgart-Part-1.html",
      "image": "https://c1.staticflickr.com/1/625/23048204044_0c8df64de5_b.jpg",
      "content": "การเดินทางไปเยอรมันครั้งที่อย่างเป็นทางการ จะมีบันทึกให้อ่านเรื่อยๆ ตอนแรกเริ่มเดินทาง แค่เริ่มเดินทางก็สนุก มันส์ ฮาแล้วต้องติดามๆ",
      "slug": "Heading-to-Stuttgart-Part-1",
      "detail": "<p>ก่อนอื่นต้องขอขอบคุณสปอนเซอร์หลักในการเดินทางเปิดโลกครั้งนี้ Buzzwoo! บริษัทที่ผมทำงานนั่นเอง ส่วนตัวผมเคยไปเยอรมันมาสองแล้วครั้งหนึ่ง ครั้งนั้นไปเรื่องงานล้วนๆ ไม่ได้ไปเที่ยวไหนเลย ไปงาน Abiente at Messe Frankfurt ครั้งนี้แตกต่างกับครั้งที่แล้วโดยสิ้นเชิง</p>\n\n<p>ครั้งมีกำหนดการเดินทางคือ CNX - BKK วันที่ 10 นอนกรุงเทพฯ หนึ่งคืนเพราะมีไฟล์ทเช้า BKK-DBX วันนี้ต้องตื่นตั้งแต่ตีห้าครึ่งเพราะกลัวว่าเดี๋ยวไม่ทันตกเครื่องจะยุ่ง เมื่อวานให้ป้าจองแท็กซี่รอเลย 6:00 จะออกจากโรงแรมไปสนามบินทันที ซึ่งสนามบินกับโรงแรมห่างกันประมาณ 500 เมตรได้ลุงแท๊กซี่ฟาดไป 150 ตามระเบียบอร่อยเหาะไป เราก็ไม่ได้ซีเรียสเพราะเรียกเช้าแกส่งใกล้เสียเวลาแกวนรถอีก (ใจเขาใจเรา)</p>\n\n<p>ถึงสนามบินโครตเร็วน่าจะประมาณ 6.30 แน่นอนครับเคาท์เตอร์เช็คอินยังไม่เปิด เอาไงดีล่ะทีนี้ เดินเที่ยวสิครับ เดินแม่งตั้งแต่ชั้น 1 ยันชั้น 4 เดินไปเดินมาซื้อแซนวิสกับนมทาน เพราะคิดเอาไว้ว่าเดี๋ยวค่อยไปกินบนเครื่อง เคาท์เตอร์เช็คอินเปิดสักที ต่อคิวยาวนิดนึงรอเช็คอิน พร้อมกับเช็คอินอีกไฟล์ททันที เสร็จสรรพขึ้นชั้นสองตรวจร่างกายและกระเป๋าติดตัว ตามขั้นตอนของเขาก็ถอดรองเท้า เข็มขัด ฯลฯ ผ่านไปด้วยดี ขั้นตอนต่อไปลงมาชั้น 1 ตรวจหนังสือเดินทาง ที่นี่มีช่องพิเศษสำหรับ E-Passport กรอกในขาออกแสกน passport สแกนนิ้วมือ เป็นอันเสร็จพิธี รอขึ้นเครื่องที่ GATE E8</p>\n\n<p>สายการบิน Emirates เครื่องใหญ่สะใจ AirBUS 380-800 คนเยอะมากกกก กำลังคิดอยู่ว่าเครื่องบินมันจะรับน้ำหนักไหวหรอวะ แอร์สาวดู Boardingpass นั่งที่ 64F นั่งตรงกลาง มีตายายสองคนดูรักกันดีเขาไปต่อ Heathrow นั่งด้านซ้าย ด้านขวามีนักธุรกิจชาวอิหร่านสะอาดเรียบร้อย อัธยาศัยดี ก็โอเคไปที่นั่งคราวนี้ราบรื่น</p>\n\n<p>ดูหนังจบไปสองเรื่อง Minion  และ Iron Man พอจบดู Iron Man 2 ต่อทันที ดูได้นิดเดียวไม่ไหวรู้สึกปวดตา เริ่มตะหงิดๆเรื่องเวลา หยิบ BoardingPass มาดู ฉิบหายละเครื่องแม่งดีเลย์ แบบนี้คงต้องวิ่งและหวังว่าเครื่องคงรอเพราะมีหลายคนที่บินต่อไปเมืองอื่น 14.30 ถึงดูไบ ออกจาก Gate ปุ๊บแอร์กราวด์มาดักรอทันทีเราก็ตามเธอไปพร้อมๆผู้โดยสารท่านอื่นประมาณ 7-8 คน</p>\n\n<p>สัส …​ ไม่ทันจนได้ แต่เขาก็มีบริการจองโรงแรมให้นอนชิวๆ ครึ่งคืนแอร์กราวออก Boardingpass ใหม่ให้บินตีสาม ลงมาตรวจคนเข้าเมือง ผ่านออกมาด้านนอกไปที่ทางออก 1 เพื่อรอขึ้นรถไปโรงแรม คราวนี้ได้เพื่อนเยอรมันมาสองคนยังไม่ได้ถามชื่อเลย 555</p>\n\n<p>รถโรงแรม Millennium Airport Hotel มารับที่สนามบินขับออกมาจากสนามบินประมาณ 5 นาทีก็ถึงโรงแรมละไม่ไกลมาก โรงแรมน่าจะประมาณ 3-4 ดาว เช็คอินต้องไปทานข้าวก่อนเพราะใกล้จะบ่ายสี่โมงแล้ว คุยกับเพื่อนเยอรมัน จากนั้นแยกย้ายกันพักผ่อน เราขอเดินสำรวจบริเวณนี้หน่อยละกัน ไหนๆ ก็มาละ เดินไกลพอสมควรอากาศเย็นสบาย รถหรูๆเยอะเหลือเกิน เมืองนี้เขารวยสมคำร่ำลือจริงๆ</p>\n\n<p>เดินกลับมาโรงแรมขึ้นห้องอาบน้ำเตรียมนอนพักสักหน่อยพรุ่งนี้ไปเช้า แค่วันเดินทางก็ตื่นเต้นซะแล้ว ครั้งแรกที่พลาดไฟล์ทต่อ อีก 10 วันจะตื่นเต้นขนาดไหนชักคิดแล้วรู้สึกสนุกแล้วสิ!</p>\n"
    }
    ,
    {
      "title": "Chrome Device Inspect",
      "link": "/2015/08/Chrome-Device-Inspect.html",
      "image": "https://c1.staticflickr.com/1/289/19668650633_3d6e7472f4_b.jpg",
      "content": "โพสนี้ขอมาเล่าการใช้งานพวก tools ของ Google Chrome ซึ่งทำให้เราสะดวกสบายในการใช้งาน สำหรับผู้ที่เป็นนักพัฒนา Hybrid App หรือนักพัฒนาเว็บที่ต้องทำงานแบบ Mobile First ทุกอย่างเริ่มจากโทรศัพท์ก่อนนั่นเอง",
      "slug": "Chrome-Device-Inspect",
      "detail": "<p>หลายๆคนคงเคยใช้เจ้าเครื่องมือ  Google Chrome Dev Tools หรือที่เราเรียกกันติดปาก\nทั่วไปว่า Inspect Element นั่นเอง ปรกติแล้วนักทำเว็บทั่วไปก็ใช้กันอยู่บ่อยๆ แทบจะเป็น\nอีกเครื่องมือสำคัญที่ขาดไม่ได้ไปเลย สำหรับคนที่ทำ Hybrid App หรือเว็บไซต์ที่เป็น<br />\nMobile First อยู่แล้วอีกเครื่องมือที่ขาดไม่ได้เช่นกันนั่นก็คือ Inspect Devices ครับ</p>\n\n<p>เจ้า Inspect Devices สามารถตรวจสอบเว็บที่เปิดอยู่กับอุปกรณ์ Android ที่ถูกเปิดด้วย Google Chrome (รวมถึง Hybrid App ด้วย) แค่เสียบสาย data เชื่อมโทรศัพท์กับเครื่องคอมพิวเตอร์เราก็สามารถ Inspect Element เว็บใน Android Device  ได้แล้วครับ</p>\n\n<p><img src=\"https://developer.chrome.com/devtools/docs/remote-debugging/remote-debug-banner.png\" alt=\"Dev Tools\" /></p>\n\n<h2 id=\"requirements\">Requirements</h2>\n<ul>\n  <li>Google Chrome 32+</li>\n  <li>สาย USB Data Link หรือสายที่เราชอบเสียบกับโทรศัพท์และเครื่องคอมเรานั่นแหละครับ</li>\n  <li>Android ต้องเวอร์ชั่น 4.0 ขึ้นไปนะครับ</li>\n</ul>\n\n<h2 id=\"ตั่งค่าโทรศัพท์\">ตั่งค่าโทรศัพท์</h2>\n<p>สำหรับโทรศัพท์ที่จะสามารถใช้ Inspect Devices ต้องเปิด USB Debugging ก่อนนะครับ ซึ่งเจ้า  USB Debugging เนี่ยจะอยู่ใน Settings &gt; Developer Options ครับ แน่นอนเราจำเป็นต้องทำโทรศัพท์ของเราให้เป็น Developer ก่อนถึงจะเห็น Option นี้ครับ</p>\n\n<p>สำหรับโทรศัพท์เครื่องไหนที่ยังไม่ได้เปิด Developer Options ให้ไปที่ settings &gt; About Phone แล้วหาคำว่า Build Number กดตรงนั้นประมาณ 7 ครั้งครับ ก็จะมีข้อความขึ้นมาบอกให้เรารู้ว่าตอนนี้เราเป็น Developer แล้ว สามารถดูเพิ่มเติมที่ <a href=\"https://developer.chrome.com/devtools/docs/remote-debugging#setting-up-device\">https://developer.chrome.com/devtools/docs/remote-debugging#setting-up-device</a> ได้เลยครับ</p>\n\n<p>ใน Developer Options ให้เราเลือก USB Debugging ไว้ด้วยนะครับ และที่สำคัญเครื่องคอมฯเราต้องมี OEM USB Driver นะครับสำหรับ Android เชิญไปโหลดกันที่ <a href=\"https://developer.android.com/tools/extras/oem-usb.html\">https://developer.android.com/tools/extras/oem-usb.html</a></p>\n\n<h2 id=\"inspect-device\">Inspect Device</h2>\n<p>เมื่อเชื่อมต่อโทรศัพท์กับคอมพิวเตอร์แล้วต่อไปเราก็เข้าสู้หน้า inspect ใน Google Chrome กันครับโดยสามารถเข้าถึงได้ 2 วิธีด้วยกันครับวิธีแรก พิมพ์ <code>chrome://inspect</code> ลงใน address bar ครับ วิธีที่สองไปที่ More Tools &gt; Inspect Devices ครับ จากนั้นโทรศัพท์ของเราจะมีหน้าต่างเตือนขึ้นมาครับ ให้เรากด OK ไปครับ</p>\n\n<p><img src=\"https://developer.chrome.com/devtools/docs/remote-debugging/rsa-fingerprint.png\" alt=\"USB Debugging\" /></p>\n\n<p>จากนั้นเราก็จะเข้ามาสู่หน้า List Device ครับ พร้อมกับแสดงให้ดูว่าเราเปิดอะไรอยู่บ้างครับ ซึ่งเราจะสามารถเลือกจากตรงนี้เพื่อ inspect ครับ ของผมเสียบเครื่องเดียวก็จะขึ้นเครื่องเดียวตามภาพนะครับหากมีหลายเครื่องก็จะขึ้นเรียงกันมาครับ</p>\n\n<p><img src=\"https://c1.staticflickr.com/1/557/20102394758_6f2085dab3_z.jpg%22\" alt=\"\" /></p>\n\n<p>จากนั้นให้เราเลือกที่คำว่า inspect ครับก็จะปรากฏหน้าต่าง inspect element  พร้อมกับ Capture หน้าจอเราไปด้วยเลยแหละครับ</p>\n\n<p><img src=\"https://c1.staticflickr.com/1/527/20282119852_2d36dc3836_b.jpg\" alt=\"\" /></p>\n\n<p><img src=\"https://c1.staticflickr.com/1/465/19667882864_1b6e8f5762_z.jpg\" alt=\"\" /></p>\n\n<p>ทีนี้ก็ทำเว็บกับ Hybrid App กันได้อย่างสบายใจแล้วสินะครับ</p>\n\n<p>หากต้องการรายละเอียดและลูกเล่นอื่นๆ รวมไปถึงการตั้งค่าต่างๆ ลองเข้าไปดูที่เว็บของ Google Chrome นะครับ ตามไปเลย <a href=\"https://developer.chrome.com/devtools/docs/remote-debugging#setting-up-device\">https://developer.chrome.com/devtools/docs/remote-debugging#setting-up-device</a></p>\n\n"
    }
    ,
    {
      "title": "Back to my way.",
      "link": "/2015/07/Back-to-my-way.html",
      "image": "https://farm1.staticflickr.com/523/20075971036_aac166ec1b_b.jpg",
      "content": "การหวนลับมาครั้งนี้ ได้อะไรกลับมามากมายหลายอย่าง และได้รู้ความจริงแล้วว่าอะไรที่เหมาะกับตัวเองมากที่สุด อะไรคือสิ่งที่เราเป็น และอะไรคือความฝันของเรา หลังจากที่ลองออกไปเพื่อต้องการรู้ว่าเด็กที่จบออกมาทำไม ทำไม ทำไม ถึงไม่ได้อะไรออกมาเลย",
      "slug": "Back-to-my-way",
      "detail": "<p>คงจำได้ว่าช่วงเวลาที่ผ่นมาของผมเองเคยเสียเวลากับการลองทำ ลองเป็นในสิ่งที่ไม่ใช่ เพื่อจะได้รู้ว่าเราเหมาะสมและควรกับสิ่งเหล่านั้นหรือเปล่า หลายๆครั้งที่เสียเวลาสุดท้ายก็กลับมาในทางเดินของตัวเองเช่นเคย</p>\n\n<p>ช่วงสองปีก่อนหน้านี้ เคยเบื่อกับทางเดินของตัวเองเลยอยากรู้ว่าหากตัวเราเองเป็นผู้ถ่ายทอดให้คนอื่นบ้างล่ะจะเป็นยังไง ก็ลงเอยด้วยอาชีพ <code>ครู</code> ซึ่งเราเองก็ค่อนข้างจะชอบอาชีพนี้พอสมควร</p>\n\n<p>สนุกไหม? สนุกมาก เวลาอธิบายแล้วมีคนเข้าใจ มีคนถาม มีคนสนใจ เป็นอะไรที่ตื่นเต้นดีนะ สอนให้นักเรียนเข้าใจ เราก็ดีใจไปด้วยในฐานะที่ได้เติมเต็มความสามารถให้กับเขา</p>\n\n<p>ในความสนุกมันก็มีความไม่สนุกอยู่ด้วยแหละ หลายสิ่ง หลายอย่างที่จะไม่ขอเอ่ย ณ ที่นี้เอาเป็นว่าเก็บไว้เป็นความทรงจำว่าครั้งหนึ่งเคยเข้าไปอยู่ในวิชาชีพที่มีเกียรติและศักดิ์ศรีสูงส่ง</p>\n\n<p>แต่คุณก็รู้ว่าที่นั่น <code>หน่วยงานของรัฐ</code> ….. เสียดาย และสงสารเด็ก</p>\n"
    }
  ]
  ,"next": "/api/feed-12.json"
  
  ,"prev": "/api/feed-10.json"
  
}