{
  "pages": [
    
    {
      "title": "I am not a teacher yet.",
      "link": "/2014/11/I-am-not-a-teacher-yet.html",
      "image": "https://farm1.staticflickr.com/509/20102263075_10b7ff572f_b.jpg",
      "content": "ครูผู้ประสิทธิ์ประสาทวิชาความรู้แก่ลูกศิษย์ ขอนอบน้อมด้วยความเคารพแด่ครูบาอาจารย์ทุกท่าน ที่เคยประสาทวิชามาตั้งแต่เด็กจนตอนนี้ได้มาอยู่บนจุดที่สามารถเรียกตัวเองได้ว่า เป็นผู้ประสาทวิชาให้บุคคลอื่น แต่ถึงอย่างนั้น ผมเองก็ยังไม่เหมาะสมกับคำว่าครู",
      "slug": "I-am-not-a-teacher-yet",
      "detail": "<p>ครูผู้ประสิทธิ์ประสาทวิชาความรู้แก่ลูกศิษย์ ขอนอบน้อมด้วยความเคารพแด่ครูบาอาจารย์ทุกท่าน ที่เคยประสาทวิชามาตั้งแต่เด็กจนตอนนี้ได้มาอยู่บนจุดที่สามารถเรียกตัวเองได้ว่า เป็นผู้ประสาทวิชาให้บุคคลอื่น แต่ถึงอย่างนั้น ผมเองก็ยังไม่เหมาะสมกับคำว่า <strong>ครู</strong></p>\n\n<p>ทุกครั้งที่ผมพยายามอย่างที่สุดเพื่อที่จะให้สื่อการสอน และบทเรียนที่ถ่ายทอดออกไปต้องให้เด็กได้ความรู้ให้มากที่สุด ผมฝันและคิดอยู่เสมอว่าสิ่งที่ดีที่สุดในการสอนคือการให้เด็กได้ลองทำ ลองคิด ลองแก้ปัญหาที่ผมเคยเจอจากประสบการทำงาน เพื่อให้เขาได้ทราบถึงปัญหาที่เขาจะต้องเจอหลังจากจบออกไป</p>\n\n<p>มีครูคนไหนเคยคิดแบบนี้ไหมครับ?</p>\n\n<p>การเตรียมการสอนเป็นสิ่งที่ดี และเป็นสิ่งที่ควรกระทำอยู่เสมอ ผมเองต้องมั่นใจก่อนสอนเด็กเสมอว่าข้อมูลที่เราให้เขา ทักษะที่เราปลูกปั้นให้นั้น เขาต้องได้รับจากเราไปเต็มที่ ผมจึงเป็นคนที่จริงจังกับเรื่องนี้เป็ยอย่างมาก ข้อมูลต้องเป็นปัจจุบัน ตัวอย่าง ปัญหาต่างๆ ต้องมีให้เด็กได้เรียน ได้ลอง</p>\n\n<p>แต่….ผมกลับบกพร่องในส่ิงนั้น ผมเตรียมการสอนได้ไม่เต็มที่เป็นสิ่งที่แย่มาก ผมคิดเสมอต้องเตรียมการสอนก่อนสอนจริงทุกวัน ข้อมูลเป๊ะ แต่ผมกลับทำไม่ได้น่าเศร้าใจจริงๆ กลายผมต้องใช้หนังสือเดิม ความรู้เก่าเข้ามาสอนแทน ซึ่งบางครั้งมันก็เก่าจนเกินควร เก่าจนผมรับไม่ได้แต่ผมก็ไม่มีทางเลือก</p>\n\n<p>ไม่สมควรด้วยซ้ำที่จะเรียกตัวเองว่าครู</p>\n\n<p>แล้วไปโรงเรียนทุกวัน กลับค่ำมืดไปทำอะไรนักหนา? ทำงานครับ ขอย้ำว่าทำงาน งานของผมคือ… ผมไม่กล้าตอบว่างานของผมคือสอนเด็ก เพราะตอนนี้มันไม่ใช่ ดูเหมือนที่ทำทุกวันนี้มันไม่ใช่เพื่อเด็ก แต่เหมือนผมไปเป็นบันได บันไดเลื่อนด้วยซ้ำ เพื่อให้เขาเหล่าเหยียบขึ้นไปสู่อำนาจ งานส่วนใหญ่ไม่ใช่การสอน ย้ำครับ ด้วยเหตุนี้ก็เหมาะสมแล้วที่ไม่ควรเลือกตัวเองว่าครู <strong>เพราะถ้าขึ้นชื่อว่าครู การประสาทวิชาเด็ก ควรเป็นสิ่งที่ที่ต้องทำ ไม่ใช่เงิน ตำแหน่ง ชื่อเสียง และยศถา</strong> ผมก็ได้แต่หวังว่าสักวันหนึ่งครู(บางส่วน)ที่นี่ จะคิดเหมือนเหมือนกันผม</p>\n\n<p>ขอนอบน้อม ครู อาจารย์ ทุกท่าน ด้วยความเคารพ</p>\n"
    }
    ,
    {
      "title": "I should not be here.",
      "link": "/2014/10/i-hate-this-system.html",
      "image": "https://farm4.staticflickr.com/3936/15271652380_17175e9a1c_o_d.jpg",
      "content": "หากคุณลองถามตัวเองว่าเป้าหมายของการทำงานของคุณคืออะไร? หากคุณตอบได้ แต่สิ่งที่คุณกำลังเป็นและทำอยู่มันไม่ได้เหมือนที่คุณคิดไว้แต่แรก แล้วคุณจะทำอย่างไรกัน?",
      "slug": "i-hate-this-system",
      "detail": "<p>หากคุณลองถามตัวเองว่าเป้าหมายของการทำงานของคุณคืออะไร? หากคุณตอบได้ แต่สิ่งที่คุณกำลังเป็นและทำอยู่มันไม่ได้เหมือนที่คุณคิดไว้แต่แรก แล้วคุณจะทำอย่างไรกัน?</p>\n\n<p>สำหรับผมแล้ว สิ่งที่ผมกำลังทำอยู่มันอาจจะแตกต่างจากความฝันไปมาก แต่ก็ยังอยู่ในเส้นทางเดินของตัวผม แต่การทิ้งความฝันและโอกาสของตัวเองเพื่อมาเดินเส้นทางนี้มีเพียงเป้าหมายเดียวเท่านั้นคือ <strong>อยากให้น้องๆ ที่จบออกไป ไม่ต้องมีใครมาดูถูก</strong> สิ่งนี้แหละที่เป็นแรงบันดาลใจให้อดทนและทนต่อมาจนถึงทุกวันนี้</p>\n\n<p>แต่ กำลังใจจากน้องๆ ที่คอยให้ครูคนนี้อยู่เสมอมันกำลังถูกบั่นทอนด้วยระบบที่หลายๆคนเรียกกันว่า “ข้าราชการ” ไม่แปลกใจเลยว่าในวงการนี้ทำไมไม่มีบุคลากรที่มีความสามารถโดยตรง หรือบุคลากรที่มีความสามารถ แต่ไม่สามารถหลับหูหลับตา ไม่รู้ไม่เห็น ทนอยู่อยู่กับผลประโยชน์ที่เอาแต่ตัวเองเป็นหลักแบบนี้</p>\n\n<p>หากระบบการศึกษาไทยยังมาแต่โบ้ยกันไปมาว่าไม่มีคุณภาพ อยากให้ครูลองมองตัวเองก่อน แล้วมองไปถึงสิ่งที่อยู่ตำแหน่งเหนือเราขึ้นไป ว่าอะไรคือเป้าหมายของครู นักเรียน…..หรือผลประโยชน์?</p>\n\n<p>ผมขอแค่ให้น้องๆ จบไปแบบมีมาตรฐาน จะผมจะอยู่ที่นี่ได้นานสักเท่าไหร่ ก็ขึ้นอยู่กับระบบห่วยๆ ระบบนี้</p>\n"
    }
    ,
    {
      "title": "It's definitely not easy to be a teacher.",
      "link": "/2014/05/it-not-easy.html",
      "image": "https://farm4.staticflickr.com/3715/14111296819_f5d9cfff57_o.jpg",
      "content": "มีความสุขดีกับวิชาชีพในปัจจุบัน เข้าใจความรู้สึกของคนที่เป็นแม่พิมพ์ของชาติ เราเคยอยู่ในมุมมองที่เป็นนักเรียนนักศึกษามาโดยตลอด แต่หากว่าสถานะในวันนี้ กลับกลายเป็นผู้ให้ความรู้กลายเป็นเราไปอยู่ในอีกมุมหนึ่ง ซึ่งเป็นมุนที่นักศึกษาไม่เคยเห็น และไม่เคยสัมผัส",
      "slug": "it-not-easy",
      "detail": "<p>มีความสุขดีกับวิชาชีพในปัจจุบัน เข้าใจความรู้สึกของคนที่เป็นแม่พิมพ์ของชาติ เราเคยอยู่ในมุมมองที่เป็นนักเรียนนักศึกษามาโดยตลอด แต่หากว่าสถานะในวันนี้ กลับกลายเป็นผู้ให้ความรู้กลายเป็นเราไปอยู่ในอีกมุมหนึ่ง ซึ่งเป็นมุนที่นักศึกษาไม่เคยเห็น และไม่เคยสัมผัส</p>\n\n<p>ครู อาชีพหนึ่งที่หลายๆคนไฝ่ฝันไว้ บางคนฝันเอาไว้อย่างสวยงามเลิศหรูจินตนาการความสบายเอาไว้เป็นหลัก หากอยู่ในมุมมองที่ไม่ใช่ครู อาจจะเป็นมุมมองที่ดูเหมือนครูในมุมมองเหล่านั้นสุดแสนที่จะเป็นอาชีพที่แสนสบาย ไม่ได้หนักหนาสาหัสอะไร ถึงเวลาก้ไปสอน เลิกเรียนก็กลับบ้าน</p>\n\n<p>ผมเป็นอีกคนหนึ่งที่มีความคิดแบบนั้น และผมเองก็ค่อนข้างมั่นใจว่าหลายๆคนก็มีความคิดแบบเดียวกับผมแน่นอน คุณครูที่แสนสบาย ในเวลานี้ไม่ใช่เสียแล้ว</p>\n\n<p>ตื่นแต่เช้าเพื่อคอยดูนักศึกษาว่ามาเข้าแถวทำกิจกรรมตอนเช้าหรือเปล่า แผนการเรียนการสอนทำหรือยัง บันทึกข้อความ โครงการต่างๆต้องเขียน คำสั่งทางราชการต่างๆ ฯลฯ</p>\n\n<p>แค่ข้างบนก็แทบจะไม่มีเวลาแล้ว</p>\n\n<p>อีกอย่างที่เข้าใจและซึ้งใจในวิชาชีพนี้ “พรุ่งนี้จะเอาอะไรไปสอน?” คำถามนี้มันก้องในหัวตลอดเวลา ทำให้คนอย่างผมอดไม่ได้ที่จะต้องเตรียมตัวเตรียมข้อมูลเพื่อลูกศิษย์ สอนตามแผนการสอน แต่สอดแทรกประสบการณ์ให้ <strong>ครูเป็นผู้ใหัที่ยิ่งใหญ่ที่สุดรองจากพ่อแม่</strong></p>\n\n<p>ผมก้าวเข้ามาสู่วิชาชีพนี้ด้วยความตั้งใจในการสอนทักษะให้เด็กอย่างเต็มที่ด้วยความสามารถและประสบการณ์การทำงานของตัวผม โดยอยากจะสอนเด็กในรูปแบบของการทำงาน ให้เขาได้รู้ว่าการทำงานข้างนอกเป็นอย่างไร นี่คือความตั้งใจของผม</p>\n\n<p>แต่… มันไม่ได้ หลักสูตรถูกกำหนดมาอย่างตายตัว มองดูหลักสูตรแล้วดูดีและมีประสิทธิภาพ เสริมสร้างทักษะแก่นักศึกษาได้แน่นอน สิ่งหนึ่งคือทำไมต้องยึดติดกับอุปกรณ์ หรือสื่อการสอนเพียงอย่างเดียว บางอย่างเขาไปไกลแต่เราทำอะไรไม่ได้เลย อยากให้นักศึกษามากกว่านี้ แต่เราแหกไม่ได้</p>\n\n<p>ในเมื่อเราแหกไม่ได้ เราก็เอามันมาเป็นเครื่องมือของเรา … นักศึกษาผมต้องเรียนรู้จากประสบการณ์</p>\n\n"
    }
  ]
  ,"next": "/api/feed-13.json"
  
  ,"prev": "/api/feed-11.json"
  
}