{
  "pages": [
    
    {
      "title": "Singha Songkran Chiang Mai Night Run",
      "link": "/2016/04/signha-night-run.html",
      "image": "https://bestrangers.files.wordpress.com/2016/04/singha-night-run.jpg",
      "content": "เป็นยังไงกันบ้างครับกับงานสงกรานต์ที่พึ่งผ่านพ้นกันไป หลายคงเล่นน้ำกันอย่างสนุกสนาน ผมเองก็เช่นกันไม่ได้เล่นน้ำเลย ไม่ได้ซ้อมวิ่ง ไม่ได้ซ้อมปั่น แต่ก็ยังมีงานวิ่งมาให้ได้ออกกำลังอยู่หนึ่งงานคืองาน สิงห์สงกรานต์เชียงใหม่ครับ งานนี้วิ่งขึ้นดอยสุเทพแล้วลงมา มารีวิวให้ฟังกันนะครับบบ",
      "slug": "signha-night-run",
      "detail": "<p>เป็นยังไงกันบ้างครับกับงานสงกรานต์ที่พึ่งผ่านพ้นกันไป หลายคงเล่นน้ำกันอย่างสนุกสนาน ผมเองก็เช่นกันไม่ได้เล่นน้ำเลย ไม่ได้ซ้อมวิ่ง ไม่ได้ซ้อมปั่น แต่ก็ยังมีงานวิ่งมาให้ได้ออกกำลังอยู่หนึ่งงานคืองาน สิงห์สงกรานต์เชียงใหม่ครับ งานนี้วิ่งขึ้นดอยสุเทพแล้วลงมา มารีวิวให้ฟังกันนะครับบบ</p>\n\n<h3 id=\"สมัครวิ่ง\">สมัครวิ่ง</h3>\n\n<p>หากจะวิ่งก็ต้องสมัครใช่ไหมครับ งานนี้ผมสมัครไม่ทันอีกเช่นเคยครับ ไม่ใช่เพราะว่าสมัครช้านะครับแต่ผมไม่คิดว่าจะไปวิ่งด้วยซ้ำครับเพราะเห็นว่าสงกรานต์น่าจะเมาแน่นอน ดูในเว็บก็ยังชั่งใจอยู่นิดว่าจะวิ่งดีไหม เพราะยังมีโอกาสสมัครวันแข่งช่วงบ่าย ในที่สุดตัดสินใจแข่งดิ่งไปสมัครที่สวนสัตว์เลย จะสมัครทั้งที 21km ไปเลยครัชชชช ผมห้าวอยู่แล้ว</p>\n\n<p>คนที่สวนสัตว์เชียงใหม่เยอะพอสมควรเพราะเป็นวันสงกรานต์พาครอบครัวมาเที่ยวกัน ไปถึงเขียนชื่อสมัครจ่ายตังค์ รับ Race Pack ตรวจสอบ Tracking Ship รับเสื้อเป็นอันเสร็จพิธี</p>\n\n<h3 id=\"race-pack\">Race Pack</h3>\n\n<p>งานนี้แจกถุงสีชมพูครับ คุ้นๆกันไหม หน้าถุงเขียนไว้ชัดเจนว่า “เมืองไทยมาราธอน 2015” นั่นไง reuse อีกแล้วนะครับ (แต่เรื่องถุงเห็นดราม่าในเว็บเพียบ) เปิดออกมาสิ่งที่เราได้คือ</p>\n\n<ul>\n  <li>เสื้อกล้ามสีขาว เนื้อผ้าบางเบาสำหรับใส่วิ่ง มีรูระบายอากาศด้านหลัง ใส่สบายดีไซน์โอเคสีขาวลายน้ำดื่มตราสิงห์ ขอชื่นชม</li>\n  <li>ไฟสำหรับวิ่ง แบบธรรมดาทั่วไปหาซื้อได้ตามร้านจักยานหรือตลาดนัดอันนี้โอเค</li>\n  <li>สายคาดเอวสำหรับติด BIB อันนี้ชอบเพราะผมเป็นคนที่ไม่ชอบใช้เข็มกลัดติด BIB</li>\n  <li>BIB พร้อม track ถือว่าทำได้ดีกว่า CMU มาราธอน</li>\n</ul>\n\n<h3 id=\"start\">Start</h3>\n\n<p>มาถึงสวนสัตว์เชียงใหม่ก่อนเวลาประมาณ 1 ชั่วโมงเพราะต้องการเผื่อเวลาวอร์มร่างกาย แต่รถติดครับ ด้วยความแคบของทางเข้าสวนสัตว์เชียงใหม่ประกอบกับลานจอดรถที่มีน้อยและแคบอยู่แล้วก็ต้องวนหาที่จอดกันไป จอดได้ก็ลงมาที่งานหาเพื่อนๆก่อน</p>\n\n<p>ก่อนเข้ามาแวะซื้อกล้วยตากมากล่องหนึ่งเพราะคิดว่าคงหาซื้อเจลไม่ได้แล้วล่ะ พกกล้วยมาด้วยเลยแต่ดันมาเจอแม่ค้าเอาเจลมาขายด้วยงานนี้ 100 บาทแอบแพงนะเนี่ย แต่ไม่เป็นไร ซื้อไว้ 1 อันเอาไปพร้อมกล้วยตากในกระเป๋าคาดเอว</p>\n\n<p>พร้อมแล้วครับ ในหัวก็วางแผนการวิ่งขอไม่เกิน 2:30 ชั่วโมง เพราะเป็นทางขึ้นยาวกะจะขึ้น Pace 7 ไปเลยเพราะไม่เคยซ้อมขึ้นดอยสุเทพมาก่อนเลย ตอนลงค่อยว่ากันใหม่ คนไม่ค่อยเยอะเท่าไหร่งานนี้ เท่าที่เห็นตัวเต็งก็คงจะหนีไม่พ้นพวกแอฟริกันแน่นอน 8:00pm ปล่อยตัว!!!!</p>\n\n<h3 id=\"5km-แรก\">5km แรก</h3>\n\n<p>ยังประคอง Pace ของตัวเองได้ดีในช่วง 1-2km แรกอยู่ใน Pace 6 วิ่งสบายๆ เริ่มแซงคนอื่นขึ้นมาเรื่อยๆเพราะเห็นหลายคนวิ่งออกมาเร็วมากสุดท้ายกลายเป็นเดิน ประคองความเร็วยกมือไหว้รูปปั้นครูบาตามปรกติยังวิ่งชิวๆ ไปเรื่อยๆ ค่อยแซงขึ้นไปพร้อมกับทางชันและความมืด มีบางช่วงรู้สึกเหมือนวิ่งคนเดียวเพราะไม่มีใครเลย มีรถสวนลงมาเป็นระยะ แอบกังวลเรื่องความปลอดภัย</p>\n\n<p>ผ่านศาลาที่มีคนเคยแขวนคอตาย บรึ๋ยยยยยย เดี๋ยวลงมาก็ต้องผ่านอีกไม่คิดดีกว่า 555 ถึงจุดชมวิวเราไม่หยุดชมวิวนะครับ ประคอง Pace ตัวเองต่อไปครับช่วงระยะทางประมาณ 3-4km เริ่มตกลงมาที่ 6 กว่าเกือบ 7 แล้ววว แต่ก็ยังไม่มีใครแซงเราขึ้นไป ถือว่ายังใช้ได้</p>\n\n<p>ถึงระยะกลับตัวของ 10km แล้วยังวิ่งสบายอยู่ ไม่มีอาการบาดเจ็บ ไม่มีอาการล้ายังคงวิ่งต่อไปและตอนนี้คนจะเริ่มน้อยลงเพราะส่วนใหญ่ลง 10km กันหมด</p>\n\n<h3 id=\"8km\">8km</h3>\n\n<p>หลังจากผ่าน 5km มาทางเริ่มชันขึ้นมากกว่าเดิม ลมแรงอันนี้เซ็งมาก ต้องวิ่งต้านลมขึ้นไปตอนนี้ Pace ของผมเริ่มตกไปเป็น 6 ปลายถึง 7 เลย ไม่รู้ว่าความชันจะเยอะกว่านี้อีกไหมและต้องเก็บแรงขาลงอีก ยังประคองความเร็วตัวเองวิ่งไปเรื่อยๆ บางช่วงที่ถนนมืดแล้วเริ่มวิ่งคนเดียว พยายามเปิดไฟแล้วถือไฟส่องทาง บางครั้งก็ยังมีรถขึ้นไปบนดอย และสวนลงมาเป็นระยะ อันตรายนะครับ น่าจะปิดถนนไปเลย</p>\n\n<p>ตอนนี้เริ่มมีคนวิ่งสวนลงมาแล้ว แอฟริกันครับ ที่หนึ่งวิ่งสวนลงไปแล้ว และก็มีคนอื่นๆ ตามลงมากันเรื่อยๆ ครับ</p>\n\n<p>ลมเริ่มแรงขึ้นต้องคอยโน้มตัวไปข้างหน้าเพื่อให้ลู่ลมจะได้วิ่งง่ายขึ้น เสียพลังงานไปเยอะพอสมควรกับการที่ต้องวิ่งต่อสู้กับลม อีกแค่ 2.5km เองก็จะได้วิ่งลงแล้ววว</p>\n\n<h3 id=\"11km-กลับตัว\">11km กลับตัว</h3>\n\n<p>ยังคงวิ่งต้านลมไปเรื่อยๆ มีทั้งกิ่งไม้และใบไม้ที่หักและหล่นลงมาบนพื้นถนน ต้องคอยหลบบางครั้งยังแอบกลัวว่าจะตกมาใส่หัวเราไหมเนี่ยลมแรงขนาดนี้ ใกล้เข้าสู่ทางชันก่อนถึงวัดพระธาตุแล้วอีกนิดเดียวเอง ตรงนี้นับว่าเป็นทางชันที่สุดก่อนจะกลับตัววิ่งลงมา</p>\n\n<p>เป็นไปตามคาดครับ ลมแรงกับความชันขนาดนั้นผมมิอาจจะสู้ไหว พยายามวิ่งช้าๆ แต่เพื่อรักษาพลังงานเดินดีกว่า เดินประมาณ 100เมตรจนถึงจุดกลับตัว ตอนนี้รู้ตัวทันทีว่าขาลงต้องทำเวลาเพราะเสียเวลาตอนเดินไปมาก กลับตัวแล้วเตรียมลง</p>\n\n<h3 id=\"18km-ลงลูกเดียว\">18km ลงลูกเดียว</h3>\n\n<p>ยังคงหายใจทางจมูก อัตราการเต้นของหัวใจปรกติ กล้ามเนื้อยังไม่ล้าทุกอย่างโอเค เริ่มวิ่งทันที ความชันและการวิ่งลงด้วยความเร็วถือว่าไม่ได้เป็นผลดีเลยเพราะฝ่าเท้ากระแทกแรงมากจนรู้สึกได้ ช่วงวิ่งลงช่วงแรกวิ่งที่ Pace 4-5 ถือว่าเร็วมากเพราะความอันตรายทั้งรถที่สวนมา และความมืด ประกอบกับวิ่งคนเดียวด้วย และลมก็แรง</p>\n\n<p>ช่วง 15km เป็นต้นไป ส่วนใหญ่วิ่งคนเดียวรัวๆ เลยครับเพราะทิ้งช่วงห่างมากทั้งคนข้างหน้าและคนข้างหลังเรียกว่าแทบไม่มีใครเลยจะมีก็แค่คนสวนขึ้นมาแบบประปรายเท่านั้น เริ่มคิดไปเองว่าจะมีใครแอบมาวิ่งเป็นเพื่อนรึเปล่าเนี่ย!!!</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/04/12963508_239994649687454_1490254816779139640_n.jpg\" alt=\"\" /></center>\n\n<h3 id=\"19-21km-ตระคริวมาเยือน\">19-21km ตระคริวมาเยือน</h3>\n\n<p>ผมเริ่มรู้สึกล้าที่ขาละ แต่ข้อดีคือไม่มีอาการเจ็บเข่ามาเยือนเลยรู้สึกว่าวิ่งรอบนี้เรานี้วิ่งสบายมาก มีเจ็บข้อเท้าขวาบ้างบางครั้งไม่เป็นไรมี Unirain ในกระเป๋าแวะฉีดเป็นช่วงๆ</p>\n\n<p>ตอนนี้ตระคริวเริ่มขึ้นที่ขาซ้ายจนต้องหยุดวิ่งไปหลายครั้งเหมือนกัน เพราะไม่อยากให้เป็นทั้งขาและทุกครั้งที่หยุดก็ฉีดสเปรย์ตลอดเลย ไม่ใช่แค่เราที่เป็นตระคริวพี่ฝรั่งก็เป็นช่วยฉีดสเปรย์ให้เขาไป</p>\n\n<p>วิ่งแบบตระคริวแดกจนกระทั่งเข้าเส้ยชัยเวลายังทำได้ถือว่าโอเค แต่ผมยังไม่พอใจเอาไว้แก้ตัวงานหน้า</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/04/screen-shot-2559-04-19-at-11-16-36-pm.png?w=736\" alt=\"\" /></center>\n\n<center>**เข้าที่ 11 ของรุ่นหวังว่าจะติด Top 10 แย่จัง**</center>\n<center>\n### ~2:14:07 ~\n</center>\n\n<h3 id=\"สรุปการจัดงาน\">สรุปการจัดงาน</h3>\n\n<ul>\n  <li>เป็นครั้งแรกที่วิ่งที่ความชันเยอะสุดแบบนี้</li>\n  <li>ไม่มีประสบการณ์ทำได้เท่านี้ถือว่าผ่าน</li>\n  <li>น้ำมีทุก 2km ขอชมเชย</li>\n  <li>แอบหวังว่าจะมีของกินนอกจากแตงโมที่ 13km ไม่มีเลย</li>\n  <li>น้ำขาลงหายไปไหนหมดดดดด</li>\n  <li>ขาลงมืดสุดๆ อันตรายสุดๆ รถลงมาต้องบีบแตรไล่ #รู้สึกไม่ปลอดภัย</li>\n  <li>ทางเข้าเส้นชัยสับสนมาก แคบ และมีทางเข้าหลายทาง ไม่รู้อันไหนเป็นจองระยะไหน</li>\n  <li>ได้เหรียญ 5km มาวิ่ง 21km นะครับบบบบบอันนี้ไม่ให้อภัยเลย</li>\n  <li>อาหารหมด</li>\n</ul>\n\n<center>\n### ปีหน้าไม่วิ่งงานนี้แล้ววววววว\n</center>\n"
    }
    ,
    {
      "title": "Runners idol",
      "link": "/2016/03/Runners-idol.html",
      "image": "https://bestrangers.files.wordpress.com/2016/02/12487283_905267789569608_1286800328184109617_o.jpg",
      "content": "นักวิ่งหลายๆ คนมีแรงบันดาลใจมาจากนักวิ่งที่ประวิ่งความสำเร็จและอยู่ในระดับพีคของการวิ่งทั้งนักวิ่งไทย และนักวิ่งต่างประเทศ แน่นอนว่าหากเรามีนักวิ่งในดวงในหรือนักวิ่งที่เราชื่นชอบ ย่อมเป็นแบบอย่างและแรงบันดาลใจให้เราพัฒนาตนเอง และมีความหวังที่จะวิ่ง และไปยืนอยู่บนจุดที่พวกเขายืนอยู่",
      "slug": "Runners-idol",
      "detail": "<p>นักวิ่งหลายๆ คนมีแรงบันดาลใจมาจากนักวิ่งที่ประวิ่งความสำเร็จและอยู่ในระดับพีคของการวิ่งทั้งนักวิ่งไทย และนักวิ่งต่างประเทศ แน่นอนว่าหากเรามีนักวิ่งในดวงในหรือนักวิ่งที่เราชื่นชอบ ย่อมเป็นแบบอย่างและแรงบันดาลใจให้เราพัฒนาตนเอง และมีความหวังที่จะวิ่ง และไปยืนอยู่บนจุดที่พวกเขายืนอยู่</p>\n\n<p>ครับผมเองก็เช่นกัน ผมก็มีนักวิ่งที่ผมติดตาม และคอยดูเขาตลอดเวลาไม่ว่าพวกเขาจะไปแข่งที่ไหน หรือทำอะไรอยู่ เราก็มักจะแอบดูว่าเขาใช้ชีวิตอย่างไรในแต่ละวัน ดูแลร่างกายอย่างไร พัฒนาตัวเองอย่างไรถึงวิ่งได้ขนาดนั้น และผมเองก็หวังเช่นกันว่าสักวัน ผมต้องไปอยู่ให้ใกลกับจุดที่เขายืนอยู่ให้มากที่สุด</p>\n\n<h3 id=\"พี่ป้อม-สัญญา-คานชัย\">พี่ป้อม สัญญา คานชัย</h3>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/02/12743617_923560911073629_6771067983204761681_n.jpg?w=736\" alt=\"\" /></center>\n\n<p>คนแรกที่ผมติดตาม และพยายามเฝ้าดูและเชียร์พี่เขาตลอดในการแข่งขันหลายๆ รายการคือพี่ป้อม สัญญา คานชัย พี่ป้อมผมรู้จักชื่อเสียงเรียงนามของแกครั้งแรกที่งาน 160 Miles Thailand ตอนนั้นยังเป็นตอนที่ผมเริ่มวิ่งใหม่ๆ จากที่ผมติดตามการแข่งขันในกลุ่มเฟสฯ Ultratrail เริ่มชอบพี่เขา พี่ป้อมยังจบรายการนี้ด้วยที่ 1 ประเภท Overall ด้วยครับโดยรวมระยะเวลาวิ่งทั้งสิ้น 18 ชั่วโมง 20 นาที เป็นอะไรที่ผมทึ่งมากตอนนั้น</p>\n\n<p>พี่ป้อม เป็นนักวิ่ง Ultra สังกัดทีม KingUDKind ทีมนี้โหดเอาเรื่องครับ พี่ป้อมเป็นคนติดดินมากครับ เหมือนชาวบ้านธรรมดาทั่วไปแต่การวิ่งพี่เขาไม่ได้เป็นรองใครเลยนะครับ ทุกอย่างพี่ป้อมซ้อมแบบลูกทุ่งมากตั้งแต่วิ่งลากยาง จัดตารางซ้อมเอง ตารางอาหารเอง ผมเทใจให้ไปเลยครับ</p>\n\n<p>สักวันหนึ่งผมจะไปยืนให้ใกล้กับ จุดที่พี่ป้อมกำลังยืนอยู่ตอนนี้ครับ และอีกอย่างพี่แกเคยได้ทอง 1 ล้านบาทจากน้ำชาเขียวด้วยนะครับ</p>\n\n<h3 id=\"รัชชี่-ไพรัช-วราสินธุ์\">รัชชี่ ไพรัช วราสินธุ์</h3>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/02/12339520_1659397034342653_8631950049511566147_o1.jpg?w=736\" alt=\"\" /></center>\n\n<p>รัชชี่เป็นอีกคนที่ผมเฝ้าติดตามการวิ่งของเขาเช่นกัน เป็นเป็นนักวิ่งผมชื่นชอบอีกคนหนึ่ง เป็นนักวิ่งติดตลกฮาดี ทุกครั้งที่เห็นภาพเขามักจะมีรอยยิ้มเสมอ รัชชี่ เป็นอีกหนึ่งคนที่เป็นนักวิ่งสาย Ultra สังกัดทีม KingUDKind เช่นกันครับ (บอกแล้วทีมนี้มีแต่สายโหด) เช่นเดียวกับพี่ป้อม ทั้งสองคนรักกันเหมือนพี่น้องครับ ติดดินมากและไม่ถือตัวด้วยครับ</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/02/12705166_919941008102286_7416891161477667501_n.jpg?w=736\" alt=\"\" /></center>\n\n<p>ผมรู้จักรัชชี่หลายๆ งานเมื่อปีที่ผ่านมาทั้ง Columbia Trail รวมไปถึง HK100 ที่ผ่านมาด้วย ซึ่งงานที่ HK100 รัชชี่เข้าเส้นเป็นคนไทยคนแรกครับ ด้วยการผ่านด่านสภาพอากาศมหาโหด</p>\n\n<p>นอกจากทั้งสองคนแล้วยังมีนักวิ่งอีกหลายๆ คนที่ผมติดตามพวกเขาอยู่ ในหลายๆรายที่พวกเขาไปวิ่งแสดงให้เห็นถึงจิตใจที่แข็งแกร่งของพวกเขา สภาพร่างกายที่แข็งแรง ทุกคนล้วนเป็น idol ผมทั้งนั้นครับ</p>\n\n<p>สักวันผมจะต้องวิ่ง Ultra เหมือนทุกท่านให้ได้!!!!</p>\n\n"
    }
    ,
    {
      "title": "Garmin Forerunner 235 Running Review",
      "link": "/2016/03/garmin-forerunner-235.html",
      "image": "https://bestrangers.files.wordpress.com/2016/03/maxresdefault.jpg",
      "content": "หลังจากที่ใช้  MI Band 1s ได้สักพักใหญ่ๆ ถึงเวลาอัพเกรดอุปกรณ์วิ่งอีกแล้ววววว เสียเงินเช่นเคย ไหนๆ ก็เอาจริงเอาจังด้านนี้ละ และคิดดูหลายรอบถึงความจำเป็นที่ต้องมีนาฬิกา เหตุผลหลักๆ ก็คือใช้ tracking ทุกอย่างที่เกี่ยวกับการวิ่งของผมเพื่อย้อนกลับมาวิเคราะห์การวิ่งของตนเองและพัฒนาตนเองต่อไป",
      "slug": "garmin-forerunner-235",
      "detail": "<p>หลังจากที่ใช้  MI Band 1s ได้สักพักใหญ่ๆ ถึงเวลาอัพเกรดอุปกรณ์วิ่งอีกแล้ววววว เสียเงินเช่นเคย ไหนๆ ก็เอาจริงเอาจังด้านนี้ละ และคิดดูหลายรอบถึงความจำเป็นที่ต้องมีนาฬิกา เหตุผลหลักๆ ก็คือใช้ tracking ทุกอย่างที่เกี่ยวกับการวิ่งของผมเพื่อย้อนกลับมาวิเคราะห์การวิ่งของตนเองและพัฒนาตนเองต่อไป</p>\n\n<p>คิดอยู่นานกับการซื้อนาฬิกาเพื่อการวิ่ง เพราะคิดอยู่เสมอว่าไม่จำเป็นใช้โทรศัพท์เอาก็ได้ แต่แล้วมีครั้งหนึ่งที่ใช้โทรศัพท์ไปวิ่งแล้วผลที่ได้กลับมาคือเปียกเหงื่อซึมเข้าไปในเครื่องเนื่องจากเป็นคนเหงื่อเยอะอยู่แล้วด้วย ในที่สุดก็ตัดสินใจว่าต้องเลือกมาใส่สักเรือนแล้ว</p>\n\n<p>ตัดสินใจอยู่นานสองนานเปรียบเทียบราคา และยี่ห้อต่างๆ หลายต่อหลายรุ่นในที่สุดก็มาตกลงปลงใจให้กับ Garmin Forerunner 235 เรือนนี้ครับ หลังจากที่ได้ลองใช้ไปได้สักสี่ห้าวันถึงเวลาต้องออกมารีวิวดูสักหน่อยว่าเป็นยังไงบ้าง</p>\n\n<h3 id=\"จำเป็นเหรอที่ต้องมีนาฬิกาสำหรับการวิ่ง\">จำเป็นเหรอที่ต้องมีนาฬิกาสำหรับการวิ่ง?</h3>\n\n<p>ถ้าตั้งคำถามนี่กับผม แน่นอนคำตอบที่ได้คือ “จำเป็น” เพราะผมเอาจริงเอาจังกับการวิ่งและการซ้อม ทุกครั้งที่วิ่งเสร็จจะใช้เวลาเพื่อวิเคราะห์การวิ่งของตัวเองเกือบทุกครั้ง ทั้งเรื่องเวลา ระยะทาง ความเร็ว อัตราการเต้นของหัวใจ หรือแม่แต่กระทั่งการขึ้นเนิน ทุกข้อมูลมีผลต่อการซ้อม และการพัฒนาตนเองของผมทั้งหมด พูดอีกอย่างคือโค๊ชดีๆ บนข้อมือของผมนั่นเอง</p>\n\n<p>ส่วนใครที่วิ่งเพื่อสุขภาพก็จำเป็นนะ มันขึ้นอยู่กับว่าคุณวิ่งเพื่ออะไรแค่นั้นครับ ถ้าเพื่อสนุกสนานก็คงไม่จำเป็นครับ หากอยากนับก้าว อยากนับแคลลอรี่ ก็มีรุ่นอื่น หรือลอง MI Band ที่ผมเคยรีวิวก็เพียงพอแล้วครับ</p>\n\n<h3 id=\"design\">Design</h3>\n\n<p>การออกแบบของ 235 ยังไม่โดนใจผมเลยครับแต่ก็ไม่ได้หมายความว่าถึงกับแย่ ดูในภาพเหมือนว่าจะขนาดพอดีแต่พอได้ลองใส่ดูเหมือนตัวเรือนใหญ่ไปหน่อย (ขึ้นอยู่กับขนาดข้อมือของแต่ละคน)  สีไม่มีสีไหนถูกใจเลย T-T เหลือง แดง เทา ฟ้า แต่ผมลือกสีแดงเพราะสวยสุดละสายติดกับนาฬิกาจะเป็นแดงดำ ผมไม่ชอบเท่าไหร่ เปลี่ยนกับสายสำรองที่เขาแถมมาให้เป็นดำแดง สวยขึ้นเยอะเลยครับ</p>\n\n<center>\n\t<img src=\"https://cnet4.cbsistatic.com/img/WICZMbHZeLP3TdvyX29P4FqWUtg=/970x0/2015/10/21/3f03bccf-58cf-4f4f-8b9c-66381e4497fd/garmin-forerunner-230.jpg\" alt=\"\" />\n\t<br />\n\thttps://www.cnet.com/news/garmin-debuts-three-new-gps-running-watches-with-all-day-tracking-smart-alerts/\n\t</center>\n\n<p>ปุ่มกดด้านข้างตัวเครื่องดูก๊อกแก๊กไปหน่อยเมื่อเทียบกับรุ่นสูงกว่า เหมือนได้ของเด็กเล่นมายังไงก็ไม่รู้ วัสดุที่ใช้เป็นพลาสติกที่ใส่แล้วรู้สึกว่าบอบบางเอาเสียจริงๆ ไม่อยากคิดถ้าทำตกหรือเหวี่ยงแขนไปโดนขอบโต๊ะ หน้าจอดูเหมือนพลาสติกบางๆ กลัวเป็นรอยเหลือเกิน</p>\n\n<p>น้ำหนักของนาฬิกาเบามาก 1.5 oz (42 g) เบาจนคิดว่านี่ของเด็กเล่นหรือนี่ แต่ก็เป็นเหตุผลของเรื่องการออกกำลังด้วยครับนาฬิกาวิ่งต้องเบาอยู่แล้วเรื่องนี้รับได้ครับ</p>\n\n<h3 id=\"การแสดงผล\">การแสดงผล</h3>\n\n<p>หน้าจอการแสดงผลขนาด 1.23″ (31.1 mm) ไม่ถือว่าเล็กนะพอดีๆ จอสีความละเอียด  215 x 180 pixels ไม่เลวสำหรับนาฬิกาสำหรับกีฬาครับหน้าจอดูกลางแดดจะชัดมากส่วนนี้ชอบ แต่กลางคืนต้องเปิดไฟดูครับ</p>\n\n<h3 id=\"รายละเอียดอื่นๆ-ของตัวเครื่อง\">รายละเอียดอื่นๆ ของตัวเครื่อง</h3>\n\n<p>แบตเตอรี่แบบ lithium-ion สามารถใช้งานต่อเนื่องได้ประมาณ 11 ชั่วโมงถ้าหากเปิด GPS สำหรับวิ่งแต่ถ้าเปิดปรกติเขาบอกว่าประมาณ 9 วันครับ</p>\n\n<p>สำหรับที่ชาร์ตแบตเตอรี่มาเป็นแบบคลิบหนีบครับคีบเอาตอนชาร์ต หากวิ่งยาวหลายชั่วโมงสามารถเสียบพาว์เวอร์แบงค์ขณะวิ่งได้ด้วย ส่วนรายละเอียดปลีกย่อยอื่นๆ สามารถดูเพิ่มเติมได้ที่ Garmin Forerunner 235 ครับ</p>\n\n<h3 id=\"for-runningheart-rate-accuracy\">For RunningHeart Rate accuracy</h3>\n\n<p>Garmin Forerunner 235 มาพร้อมกับการวัดอัตราการเต้นของหัวใจ โดยยิงแสงผ่านข้อมือของเราโอเคสำหรับคนที่ไม่ชอบ Heart Rate คาดอกเหมือนผมก็เลี่ยงมาใช้แบบข้อมือแทนเวลาใส่คาดอกแล้วรู้สึกเสียวๆยังไงไม่รู้ๆ</p>\n\n<center><img src=\"http://bieganie.pl/img/techno/gps/garmin235_560.jpg\" alt=\"\" />\n<br />http://bieganie.pl/img/techno/gps/garmin235_560.jpg</center>\n\n<p>ส่วนความแม่นยำของการวัด Heart Rate ผมว่าเกือบสอบตกหลังจากใช้มา มีครั้งหนึ่งที่ขึ้นมาไม่เกิน 120 bpm จนผมตกใจว่ามันไม่ใช่ละ ซึ่งก็มีหลายปัจจัยประกอบด้วยครับ เช่นสายนาฬิกาหลวมไป เหงื่อไหลผ่านบริเวณเซนเซอร์ แต่เป็นแค่ครั้งนั้นครั้งเดียว จากนั้นก็ปรกติ</p>\n\n<p>แต่หากเอาไปเทียบกับสายคาดอกหนีกันไปไม่มากจนน่าเกลียด เพราะแบบเซนเซอร์มีปัจจัยหลายอย่างตามที่ผมได้กล่าวไว้ข้างต้น แต่โดยรวมสำหรับผมถือว่าใช้งานได้ดีเลยครับ มีปัญหาแค่ครั้งนั้นครั้งเดียวเท่านั้น ถือว่าส่วนนี้ผ่านครับ</p>\n\n<h3 id=\"activity-tracking\">Activity Tracking</h3>\n\n<p>ออฟชั่นนี้ก็น่าสนใจครับหลังจากที่ผมเคยใช้ MI Band 1s มาก่อนหน้านี้ซึ่งคอยตามเก็บรายละเอียดต่างๆ ในชีวิตประจำวันผมอยู่เสมอๆ พอเปลี่ยนมาใช้ Garmin ยิ่งเก็บเยอะขึ้นกว่าเดิมตามนี้ครับ</p>\n\n<p><strong>Steps</strong></p>\n\n<p>เก็บการก้าวเดินของเราในทุกๆวัน สำหรับผมถือว่าช้ากว่าเจ้า MI Band ครับดีเลย์นิดๆไม่ถือกับว่าน่าเกลียดพร้อมแสดงผมให้เห็นในทันทีด้วย ถ้าหากเราพลิกข้อมือขึ้นมามองนาฬิมันจะแสดงตัวเลขนับเป็น Real Time ให้ดูครับ โดยจะบอกว่าเราเดินไปกี่ก้าว ห่างจากเป้าหมายเราเท่าไหร่ (เราสามารถตั้งค่าเป้าหมายของเราในแต่ละวันได้ครับ) บอกเรื่องของแคลลอรี่ที่ใช้ไป และระยะทั้งหมดด้วยครับ</p>\n\n<p><strong>Sleep</strong></p>\n\n<p>วัดการนอนหลับจะวัดจากการเคลื่อนไหวและอัตราการเต้นของหัวใจเราครับ บอกตั้งแต่เวลาหลับ หลับลึก หลับตื้น อัตราการเต้นของหัวใจขณะนอนหลับ ตื่นมาฉี่กี่โมงถือว่าวัดได้โอเคเลยครับแม่นยำดี มีตารางให้ดูว่าเรานอนดิ้นมากในช่วงไหนด้วย เข้าท่าดี</p>\n\n<p><strong>Heart Rate</strong></p>\n\n<p>เจ้านาฬิกาตัวนี้มันจะสุ่มแอบวัดอัตราการเต้นของหัวใจเราเป็นระยะครับ เราสามารถดูได้โดยการกดลูกศรเลื่อนลงมาดูครับจะมีกราฟแสดงอัตราการเต้นของหัวใจใน 4 ชั่วโมงล่าสุด พร้อมก็ตัวเลข Heat Rate แบบ real time ด้วยครับ</p>\n\n<p>นอกจาก Option ที่กล่าวข้องต้นแล้วนาฬิกาตัวนี้ยังสามารถเตือนเราได้ด้วยหากเราอยู่นิ่งนานเกินไป เราสามารถตั้งค่ากำหนดเวลาได้ด้วยครับว่าอยากให้เตือนเมื่อเราอยู่นิ่งนานเท่าไหร่ครับ</p>\n\n<p><strong>Running!</strong></p>\n\n<p>มาถึงความสามารถหลักของมันซักที!!! อันนี้ผมบอกก่อนเลยผมชอบมาก กดสองครั้งวิ่งเลย หลังจากนั้นเป็นเรื่องของนาฬิกาครับทำหน้าของมันเอง เก็บทุกอย่างให้เราจนวิ่งเสร็จ พอวิ่งเสร็จ Sync กับ Garmin Connect เพื่อดูผลสรุปแบบโคตรละเอียด (ขึ้นอยู่กับรุ่นของนาฬิกา) มันเป็นอะไรที่เพอเฟกต์ที่สุดครับ</p>\n\n<p>เมื่อเรากดปุ่มรูปคนวิ่งรอสักพักเพื่อให้นาฬิกาจับสัญญาน GPS  เมื่อจับสัญญานได้แล้วนาฬิกาจะแจ้งเตือนพร้อมสั่นเราก็สามารถวิ่งได้เลยทันทีครับ ในหน้าจอของการวิ่งหน้าจอแรกจะเป็นการรวมสถิติต่างๆระหว่างวิ่งครับ เราสามารถกำหนดเองได้ทุกอย่างใน Setting ครับว่าจะเอาสถิติตัวไหนไว้ตรงไหน ระหว่างวิ่งจะเก็บข้อมูลตามมนี้</p>\n\n<ul>\n  <li>ระยะทาง (Distance) อันนี้ผมชอบเรียลไทม์ดีมากเป๊ะดี</li>\n  <li>เวลาที่ใช้</li>\n  <li>อัตราก้าวต่อนาที Pace</li>\n  <li>ข้อมูลการเต้นของหัวใจ</li>\n  <li>Heart Rate Zone</li>\n</ul>\n\n<p>และยังมีอื่นๆ อีกเยอะต้องไปดูใน Garmin Connect หลังจากวิ่งเสร็จครับ เราสามารถตั้งประเภทการแจ้งเตือนได้หลายอย่างมากครับ มีอะไรบ้างผมลิสมาให้บางส่วนครับ ลองไปดูเพื่มเติมใน Setting ได้ครับ</p>\n\n<ul>\n  <li>เตือนทุก 1km หรือแล้วแต่เราจะตั้ง</li>\n  <li>เตือนให้ดื่มน้ำตอนวิ่ง</li>\n  <li>เตือนให้รับประทานอาหาร</li>\n  <li>เตือนให้กลับตัวเมื่อถึงระยะที่เราตั้งไว้</li>\n  <li>เตือนอัตราการเต้นของหัวใจ</li>\n  <li>เตือนเรื่องแคลลอรี่</li>\n  <li>เตือนให้กลับบ้าน</li>\n</ul>\n\n<p>เยอะเหลือเกินครับเรียกว่าจัดเต็มมาครบทุกฟังก์ชั่นจริงๆ เรียกว่าคุ้มสุดๆ ครับ</p>\n\n<p><strong>Running Plan/Workout</strong></p>\n\n<p>นอกจากกดวิ่งแบบธรรมดาแล้วยังมี Option สำหรับคนชอบซ้อมเอาเป็นเอาตายแบบผมด้วยครับ คือการกำหนดวันเวลาซ้อม และวางแผนการซ้อม ไม่ว่าจะเป็นการวิ่งแบบ Tempo หรือการวิ่งแบบ Intreval การวิ่งแบบ Lab เป็นต้น ซึ่งตรงนี้เป็นอีกหนึ่งความสามารถที่ผมชอบจริงๆ ผมขอรีวิวเฉพาะส่วนที่ผมเคยใช้นะครับ</p>\n\n<p><strong>Interval Run</strong></p>\n\n<p>การวิ่งแบบลงคอร์ดนั่นเองครับ เราสามารถกำหนดได้เองเลยครับว่าจะวิ่งตามระยะทาง หรือวิ่งตามเวลาที่กำหนดไว้ เช่น ผมวิ่ง 1000 * 5 pace 4:00 พัก 3 นาที ก็สามารถเข้าไปตั้งค่าได้เลยครับ และยังสามารถตั้งเวลาวอร์มอัพ คูลดาวได้ด้วย แม่เจ้าอะไรจะเท่ห์ขนาดนี้ เหมือนมีโค๊ชอยู่บนข้อมือ วิธีใช้งานก็แสนง่าย เข้าไปที่ My Workout แล้วกด Start ได้เลย !!!!</p>\n\n<h3 id=\"ความสามารถอื่น\">ความสามารถอื่น</h3>\n\n<p>นอกเหนือจากความสามารถที่ได้กล่าวมาอย่างยาวเหยียดนั้น ยังมีความสามารถอื่นๆอีกหลายอย่างซึ่งผมจะขอลิสไว้คร่าวๆ ตรงนี้แล้วกันนะครับความสามารถมันเยอะมาก</p>\n\n<ul>\n  <li>เตือนโทรเข้า รับสายเมื่อเชื่อม Bluetooth กับโทรศัพท์</li>\n  <li>แจ้งเตือน SMS และ Email</li>\n  <li>ดูสภาพอากาศปัจจุบัน</li>\n  <li>ปฎิทินและวิ่งที่ต้องทำ</li>\n  <li>Track ว่ายน้ำ</li>\n  <li>Track การปั่นจักยาน</li>\n  <li>เปลี่ยนรูปแบบหน้าจอ</li>\n  <li>นาฬิกาปลุก</li>\n  <li>วัด VO2 MAX ของเรายิ่งมายิ่งดี</li>\n  <li>ควบคุมการเล่นเพลง</li>\n  <li>ฯลฯ</li>\n</ul>\n\n<p>เยอะจัดไปอ่านเอาเองครับ <a href=\"https://buy.garmin.com/en-US/US/into-sports/running/forerunner-235/prod529988.html\">235 Feature</a> อ่านก็ไปซื้อเลยครับรับรองคุ้มมาก</p>\n"
    }
  ]
  ,"next": "/api/feed-7.json"
  
  ,"prev": "/api/feed-5.json"
  
}