{
  "pages": [
    
    {
      "title": "Earthquake Detects History",
      "link": "/2014/05/earthquake-detect-history.html",
      "image": "https://farm6.staticflickr.com/5101/14114894846_5f9eae78a7_b.jpg",
      "content": "ถ้าถามว่าแอฟนี้ผมทำมากี่รอบผมคงตอบว่าหลายรอบมาก ในความคิผมตอนแรกคือมันก็ไม่เป็นแอฟที่ยากอะไรมากมายแต่เอาข้อมูลที่ได้มาเอามาจัดเรียงให้อยู่ในรูปแบบที่เราต้องการแค่นั้นเองจะไปยากอะไร ด้วยความคิดแบบนี้ผมก็ทำไปเรื่อยจนมันเริ่มเละ แล้วก็แก้ใหม่ แล้วก็ยอมแพ้สุดท้ายก็ ช่างมันเหอะไม่ทำดีกว่าเสียเวลา",
      "slug": "earthquake-detect-history",
      "detail": "<h2 id=\"ในที่สุดผมก็ทำมันเสร็จ-แสดงว่าผมทำได้\">ในที่สุดผมก็ทำมันเสร็จ! แสดงว่าผมทำได้</h2>\n<p>ถ้าถามว่าแอฟนี้ผมทำมากี่รอบผมคงตอบว่าหลายรอบมาก ในความคิดผมตอนแรกคือมันก็ไม่ได้เป็นแอฟที่ยากอะไรมากมาย แค่เอาข้อมูลที่ได้มาเอามาจัดเรียงให้อยู่ในรูปแบบที่เราต้องการแค่นั้นเองจะไปยากอะไร ด้วยความคิดแบบนี้ผมก็ทำไปเรื่อยๆ จนมันเริ่มเละ แล้วก็แก้ใหม่ แล้วก็ยอมแพ้สุดท้ายก็ <strong>ช่างมันเหอะไม่ทำดีกว่าเสียเวลา</strong></p>\n\n<p>ต้องบอกที่มาของแอฟนี้ก่อน แรงบันดาลใจจริงๆคืออยากจะทำอะไรสักอย่างที่เป็นชิ้นเป็นอันพยายามคิดว่าจะทำเงินได้อย่างไรเป็นอันดับแรก พอเรามีความคิดแบบนี้เป็นตัวตั้งต้นเราก็จะถูกจำกัดความกว้างของไอเดีย เราจะคิดอะไรได้แคบลงไป <strong>อ๋อง</strong> คือเพื่อนผมตั้งแต่มัธยม อ๋องทำแอฟไอโฟนชื่อว่า <a href=\"https://itunes.apple.com/us/app/iearthquake-lite/id382275734?mt=8\">iEarthquake</a> ด้วยความที่เรามีความรู้ทางด้านนี้แกก็พยายามให้ผมแอฟอยู่สม่ำเสมอ</p>\n\n<h2 id=\"ขี้เบื่อ--ดูถูกตัวเอง\">ขี้เบื่อ + ดูถูกตัวเอง</h2>\n\n<p>หลายๆแอฟที่เริ่มคิดกันยอมรับว่าเราสองคนมีไอเดียเยอะมากจนกระทั่งไม่ได้ทำสักแอฟ (ฮา) เพราะผมชอบยอมแพ้และขี้เบื่อบ่อยๆ จนผมลาออกงานประจำจึงมีเวลากลับมาคิดถึงเรื่องนี้บ่อยๆ จนกระทั่งแผ่นดินไหนครั้งรุนแรงที่ชิลิ ประมาณแมคนิจูด 8.0 อ๋องก็บอกผมอีกครั้งว่าวันนี้วันเดียวเขาทำรายได้เยอะมาก ผมเริ่มตาโตละ</p>\n\n<p>ผมเลยจับ iEarthquake มาลง Android โดยผมใช้ Cordova พัฒนาออกมาได้นิดหน่อยผทก็เริ่มเปลี่ยนไปเปลี่ยนมา Angular.js บ้าง backbone.js บ้างเปลี่ยนไปเรื่อยๆ ไม่จบสักทีสุดท้ายก็เบื่อทิ้งไปอีกละ ดูเหมือนงานนี้จะไม่สำเร็จอีกแล้ว</p>\n\n<h2 id=\"แรงกระตุ้นขนาด-61\">แรงกระตุ้นขนาด 6.1</h2>\n<p>เมื่ออาทิตย์ที่แล้วมีแผ่นดินไหวครั้งรุนแรงขนาด 6.1 ที่เชียงรายซึ่งผมก็นั่งทำงานไปนี่แหละโต๊ะมันก็สั่นตามประสาแผ่นดินไหว เป็นปรกติของทุกคนก็แชร์กัน คราวนี้อ๋องแชร์บ้างแกก็แชร์ภาพแอฟ iEarthquake ออกมาซึ่ง ณ ตอนนั้นก็ยังไม่มีใครทราบว่าศูนย์กลางแผ่นดินไหวอยู่ที่ไหน ขนาดเท่าไหร่ มีแต่แอฟพวกนี้เท่านั้นที่บอกข้อมูลได้ทันที ในที่สุดอ๋องติดต่อมา ซึ่งผมก็อยากให้เป็นเช่นนั้น</p>\n\n<h2 id=\"สิ่งที่เราคิดบางครั้งเรามโนเอาเอง\">สิ่งที่เราคิดบางครั้งเรามโนเอาเอง</h2>\n<p>ผมคิดเสมอว่าใครจะใช้วะแอพแบบนี้ คำตอบคือทุกคนในโลกเพราะแผ่นไหวมันเกิดตลอด รู้สึกหรือไม่มันอีกเรื่องซึ่งเมื่อเกิดบ่อยๆที่ไหนก็เป็นข้อมูลที่เราใช้ตัดสินใจเวลาเราจะไปเที่ยวหรือทำธุระใกล้ๆจุดเกิดเหตุ ผมเริ่มวิเคราะห์ดูแล้วว่าคนใช้เยอะจริงเพราะแผ่นดินไหวทีแชร์หน้าจอโทรศัพท์กันสนั่น จากที่คิดว่าไม่น่าจะมีคนใช้จนเข้าใจว่า <strong>มีคนเปิดแอพพวกนี้ดูตลอดเวลา</strong></p>\n\n<h2 id=\"กูต้องทำได้-วลีเด็ดจนสำเร็จ\">กูต้องทำได้ วลีเด็ดจนสำเร็จ</h2>\n<p>ทีนี้ผมเริ่มทำจริงจังละ เริ่มใหม่ตั้งแต่ต้นหาข้อมูลในเนตไปเรื่อยๆ แก้แล้วแก้อีกเหมือนเดิมแต่มันเริ่มดีขึ้น บางครั้งก็กลับมามีความคิดแบบเดิมอยากจะเลิกอีกละ แต่ตะคอกใส่ตัวเองเสมอ <strong>กูต้องทำได้</strong> สุดท้ายมันก็ออกมาเป็นแอฟจริงๆ แทบไม่น่าเชื่อว่าคนอย่างผมก็ทำได้เหมือนกัน ถึงมันจะตะกุกตะกักบ้าง อาจจะเป็นแอฟแรกที่ไม่ค่อยมี Performance สักเท่าไหร่แต่โดยรวมก็ถือว่าดี หล่อ จี๊ด และแค่ติดโฆษณาแค่นั้น 1 วันทำเงินให้ผมละ อาาาาห์ เปลี่ยนความคิดความมโนของผมเองไปอย่างสิ้นเชิง</p>\n\n<h2 id=\"ท้อ-เบื่อ-ขี้เกียจ-แต่ต้องกลับมาทำ\">ท้อ เบื่อ ขี้เกียจ แต่ต้องกลับมาทำ</h2>\n<p>หากเราไม่มีกระจิตกระใจจะทำมัน ก็พักสักหน่อย หากาแฟทานสักแก้ว พยายามดึงตัวเองกลับเข้ามาวงโคจรให้ได้ อย่าตามใจตัวเองมากเกินไป อย่ายอมแพ้ทุกอย่างอยู่ไม่ไกลเกินเอื้อมและที่สำคัญสุดๆ <strong>อย่ามโนเอาเอง</strong> ถ้ายังไม่ได้เห็น หรือสัมผัส</p>\n\n<p>เชิญเอาไปสดับกันครับ <a href=\"https://play.google.com/store/apps/details?id=com.maximize.earthquake\">Earthquake Detects</a> <strong>เก่งไม่กลัว กลัวคนไม่ยอมแพ้</strong></p>\n"
    }
    ,
    {
      "title": "Why you're bad PHP programmer",
      "link": "/2014/02/whay-youre-bad-php-programmer.html",
      "image": "https://farm6.staticflickr.com/5507/12450834123_41478d00b6_o.jpg",
      "content": "จำได้ว่าเมื่อเดือนสองเดือนก่อนผมอ่านไปเจอบทความหนึ่งที่อธิบายถึงคุณลักษณะที่แย่ๆ ของ PHP Programmer ในเว็บไซต์หนึ่ง เลยอยากเอามาเล่าให้ได้ฟังว่าอะไรกันที่ทำให้เรากลายเปนโปรแกรมเมอร์ที่แย่ๆ คุณลักษณะเหล่านี้แหละที่จะทำให้เราติดนิสัย และไม่ดีนักหากเราทำงานเป็นทีม",
      "slug": "whay-youre-bad-php-programmer",
      "detail": "<p>จำได้ว่าเมื่อเดือนสองเดือนก่อนผมอ่านไปเจอบทความหนึ่งที่อธิบายถึงคุณลักษณะที่แย่ๆ ของ PHP Programmer ในเว็บไซต์หนึ่ง เลยอยากเอามาเล่าให้ได้ฟังว่าอะไรกันที่ทำให้เรากลายเปนโปรแกรมเมอร์ที่แย่ๆ\nคุณลักษณะเหล่านี้แหละที่จะทำให้เราติดนิสัย และไม่ดีนักหากเราทำงานเป็นทีม</p>\n\n<h3 id=\"ไม่เคยแพลนก่อนเขียนโค๊ด\">ไม่เคยแพลนก่อนเขียนโค๊ด</h3>\n<p>การคิดการก่อนทำนั้นเป็นสิ่งที่เสมอ เหมือนกับการเดินทางถ้าเราไม่วางแผนก่อนทำก็เหมือนเราสุ่มไปข้างหน้าบางทีอาจจะทำให้เราหลงทางและเสียเวลา การเชียนโค๊ดโดยปราศจากการวางแผนจะทำให้เราเสียเวลา\nและต้องเขียนๆ แก้ๆ ทำให้เกิดความสับสนบางครั้งอาจให้ให้เกิดความผิดพลาดได้ง่าย</p>\n\n<h3 id=\"ไม่เคยคอมเมนต์\">ไม่เคยคอมเมนต์</h3>\n<p>การทำงานเป็นทีม หรือแม้การทำงานคนเดียวการคอมเมนต์เป็นอะไรที่สำคัญและจำเป็นอย่างมาก เพราะทุกครั้งที่เรากลับมาอ่านโค๊ดเราจะได้รู้ว่าตรงนี้ทำอะไรหรือตัวแปรนี้เก็บอะไร หากเรากลับมาอ่านโค๊ดโดยไม่มีคอมเมนต์\nคุณจะต้องกลับไปหาว่าส่วนนี้มาจากไหน ส่วนนี้กำลังทำอะไรอยู่ ต้องไล่แกะไล่อ่านทีละบรรทัด มันแย่มาก</p>\n\n<h3 id=\"เขียนโค๊ดไม่สะอาด-ไม่เป็นระเบียบ\">เขียนโค๊ดไม่สะอาด ไม่เป็นระเบียบ</h3>\n<p>อีกเรื่องหนึ่งที่สำคัญไม่แพ้กัน ทุกครั้งที่คุณเขียนโค๊ดแบบช่างมัน อันนี้แย่มาก การเว้นช่องว่าง (space) ในแต่ละ condition หรือแม้แต่การเว้นบรรทัดเพื่อให้โค๊ดดูเป็นระเบียบอ่านง่ายนั้นทำได้ไม่ยากเลย คุณอาจจะเสียเวลา\nไปเพียงแค่ 1- 3 วินาที รวมไปถึงการตั้งชื่อตัวแปรสมมุติหากคุณตั้งชื่อ <code>$a</code> เราจะเดายากมากว่าตัวแปรนี้เก็บอะไร จะดีไม่น้อยหากเราเปลี่ยนเป็น <code>$employees</code> นั่นทำให้เราเดาได้ง่ายกว่าตัวแปรนี้เก็บค่าอะไรอยู่</p>\n\n<h3 id=\"coding-standard\">Coding Standard</h3>\n<p>การเขียนโค๊ดให้เป็นไปตามมาตรฐานสากลเป็นสิ่งที่โปรแกรมเมอร์พึงกระทำเป็นอย่างยิ่ง โค๊ดของคุณจะมีระเบียบ อ่านง่าย และที่สำคัญทุกคนส่วนใหญ่บนโลกใบนี้ต่างก็เขียนไปในทางเดียวกัน มันทำให้ง่ายเวลาคุณมีปัญหาเกี่ยวกับการเขียนโปรแกรมและต้องการให้คนอื่นบนโลกออนไลน์\nหรือแม้แต่เพื่อนคุนเองช่วยแก้ไข เมื่อเขียนไปในทางทิศเดียวกันก็ไม่ยากที่จะเข้าใจโค๊ดของคุณ และเข้าใจปัญหาที่เกิดขึ้นได้ง่ายอีกด้วย</p>\n\n<h3 id=\"เขียนโค๊ดซ้ำไปซ้ำมา\">เขียนโค๊ดซ้ำไปซ้ำมา</h3>\n<p>โค๊ดที่ใช้ซ้ำๆ ควรจะออกแบบให้มีการเขียนเพียงครั้งเดียวและเรียกใช้เอาจากหลายๆที่ จะทำให้เราไม่ต้องเสียเวลาเขียนอะไรที่มันมีอยู่แล้วและง่ายต่อการแก้ไขโดยไม่ต้องไปไล่หาว่าผิดพลาดตรงไหน</p>\n\n<h3 id=\"ไม่เคยเรียนรู้สิ่งใหม่ๆ\">ไม่เคยเรียนรู้สิ่งใหม่ๆ</h3>\n<p>โลกนี้หมุนไปเร็วมาก มีโปรแกรมเมอร์ใหม่ๆเกิดขึ้นมากมาย หลายคนก็หลายความคิดมักจะมีไอเดียดีๆ หรือเทคโนโลยีดีๆให้เราได้ซึมซับเก็บเกี่ยวยู่เสมอ หากเราพลาดในส่วนนี้ไปงานของคุณก็จะกลายเป็นงานที่ล้หลังไปโดยปริยาย</p>\n\n<h3 id=\"ทำทุกอย่างด้วยตัวเองทั้งหมด\">ทำทุกอย่างด้วยตัวเองทั้งหมด</h3>\n<p>อยากที่ได้เกริ่นไปในหัวข้อที่แล้ว โลกนี้มีอะไรที่เขาทำไว้อยู่แล้วไม่ว่าจะเป็นตัวอย่างการเขียนโค๊ดในหลายๆส่วน เราเพียงแค่ทำความเข้าใจศึกษาปรับปรุงวิธีการพัฒนาเรียนรู้จากตัวอย่าง ยกตัวอย่างเช่นหากคุณต้องทำเว็บไซต์ที่มีระบบเว็บบอร์ด\nคุณเองจะใช้ opensource หรือเขียนเองขึ้นมาใหม่ทั้งหมด?</p>\n\n<h3 id=\"ไม่แชร์ประสบการณ์-หรือเปิดรับอะไรใหม่ๆ\">ไม่แชร์ประสบการณ์ หรือเปิดรับอะไรใหม่ๆ</h3>\n<p>ทางที่ดีที่สุดในการพัฒนาตัวเองและปรับปรุงตัวเองคือการแชร์ประสบการณ์กับผู้อื่น คุณเองอาจจะได้อะไรกลับมาเพื่อพัฒนาและปรับปรุงตัวเอง ในทางกลับกันโปรแกรมเมอร์คนอื่นก็จะได้ประสบการณ์ของคุณเองไปพัฒนาฝีมือของเขา\nการแชร์ประสบการณ์เป็นสิ่งที่ดี และควรทำหากคุณเองเป็นโปรแกรมเมอร์</p>\n\n<p>ที่ผมกล่าวมาข้างต้นเป็นเพียงส่วนหนึ่งของโปรแกรมเมอร์ที่ไม่น่าคบ ลองไปอ่านบทความเต็มๆได้ที่นี่เลยครับ <a href=\"https://code.tutsplus.com/tutorials/why-youre-a-bad-php-programmer--net-18384\">Why You’re a Bad PHP Programmer</a></p>\n"
    }
    ,
    {
      "title": "Bootstrap 3.1.0 Released",
      "link": "/2014/02/bootstrap-3-1-0-released.html",
      "image": "https://farm4.staticflickr.com/3726/12344131464_7ae8a2216c_o.jpg",
      "content": "เมื่อสิ้นเดือนมกราคมที่ผ่าน Bootstrap ได้อัพเดทตัวใหม่ออกมาแบบเงียบๆ หรือเปล่าไม่รู้โดยที่ผมไม่รู้เรื่องเลย ฮา ทั้งเปลี่ยนหน้าเว็บใหม่ เปลี่ยน Document ใหม่และมีอะไรหลายๆอย่างเพิ่มเข้ามามากมายในเวอร์ชั่น 3.1.0 นี้ลองมาดูกันครับว่ามีอะไรใหม่ๆเพิ่มเข้ามาบ้าง",
      "slug": "bootstrap-3-1-0-released",
      "detail": "<p>เมื่อสิ้นเดือนมกราคมที่ผ่าน <a href=\"https://getbootstrap.com\">Bootstrap</a> ได้อัพเดทตัวใหม่ออกมาแบบเงียบๆ หรือเปล่าไม่รู้โดยที่ผมไม่รู้เรื่องเลย ฮา\nทั้งเปลี่ยนหน้าเว็บใหม่ เปลี่ยน Document ใหม่และมีอะไรหลายๆอย่างเพิ่มเข้ามามากมายในเวอร์ชั่น 3.1.0 นี้ลองมาดูกันครับว่ามีอะไรใหม่ๆเพิ่มเข้ามาบ้าง</p>\n\n<h3 id=\"sass--less\">SASS &amp; LESS</h3>\n<p>ในเวอร์ชันใหม่นี้้ Bootstrap ซัพพอร์ทั้ง <a href=\"https://sass-lang.com\">SASS</a> และ <a href=\"https://lesscss.org/\">LESS</a> ชอบแบบไหน รักตัวไหนเอาไปเล่น\nกันได้ตามใจชอบ</p>\n\n<h3 id=\"new-documents\">New documents</h3>\n<p>รูปแบบของ Docs เปลี่ยนเไปเยอะเลยครับดูโล่งๆ สบายอ่านง่ายเหมือนเช่นเคย</p>\n\n<h3 id=\"modal\">Modal</h3>\n<p>สำหรับตัว Modal หรือที่เราเรียกกันว่าป๊อบอัพ เดี๋ยวนี้สามารถปรับเปลี่ยนขนาดได้แล้วนะครับ อันนี้เป็นปัญหาของผมตั้งแต่แรกเลยเพราะงานที่ผมทำอันก่อน มีการใช้\nForm ข้างใน Modal อีกทีหนึ่งซึ่งผมคิดว่าอันเดิมมันเล็กไป</p>\n\n<h3 id=\"form-validation\">Form Validation</h3>\n<p>เพิ่มสีเข้ามา 3 สีสำหรับการสร้าง Form Validate พร้อมทั้งมีไอคอนเพิ่มเข้ามาให้อีกด้วยครับ สวยงามครับ</p>\n\n<h3 id=\"template\">Template</h3>\n<p>เพิ่มเทมเพลตมาให้ใหม่สามตัวครับ สะดวกรวดเร็วมีเทมเพลตแบบ <code>Blog</code>, <code>Dashboard</code> และ <code>Cover</code> <a href=\"https://getbootstrap.com/getting-started/#examples\">ดูเทมเพลต</a></p>\n\n<p>ยังมีอีกมากมายที่ผมอธิบายไม่หมด ลองไปดูของจริงกันเลยครับ</p>\n\n<ul>\n  <li><a href=\"https://blog.getbootstrap.com/2014/01/30/bootstrap-3-1-0-released/\">Official Bootstrap Blog</a></li>\n  <li><a href=\"https://github.com/twbs/bootstrap/releases/tag/v3.1.0\">New Features in 3.1.0</a></li>\n  <li><a href=\"https://getbootstrap.com/getting-started/\">Documents</a></li>\n</ul>\n"
    }
  ]
  ,"next": "/api/feed-14.json"
  
  ,"prev": "/api/feed-12.json"
  
}