{
  "pages": [
    
    {
      "title": "Columbia Trail Master XI",
      "link": "/2016/06/columbia-trail-master.html",
      "image": "https://bestrangers.files.wordpress.com/2016/07/13679878_1354592691223619_565021592797499983_o.jpg",
      "content": "วิ่งอัลตร้าเทรล (ระยะที่มากว่ามาราธอน) คือระยะที่นักวิ่งที่เคยวิ่งจบมาราธอนส่วนใหญ่ปราถนาที่จะจบให้ได้ ไม่ว่าจะเป็น 50km, 100km หรือมากกว่านั้นแล้วแต่เป้าหมายของแต่ละคน ซึ่งผมเองก็เช่นกันเมื่อจบมาราธอนแล้วระยะที่ผมอยากจะทำให้ได้นั่นก็คือ 100km แต่ก่อนที่จะไปถึงตรงนั้น จำเป็นต้องผ่าน 50km ให้ได้ซะก่อน และผมก็เลือก Columbia Master Trail สนามนี้เป็นอัลตร้าแรกของตัวผม",
      "slug": "columbia-trail-master",
      "detail": "<p>วิ่งอัลตร้าเทรล (ระยะที่มากว่ามาราธอน) คือระยะที่นักวิ่งที่เคยวิ่งจบมาราธอนส่วนใหญ่ปราถนาที่จะจบให้ได้ ไม่ว่าจะเป็น 50km, 100km หรือมากกว่านั้นแล้วแต่เป้าหมายของแต่ละคน ซึ่งผมเองก็เช่นกันเมื่อจบมาราธอนแล้วระยะที่ผมอยากจะทำให้ได้นั่นก็คือ 100km แต่ก่อนที่จะไปถึงตรงนั้น จำเป็นต้องผ่าน 50km ให้ได้ซะก่อน และผมก็เลือก Columbia Master Trail สนามนี้เป็นอัลตร้าแรกของตัวผม</p>\n\n<p>Columbia Master Tail สนามนี้เป็น Episode 11 แล้วนะครับแต่นี่เป็นครั้งของผมที่วิ่งในรายการนี้ จัดที่อำเภอหนองใหญ่จังหวัดชลบุรี ไม่ใกล้ไม่ไกลจากบางกอก แต่ไกลจากเชียงใหม่ซึ่งผมขับรถไป และด้วยการที่ AMA Event คือผู้จัดก็เตรียมใจไว้แล้วว่างานนี้ต้องออกมาดีในระดับหนึ่งอย่างแน่นอน</p>\n\n<p>สนามเทรลที่สองของผมหลังจากเขาประทับช้างเมื่อเดือนที่ผ่านมาซึ่งใช้เป็นสนามซ้อมเพื่อมายังสนามนี้แต่สนามที่ผ่านมาก็ไม่ได้มีอะไรน่าตื่นเต้นสักเท่าไหร่แต่ก็สนุกดี และสนามนี้จึงไม่กังวลและมั่นใจว่าจบแน่นอน พร้อมทั้งเป้าหมายของผม Top 100 ให้ได้ในใจก็หวั่นๆ เพราะว่าสนามนี้รวมอีลิทเลยก็ว่าได้ครับ</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/07/13612286_1317035608325991_1237049583144100108_n.jpg\" alt=\"\" /></center>\n\n<h3 id=\"วันรับ-bib\">วันรับ BIB</h3>\n\n<p>เดินทางมาถึงที่หนองใหญ่พร้อมกับทีมเดอะแก๊ง รู้สึกได้เลยว่าการขับรถเพื่อมาแข่งวิ่งแบบนี้ไม่สมควรเป็นอย่างยิ่ง ความอ่อนเพลียและความง่วงเป็นตัวฉุดร่างกายและพลังของตัวเอง (ผิดพลาดข้อที่ 1) ผมได้รับ BIB เรียบร้อยแล้วก่อนเดินทางประมาณ 2 ชั่วโมงเองเกือบไม่ทันน่ะสิครับไม่รู้ว่าไปรษณีย์ไทยชอบดองพัสดุไว้ที่ลำพูน 1 คืนแย่จังเกือบไม่ทัน</p>\n\n<p>สิ่งแรกที่ผมต้องทำคือเปลี่ยนชื่อ และรายละเอียดของ BIB ครับ BIB นี้ผมได้มาจากพี่ Eric ของทีม ประหยัดรันนิ่ง พร้อมกับเสื้อเบอร์ 2XL ซึ่งเป็นไซต์ของพี่ Eric ลองใส่ดูเหมือน HipHop เลย การจัดงานของ AMA นั้นดีตรงที่ว่าเราสามารถเปลี่ยนรายละเอียดได้ครับ ผมก็จัดแจงเปลี่ยนชื่ออะไรต่างๆ ที่เกี่ยวของกับเลข BIB นี้พร้อมทั้งรอเปลี่ยนเสื้อในวันรุ่งขึ้น เปลี่ยนได้ทุกอย่างจริงๆ</p>\n\n<p>ที่งานมีของกิน และบู๊ทขายของมากมายเลือกซื้อเลือกหาในราคาพิเศษกันตามสบายส่วนผมอุปกรณ์ทุกอย่างเตรียมไว้หมดแล้วก่อนวันแข่งเหลือแค่ถุงเท้าคู่เดียวที่มาซื้อในงานคือถุงเท้า DryMax</p>\n\n<p>ที่เหลือก็ไปจัดการเรื่องห้องพักที่จองไว้กับเดอะแก๊งใกล้ๆงาน และทำธุระส่วนตัวต่างๆ ก่อนที่จะพักผ่อนจัดแจงเตรียมอุปกรณ์ที่ใช้ในการแข่งขัน และกำหนดนัดแนะกับทีมเรื่องเวลาที่จะไปสนามรวมถึงเวลากลับ</p>\n\n<h3 id=\"วางแผนการวิ่ง\">วางแผนการวิ่ง</h3>\n\n<p>ช่วงก่อนวันวิ่งประมาณสองสามวันเป็นช่วงที่ผมกำลังคิดอยู่ว่าจะวางแผนการวิ่งยังไงดี ตอนนี้ที่มีอยู่ในมือคือกราฟความชันและแผนที่ของเส้นทางวิ่ง และต้องขอบคุณสมาชิกในกลุ่ม Ultra &amp; Trail Runners ที่แบ่งปันไฟล์ Excel เพื่อเอาไว้คำนวณเวลาและ ระยะทางระหว่างจุดให้น้ำและความชัน</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/07/13590305_1348059258543629_8623448142085191237_n.jpg?w=736\" alt=\"\" /></center>\n\n<p>หากดูตามแผนที่ด้านบนจะมีจุดบริการน้ำดื่มทั้งหมดอยู่ 9 จุดแต่จุดที่สำคัญ 2 จุดคือ WS7 และ WS8 ครับเพราะสองจุดนี้เป็นจุด cut off ถ้าไปไม่ถึงตามเวลาที่กำหนดจะถูกให้ออกจากการแข่งขันหรือ DNF นั่นเองครับ แต่เท่าที่ดูกราฟความชันและระยะทางผมประมาณตัวเองได้ว่าทันแน่นอนครับ</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/07/screen-shot-2559-07-12-at-12-12-20-pm-copy-min.jpg?w=736\" alt=\"\" /></center>\n\n<p>ทีนี้ก็มาคำนวณเส้นทางวิ่งและประมาณความเร็วและเวลาโดยใช้การวิ่งที่ผ่านมาเป็นตัววัดกันครับ เนื่องจากเราไม่ได้ไปลองสนามจริงทุกอย่างจะเป็นการประเมิณตนเองจากการวิ่งที่ผ่านมา ช่วงแรกมั่นใจเก็บ Pace 5 ได้แน่นอนเพราะไม่ค่อยชันเท่าไหร่สามารถวิ่งได้สบายๆ แน่นอน ส่วนช่วงที่เหลือผมประเมิณตนเองจากระดับความและความสามารถในการวิ่งของตนเองโดยใช้ความชันของเส้นทางดอยสุเทพ(เทรล)เข้ามาเทียบ แล้วก็ได้เวลาออกมาตามที่เห็นในภาพซึ่งเวลารวมประมาณ 476.1 นาที หากนับเป็นชั่วโมงก็ประมาณ 7:56 ชั่วโมง สุดท้ายแล้วผมอ่านและก็วางไปเพราะคิดว่าคงทำได้ตามนี้ยากเนื่องจากฝนตกหนักมาก</p>\n\n<h3 id=\"เตรียมอุปกรณ์-gear-check\">เตรียมอุปกรณ์ Gear Check!</h3>\n\n<p>ผมวางแผนและเตรียมสิ่งที่จะต้องเอาไปด้วยกับการวิ่งตั้งแต่เนิ่นๆ เลยทีเดียวไม่อยากจัดหาช่วงวันสุดท้ายให้วุ่นวายเพราะต้องไปทำงานและตีรถไปกทม.ตอนบ่ายวันศุกร์ของที่เตรียมไปก่อนก็จะมี Saltstick อันนี้หาซื้อยากหน่อยผมได้มาเป็นแบบแคปซูล แบบเม็ดอมจะหายากหน่อยแต่ส่วนใหญ่เราสามารถไปซื้อที่หน้างานได้ แต่ผมไม่อยากไปหวังเอาน้ำบ่อหน้าจัดไปก่อนเลย 6 แคปซูล คำนวณไว้ว่าจะกินทุกๆ 10 กิโลเมตรก็จะอยู่ที่ประมาณ 5 แคปซูลแต่เผื่อเหลือเผื่อขาด 1 แคปซูล</p>\n\n<p>เจลผมเลือกใช้ของไทยยี่ห้อ Dever ยังไม่เคยใช้ยี่ห้อนี้แต่อยากลองเอาไป 5 ซองและคำนวณไว้ว่ากินทุกๆ 10 กิโลเมตรเช่นกัน และก็จะมีเป้นำ้ถุงประจำของผม ถุงเท้าเลือกใช้ DryMax จำนวน 2 คู่แพลนเอาไว้ว่าจะเปลี่ยนตอนกิโลเมตรที่ 25</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/07/13631458_1317228371640048_6154340623919618368_n.jpg\" alt=\"\" /></center>\n\n<p>ก่อนวันแข่งมีสิ่งที่เพิ่มเข้ามาอีกหลายอย่าง(ความพิดพลาดข้อที่ 2) ซึ่งไม่สมควรเลยที่จะเพิ่มสิ่งที่เอาไปด้วยสิ่งที่ผมเอาติดตัวไปแต่ไม่ได้ใช้และคิดไว้ก่อนแล้วว่าไม่จำเป็นแน่นอนแต่ก็ยังเอาไปคือ เสื้อกันฝนกะจะเอาไปใส่ตอนฝนตก(คิดอะไรอยู่) ไม่รู้ว่าอะไรมาสะกิดให้ไปซื้อเสื้อกันฝนที่ 7-11 แล้วเอาติดตัวไปด้วยแต่ยังดีที่ไม่ตก กระดาษทิชชู่เปียก อันนี้สำหรับหลายๆคนอาจจะมีประโยชน์กรณีปวดตอนวิ่ง แต่ระบบขับถ่ายผมเป็นปรกติและไม่เคยมีปัญหาสรุปเอาไปแบบไม่มีประโยชน์</p>\n\n<p>ทั้งหมดคือสิ่งที่ผมเอาติดตัวและครั้งต่อไปจะไม่เยอะแบบนี้อีกแล้ว</p>\n\n<h3 id=\"สภาพสนามและเริ่มวิ่ง\">สภาพสนามและเริ่มวิ่ง!!!</h3>\n\n<p>ไม่เคยลองสนามจริง ไม่รู้สภาพภูมิศาสตร์ของพื้นที่เท่าที่มีก่อนแข่งคือกราฟความชัน และภาพที่เห็นจากเพจของ AMA เท่านั้นครับแต่พอตอนตีสองฝนหระหน่ำแบบบ้าระห่ำในใจติดไว้ว่า “เละแน่นอน”</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/07/13662272_1319897334706485_5215829130527267986_o.jpg?w=736\" alt=\"\" /></center>\n\n<p>สนามช่วงแรกยังเห็นเป็นคอนกรีตยาวๆ ตอนนี้นักวิ่งทุกคนยังไม่รู้ชะตากรรมตัวเองว่าจะต้องเจอกับอะไรข้างหน้าเดาไม่ออกรู้แต่เพียงว่าเละแน่นอน พอสิ้นเสียงปล่อยตัวก็ลั่นล้าวิ่งกันออกไปยังกะแข่งวิ่งถนน Pace 3 – 4 – 5 ก็ว่ากันไปและทันทีที่เห็นลูกศรเลี้ยวซ้ายแรกเข้าป่าสวนปาล์มยังกระดี้กระด้ากันอยู่ ผมเองก็คิดในใจว่ามันไม่ได้เละอย่างที่คิดแฮะ</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/07/13662188_250019508718727_6372245489355031285_o.jpg?w=736\" alt=\"\" /></center>\n\n<p>ทางช่วงแรกก็เป็นหญ้ากับโคลนเล็กๆ น้อยๆ ไม่ได้แย่มากมายอะไรวิ่งกันไปเรื่อย ตอนนี้ทุกคนยังเกาะ Pace 4-5 กันต่อไป พอหมดสวนปาล์มตอนนี้ก็กลายเป็นทางขึ้นแล้วครับหากลองดูตามแผนที่ความชันจะมีทางขึ้นเล็กๆ ไม่ถึงกับมาก แต่ที่สร้างความแปลกใจให้กับทุกคนคือมันมีโคลนครับ</p>\n\n<p>ช่วงนี้พยามยามจิกเท้ากันขึ้นไปนึกว่าจะง่าย ที่ไหนได้ลื่นสิครับบางคนก็ล้ม บางคนก็ไถลลงมากันเลยที่เดียว พระเอกของงานนี้กลายเป็นรองเท้าของผมเอง Salomon ด้วยความที่มีปุ่มตรงพื้นรองเท้าเรื่องเกาะนี่ไม่ต้องพูดถึงครับ วิ่งขึ้นได้สบายๆ หลายครั้งที่จอดช่วยคนอื่นด้วยรู้สึกว่าเลือกรองเท้าถูกสนาม</p>\n\n<p>หมดช่วงดินเหนียวเข้าสู่ WS1 พักกินน้ำสักแป๊บแล้วก็วิ่งต่อไป ที่นี้เริ่มเป็นทางขึ้นมากกว่าเดิมแล้วครับ ทางขึ้นที่มาพร้อมๆกับโคลนและแอ่งน้ำ หลายๆคนเริ่มช้าลงทำให้ผมมีโอกาสแซงขึ้นไปเรื่อยๆ ตอนนี้แผนของผมคือพยายามเดินเร็วในช่วงที่ขึ้นเนิน รักษา Pace ให้ได้ไม่เกิน 15 เพราะผมไม่รู้ว่าทางช้างหน้านั้นจะเป็นอย่างไร</p>\n\n<p>เริ่มเป็นทางเข้าในป่าลึกวิ่งเรียบสันเขาตรงจังหวะนี้ทางด้านขวาจะมีหมอก หรือเมฆฝน น่าจะเป็นเมฆฝนมากกว่า อากาศเย็นพอสมควรทางขึ้นเริ่มลดลง ทำความเร็วได้ดีขึ้นช่วงนี้ยาวประมาณ 2 กิโลเมตร</p>\n\n<p>เริ่มขึ้นมาบนยอดเขาลูกแรกทางต่อไปเป็นการวิ่งเรียบเนินไปเรื่อยๆ ช่วงนี้เป็นหญ้าสูงวิ่งเลาะหญ้าไปเรื่อยตอนนี้รองเท้าผมเริ่มเปียกจนรู้สึกได้ สิ่งนี้คือสิ่งที่ผมไม่อยากให้มันเกิด และพยายามหาวิธีป้องกันตลอดเวลา ถุงเท้า DryMax ช่วยได้ในระดับหนึ่งเท่านั้น</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/07/13731773_1321069537922598_6981831096618273704_o.jpg?w=736\" alt=\"\" /></center>\n\n<p>เข้าป่าอีกครั้งคราวนี้เป็นทางขึ้นเนินลงเนินเป็นทางที่รถยนต์สามารถวิ่งเข้ามาได้มีแอ่งน้ำเรื่อยๆ เหมือนเดิมสิ่งที่แย่ตอนนี้ข้อเท้าขวาผมเริ่มเจ็บนิดๆ ภาวนาไม่ให้เจ็บมากเกินไปกว่านี้ ตอนนี้ทางขึ้นผมยังคงเดินเหมือนเดิม ส่วนทางลงและทางเรียบก็ค่อยวิ่งเอา</p>\n\n<h3 id=\"รองเท้าเปียก\">รองเท้าเปียก</h3>\n\n<p>มาถึง WS3 ช่วงระหว่าง WS2 – 3 ห่างกันประมาณ 7 กิโลเมตรตรงนี้ผมคิดว่าจะมีแตงโมหรือกล้วยเอาไว้ให้กินดับกระหาย ปรากฏว่าไม่มียังแต่เจลแจกให้นักวิ่งตอนนี้ใครซื้อเจลคงเสียดายตังน่าดูหยิบเจลมาหนึ่งซองนั่งลงถอดรองเท้า และถุงเท้า พยายามบิดเอาน้ำออกจากถุงเท้า ด้วยความที่ DryMax  ไม่อมน้ำพยายามบิดเท่าไหร่ก็ไม่มีน้ำ ผมก็แปลกใจใส่รองเท้าแล้ววิ่งต่อไป</p>\n\n<p>วิ่งออกมาได้สักพักน้ำในรองเท้ามีอีกแล้วคราวนี้แปลกใจยิ่งกว่าเดิมเพราะบิดถุงเท้าแล้วน้ำมาจากไหน? ใช่ครับมันมาจากในรองเท้านั่นเอง รองเท้าเก็บน้ำดีเยี่ยมเลยครับ เอาน้ำออกจากรองเท้าไม่ได้เลย T-T ก็คงต้องจำใจวิ่งไปแบบนี้ เท่านั้นยังไม่พออาการเจ็บนิ้วเท้าเนื่องจากรองเท้าบีบอาการนี้ผมคิดไว้ว่ามันต้องเกิดขึ้น แล้วมันก็เกิดขึ้นมาจริงๆ ความซวยก็เริ่มมาเยือนเลยครับ</p>\n\n<p>ตอนนี้ทำได้อย่างเดียวคือหากเป็นทางวิ่งลงต้อพยายามไม่เร็วและเก็บนิ้วเท้า ตรงนี้เป็นส่วนที่ทำให้ความเร็วเราช้าลง วิ่งด้วยความกังวลตลอดทาง และยังคงวิ่งในที่แฉะไปเรื่อยๆ</p>\n\n<p>ทางตัดเป็นขึ้นอีกรอบคราวนี้ผ่าน  WS5 ไปสักแป๊บก็จะเป็นทุ่งหญ้ากว้างใหญ่ตรงนี้ต้องยอมรับว่าสวยจริงๆ สวยมากด้วยครับ (ลองดู Video ด้านล่าง) ยาวประมาณ 1 กิโลเมตรกว่าๆ วิ่งสนุกครับตรงนี้แต่หากรองเท้าไม่เปียกหรือเจ็บเท้าจะสนุกและฟินกว่านี้เยอะ</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/07/13613135_1319126284783590_8679721404663045450_o.jpg?w=736\" alt=\"\" /></center>\n\n<p>สุดทางทุ่งหญ้าจะตัดเป็นทางขึ้นแบบยาวทันทีครับตรงนี้ขึ้นานมากกก ไกลด้วยเดินไปตลอดครับมีช่วงหนึ่งที่เป็นทางเรียบพอวิ่งได้บ้างก็แค่ประมาณสั้นๆ เท่านั้นเอง หมดทางขึ้นก็จะตามถนนเข้าไปในป่าครับสักพักไปเจอรถของเจ้าหน้าป่าไม้จอดขวางทางอยู่ ทีนี้เราก็งงจะวิ่งไปทางไหนล่ะ? พอเห็นลูกศรชี้ไปทางด้านขวาเท่านั้นแหละครับ !!!</p>\n\n<h3 id=\"ลานหิน-จุดพีคสุดของสนามนี้\">ลานหิน จุดพีคสุดของสนามนี้</h3>\n\n<p>คราวนี้เจอทางชันที่เรียกว่าชันที่สุดของสนามนี้เลยก็ว่าได้ครับถ้าเทียบกับทางซ้อมที่เชียงใหม่ก็จะประมาณเทรลช่วงที่สองก่อนเจอโค้งขุนกันฑ์ แต่เดี๋ยว มันไม่ใช่แค่ไต่หรือวิ่งขึ้นไปนะสิ มันลื่นสถาพคือดินเหนียวเละๆ ซึ่งมีแต่รอยรองเท้าที่ลื่นกันไปมาเพราะ 25k ได้ผ่านจุดนี้ไปแล้วความเละจึงบังเกิด ด้วยอานุภาพของ Salomon Speedcross จึงพาตัวเองขึ้นไปข้างบนอย่างชิวๆ ไม่มีลื่น</p>\n\n<p>พี่เจ้าหน้าที่นั่งรออยู่ข้างบนบอกว่า “รองเท้านี่ดีเนาะซื้อมาเท่าไหร่ “ ไอ้เราก็บอกราคาให้ ปลายทางตอบมาว่า “ซื้อรองเท้ามาก็แพงแล้วยังมาเหนื่อยอีกเนาะ” แหม่ ไม่รู้ว่าเขาชมหรือด่า!</p>\n\n<p>ผ่านทางชันเลาะป่าขึ้นไปอีกนิดก็จะเจอลานหินน่าจะเป็นจุดสูงสุดของสนามนี้แล้ว นักวิ่งบางส่วนกำลังถ่ายรูปวิวกันอย่างสนุกสนาน มีบางส่วนปฐมพยาบาลเพราะตรงนี้เป็นจุดที่มีเจ้าหน้าที่อยู่ด้วย ผมใช้เวลาไม่นานที่ตรงนี้เพราะหิวข้าววววววว</p>\n\n<h3 id=\"ลงแบบเอียงๆ\">ลงแบบเอียงๆ</h3>\n\n<p>จากลานหินอันสวยงามและน่าหวาดเสียวตอนนี้ก็จะเข้าสู่ทางลงอย่างเป็นทางการ แต่…. มันไม่ได้ง่ายอย่างที่ผมคิดเอาไว้เลย ทางลงช่วงนี้เป็นดินเหนียวนุ่มน่าจะโอเคใช่ใหม? ไม่ครับ มันลงแบบเอียงๆ ครับ การวางเท้ายากลำบากมากหลายๆ คนลื่นแต่ผมไม่ลื่นเพราะรองเท้ามีดอกเกาะแต่ตรงนี้เสี่ยงข้อเท้าพลิกมากครับ ไม่สามารถวิ่งลง หรือลงแบบที่เคยทำได้เลย T-T กลัวตัวเองเองเจ็บที่สุดสักพักก็เริ่มมีอาการจริงๆ แต่ไม่มาก สนามนี้มีทุกรสชาติจริงๆ</p>\n\n<p>สวนปาล์ม สวนยาง และตีนเปล่า</p>\n\n<p>เมื่อผ่านทางลงมาก็เจอกับ WS8 ครับตรงนี้เป็นจุด Cut off ด้วยแต่อีกนานด้วยความหิวผมกินขนมปังโฮมมี่เยอะมาก ตรงจุดนี้มีพี่จาก Snail Gang อยู่กันกลุ่มหนึ่งทักทายล้อเล่นกันผมเริ่มไม่ค่อยสนุกกับรองเท้าผมแล้วและตอนนี้เหลืออีกประมาณเกือบ 10km สุดท้าย</p>\n\n<center>\n    <h4>ตัดสินใจถอดเกิบครับ</h4>\n</center>\n\n<p>ใช่ครับฟังไม่ผิด ถอดรองเท้าครับ ตอนนี้ผมไม่สนแล้วว่าถนนข้างหน้าเป็นอย่างไร ความรู้สึกแรกที่ปลดถุงเท้าออกจากเท้า อาาาาาห์ ช่างมีความสุขเหมือนคืนชีวิตใหม่ให้เท้า เหมือนขี้เสร็จใหม่ๆ สุขไหนจะเท่า ทุกคนเริ่มหันมามองผมไม่สนใจวิ่งออกจาก WS8 ทันที</p>\n\n<p>วิ่งบนถนนคอนกรีตนิดนึงแล้วเขาสวนยาง กับสวนปาล์มสลับกับดินในสวนก็เป็นใจให้อย่างมาก ไม่แข็งไม่มีหิน ไม่มีหนาม ผมสามารถกด Pace 6 ได้อย่างชิวๆ มีนักวิ่งเดินชมสวน ทอดน่องกันตรงนี้จำนวนมากพอสมควร ข้ามลำธารที่เด็กกำลังหาหินมากั้นน้ำ จับมือกับเด็กแล้วไปต่อ</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/07/13626409_1319897338039818_4395119949637451463_n.jpg\" alt=\"\" /></center>\n\n<p>WS9 แล้วก่อนเข้าเส้นใช้ล้างเท้าเอาโคลนออก ตอนนี้เริ่มติดใจในการวิ่งตีนเปล่าซะแล้ว ไม่พักครับดื่มน้ำแล้วไปต่อ ถนนวนสวนยางไปมาๆ จนมาโผล่ที่ถนนคอนกรีตสลับดินแข็ง นรกมาแล้วครับความรู้สึกเจ็บเท้ามาทันที พี่เจ้าที่มอเตอร์ครอสถึงกับต้องเอารถมาจอดถามอาการ แต่ผมยังไหวครับ ไม่แนะนำวิ่งตีนเปล่าบนถนนครับทรมาน</p>\n\n<p>เลี้ยวเข้าทางดินอีกครั้งโล่งไปจนมาโผล่อีกห้าร้อมเมตรสุดท้ายแต่เป็นคอนกรีตแม่เจ้า เจ็บตีนสิครับเจอพี่สัญญาเดินสวนมายกมือไหว้เอามือที่ถือรองเท้าเช็ดกางเกงเอาดินที่ติดมือออก แตะมือกับพี่สัญญาพร้อมถามว่าพี่เข้าที่เท่าไหร่ลุ้นให้ชนะแฮรี่ พี่สัญญาให้กำลังใจ วิ่งต่อดูนาฬิกาอีก 8 นาทีจะ 8 ชั่วโมงต้องรีบแล้ว</p>\n\n<p>เห็นเส้นชัยแล้วตอนนี้ผมไม่สนอะไรทั้งนั้นแม้แต่กล้อง ความเจ็บตีนหายไปไหนไม่รู้ละ แพลนผมคือจบก่อนแปดชั่วโมงกด Pace 4 ด้วยตีนเปล่าพร้อมพลังสุดท้าย แซงได้สองคนพร้อมกับเข้าเส้นชัยพร้อมกับเสียงคนที่ยืนข้างสนาม “ตีนเปล่าเลยเหรอสุดยอด” ผมไม่อยากจะตีนเปล่าาครับบบบ สถานการณ์จำเป็น แต่มันก็แลกมาด้วยความระบมเท้าหลังจากเข้าเส้นชัย</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/07/13615045_1319128218116730_3851890670987503163_n.jpg\" alt=\"\" /></center>\n\n<p>ตีนเปล่า อย่าทำเลยครับถ้าไม่จำเป็น มันทรมานมากครับ</p>\n\n<center>\n    <h3>~ 07:58:02 ~</h3>\n</center>\n\n<p><a href=\"https://race.runlah.com/event/ctme11/5220/vdo/50km\">https://race.runlah.com/event/ctme11/5220/vdo/50km</a></p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/07/13620309_1319117301451155_5711774687545907232_n.jpg\" alt=\"\" /></center>\n\n<h3 id=\"คำถามในสนามที่ต้องต่อสู้ด้วยหัวใจ\">คำถามในสนามที่ต้องต่อสู้ด้วยหัวใจ</h3>\n\n<p>สำเร็จแล้ว 50km ตามเป้าหมาย(แต่ควรจะดีกว่านี้) อัลตร้าแรกที่จบมาด้วยคำถามด้านลบของตัวเองตลอดทาง คำถามที่คอยบั่นทอนผมพยายามเอาชนะมันมาตลอดทาง จนผมทำได้ เชื่อไหมครับพอเข้าเส้นชัยคำถามเหล่านั้นหายไปทันที</p>\n\n<p>ความที่ผมไม่คิดว่าวันนั้นมันเกิดขึ้นมาเลย</p>\n\n<center>\n    <h3>เราคงไป 100km ไม่ได้หรอกขนาด 50km ยังเหนื่อยขนาดนี้ เลิกวิ่ง เลิกคิดเถอะทรมานเปล่าๆ</h3>\n</center>\n\n<p>ผมต่อสู้กับความคิด และคำถามเหล่านี้เยอะมาก ตลอดทางแต่ผมก็เอาชนะมันได้ ครับอัลตร้าแรกที่ผมทำได้ 8 เดือนที่ผมเริ่มวิ่งจนในที่สุดผมจบ 50km จนได้</p>\n\n<center>\n    <h3>“ครับผมจะวิ่ง 100km  เดือนธันวาคมนี้ครับ”</h3>\n</center>\n\n<h3 id=\"ความผิดพลาด-และบทเรียนในสนามนี้\">ความผิดพลาด และบทเรียนในสนามนี้</h3>\n\n<p>สนามนี้อัลตร้าแรกหลายๆ อย่างที่ผมได้เรียนรู้เข้าใจ และยิ่งรู้ไปมากกว่าเดิมว่าอะไรที่ผมขาด อะไรที่ผมเกิน อะไรที่ควร และไม่ควร สนามหน้าจะต้องดีกว่านี้</p>\n\n<ul>\n  <li>เป้น้ำ ผมใช้เป้น้ำ 2 ลิตรใส่น้ำไปเต็มหนักพอสมควรแต่…..ผมเอาไปเพื่อ??? ผมต้องแบกน้ำสองลิตรเพื่อไปกินน้ำที่เขาแจก กว่าจะรู้ตัวก็จะเข้าเส้นละ ต่อไปผมจะแข่งโดยไม่มีเป้น้ำ (ขึ้นอยู่กับระยะห่างจุดให้น้ำ) จะใช้เพื่อซ้อมเท่านั้น</li>\n  <li>สัมภาระ แบกของที่ไม่จำเป็นเยอะเกินไป แย่มากคิดแต่สนุกตอนเอาไปแต่พอวิ่งรู้สึกว่าเปล่าประโยชน์</li>\n  <li>รองเท้า เลือกรองเท้าผิด ชีวิตเปลี่ยนต้องหารองเท้าแข่งใหม่การแข่งระยะยาวรู้สึกว่าเท้าจะเร่ิมกว้างขึ้นเรื่อยๆทำให้เกิดรองเท้าบีบหน้าเท้า คราวหน้า Altra แน่นอน</li>\n  <li>เหงื่อที่ลงไปในรองเท้า เป็นคนเหงื่อมาก มักจะไหลลงรองเท้าต้องหาวิธีแก้</li>\n  <li>ของกิน หากเป็นการวิ่งเทรลแบบยาว ผมจะไม่หวังของกินจากผู้จัดอีกต่อไป</li>\n</ul>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/07/13612272_1319126298116922_3776183457486887631_n.jpg\" alt=\"\" /></center>\n\n<h3 id=\"ขอบคุณผู้ร่วมชะตากรรมทุกท่าน\">ขอบคุณผู้ร่วมชะตากรรมทุกท่าน</h3>\n\n<ul>\n  <li>พี่มน ที่คอยจ่มทุกอย่างทุกเรื่องคราวหน้าไปกับพี่มนเอาที่อุดหูไปด้วย ขอบคุณสำหรับ BIB และเรื่องการสมัคร</li>\n  <li>พี่มด แลกเปลี่ยนเรื่องราวการวิ่งด้วยกันสร้างเสียงหัวเราะ</li>\n  <li>เหลียง ยังคงมีความดีด และสร้างความฮาอยู่เสมอ</li>\n  <li>น้องนีโม่ สาวน้อยผู้แข็งแกร่งกับการให้กำลังใจ</li>\n  <li>พี่สัญญา กับแรงบัลดาลใจ</li>\n  <li>รัชชี่ กับปฏิบัติการตามหาแฝดพี่</li>\n  <li>Snaill Gang กับมิตรภาพดีๆ</li>\n  <li>กลุ่มเราเต่ารันนิ่ง กับมิตรภาพและกำลังใจเสมอมา</li>\n  <li>Buzzwoo! Asia สำหรับเสื้อสวยๆ และการสนับสนุนการวิ่งเสมอมา</li>\n</ul>\n\n<p>ขอบคุณทีม Buzzwoo! Active ทุก 1km เราบริจาค 10 บาทให้กับเด็กกำพร้า และสุนัขจรจัด ผมบริจาคไปเยอะแล้วเย้ๆ https://buzzwoo.de/active</p>\n\n<center>\n    <h3>เจอกันอีกที Panoramic 100km ครับ</h3>\n</center>\n"
    }
    ,
    {
      "title": "Khaopratubchang Compressport Trail 2016",
      "link": "/2016/06/Khaopratubchang-Compressport-Trail-2016.html",
      "image": "https://bestrangers.files.wordpress.com/2016/06/logosmall.png",
      "content": "ในที่สุดก็วิ่งจบเทรลงานนี้จนได้ เรียนรู้อะไรหลายๆ อย่างจากการวิ่งเทรลสนามนี้ อนึ่งวิ่งเทรลสนามนี้เป็นบททดสอบตัวเองว่าเดือนหน้า โคลัมเบียร์ มาสเตอร์ เทรล เราจะทำได้ไหม เทคนิคต่างๆ ที่ควรจะเอาไปใช้ในสนามถัดไปควรจะมีอะไรบ้าง มาเล่าสู่กันฟังดีกว่าครับว่าสนามเขาประทับช้างนี้มีอะไรน่าตื่นเต้นบ้าง",
      "slug": "Khaopratubchang Compressport-Trail-2016",
      "detail": "<p>ในที่สุดก็วิ่งจบเทรลงานนี้จนได้ เรียนรู้อะไรหลายๆ อย่างจากการวิ่งเทรลสนามนี้ อนึ่งวิ่งเทรลสนามนี้เป็นบททดสอบตัวเองว่าเดือนหน้า โคลัมเบียร์ มาสเตอร์ เทรล เราจะทำได้ไหม เทคนิคต่างๆ ที่ควรจะเอาไปใช้ในสนามถัดไปควรจะมีอะไรบ้าง มาเล่าสู่กันฟังดีกว่าครับว่าสนามเขาประทับช้างนี้มีอะไรน่าตื่นเต้นบ้าง</p>\n\n<p>งานเทรลที่หลายๆ คนไฝ่ฝันที่จะมาวิ่งเพราะสมัครเต็มรวดเร็วเหลือเกิน ไม่ใช่ว่าใครมีเงินก็สมัครได้ งานนี้ต้องเร็วด้วยครับ ถามว่าผมสมัครทันไหม ไม่ทันครับถอดใจไปแล้วด้วยว่าคงจะไม่ได้วิ่งสนามนี้แน่นอน จนกระทั่งมีการเล่นเกมส์ชิงสล็อตสมัครที่กลุ่ม 42.195 ของพี่ป๊อก และกลายเป็นหนึ่งในผู้โชคดีได้โค็ด VIP มาสมัครจนได้ ซึ่งมีข้อดีคือเราสามารถเลือกเลข BIB ได้อีกด้วย!!!</p>\n\n<p>ไหนๆก็ได้โค๊ด VIP มาแล้วรออะไรครับ 32km ไปเลยครับผม…นักวิ่งสายห้าวครับ</p>\n\n<p>ตอนนี้ก็มีทุกอย่างพร้อมแล้วเหลือที่พัก และแล้วงานนี้ก็ลากพี่กตไปด้วยจนได้ไปเป็นเพื่อนกันหนุกดีครับ</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/06/13497765_1294297043921769_493586224345025926_o.jpg?w=736\" alt=\"\" /></center>\n\n<h3 id=\"การเดินทางและการรับ-bib\">การเดินทางและการรับ BIB</h3>\n\n<p>การเดินทางของผมครั้งนี้พยายามจะลดค่าใช้จ่ายให้น้อยที่สุด เพราะมีอีกหลายค่าใช้จ่ายที่ต้องรับผิดชอบในเดือนถัดไปใช้วิธีการนั่งเครื่องบินไปวันเสาร์สายๆ และนั่งรถของนครชัยแอร์กลับตอนกลางคืน แน่นอนครับต้อง First Class เพราะกะว่าจะนอนมาตลอดทางครับเหนื่อยแน่นอน</p>\n\n<p>การเดินทางขาไปลงที่ดอนเมืองจากนั้นไปราชบุรีกับเพื่อนพี่กตครับ งานนนี้ต้องขอบคุณพี่นิคกี้แห่ง Snail Gang ครับที่ให้ความอนุเคราะห์ติดรถไปด้วยและที่พักด้วยครับ ส่วนขากลับก็มาส่งที่นครชัยแอร์เรียกว่าเอาประทับใจกันไปเลยทีเดียว</p>\n\n<p>ส่วนเลข BIB ผมให้เพื่อนมารับแทนที่ กทม แล้วส่ง EMS มาให้ก่อนแล้วครับเพราะไม่อยากรีบมางานจนเกินไป</p>\n\n<h3 id=\"สถานที่จัดงาน\">สถานที่จัดงาน</h3>\n\n<p>งานเขาประทับช้างเทรลนี้จัดที่สวนพฤษศาสตร์บ้านจอมบึง กึ่งกลางระหว่างตัวเมืองราชบุรีและอำเภอจอมบึงถือว่าเป็นสถานที่ที่น่าสนใจครับ มีสวนสัตว์ขนาดเล็กๆ อยู่ข้างในด้วยครับ ชักอยากจะวิ่งแล้วสินะ</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/06/13445253_1301828823180003_1349825876511520006_n.jpg?w=736\" alt=\"\" /></center>\n\n<p>ที่งานคนเยอะมากครับ ย้ำครับเยอะมาก ทั้งมาดูเด็กแข่งวิ่งและมาถ่ายรูปกับป้ายในงาน มาเจอเหล่าเซเล็ป มากินข้าวฟรี หรือแม่กระทั้งมาช๊อปปิ้งตามร้านต่าๆงที่มาออกร้านครับ</p>\n\n<h3 id=\"การจัดงาน\">การจัดงาน</h3>\n\n<p>งานนี้การันตีโดยทีมงานราชภัฎจอมบึงผู้จัดงานเดียวกันกับจอมบึงมาราธอนนั่นเองครับ นี่ก็คงเป็นอีกเหตุผลหนึ่งครับว่าทำไมงานเทรลนี้ถึงเป็นที่นิยมมากเหลือเกิน โดยคนเยอะตั้งแต่งานวันก่อนวิ่งเลยครับมีกิจกรรมต่างๆให้ทำมากมาย มีข้าวฟรี มีหนังให้ดู เยอะแยะไปหมด</p>\n\n<p>มาถึงการจัดและการดูแลในสนามกันบ้าง งานนี้ต้องยอมรับว่าเขาใส่ใจทุกๆ รายละเอียดจริงๆ เรื่องแรกเอาเรื่องน้ำและเกลือแร่ก่อน ไม่มีหมดเติมตลอดจนถึงนักวิ่งคนสุดท้าย เหลือแร่หลายรถชาติเลือกเอาเองชอบรถไหนทั้งสีเหลือง ขาว เขียว แดง ผมชอบสีเหลืองกับสีแดงนะ อร่อยดี รวมถึงแตงโมที่กินเท่าไหร่ก็ไม่หมด วิ่งเสร็จแอบมาเห็นข้างหลังงานยังมีสต๊อกอีกเพียบ!!!!</p>\n\n<p>เส้นทางการวิ่งที่ทับกันไปมาและค่อนข้างสับสนอันนี้ขอติเตียนครับ บางครั้งวิ่งทับไปมา สวนกันไปมาเล่นเอางงพอสมควร แต่ก็อย่างที่เกริ่นมาครับเขาดูและและใส่ใจนักวิ่งอย่างดีจริงๆ  สต๊าฟเยอะมากมีเกือบทุกจุดที่ดูหมือนจะสับสนเเพราะบางคนวิ่งเทรลแรก ตั้งหน้าตั้งตาวิ่งแบบไม่ดูริบบิ้นก็มี ต้องคอยชี้ทางบอก มีอยู่ทุกจุดในป่าประมาณว่าถ้าเจ็บก็ตะโกนได้เลยต้องมีสักคนหนึ่งได้ยินแน่นอน</p>\n\n<p>หน่วยปฐมพยาบาล มีหน่วยเคลื่อนที่เร็วโดยรถมอเตอร์ไซต์ เข้าถึงได้เกือบทุกพื้ที่จริงๆ แต่ถึงยังไงเสปรย์ก็ยังไม่พออยู่ดี (อันนี้ได้ยินเพื่อนบอก เพราะผมไม่ได้ฉีดเสปรย์เลย) ช่วงก่อนขึ้นเขามีเตรียมไม้ไผ่ให้ด้วย คือดีงามมากกกก</p>\n\n<p>ชอบตอนเข้าเส้นชัยด้วยเพราะหลังจากผ่านเส้นชัยเข้าไปแล้วต้องเดินไปด้านหลังเพื่อรับเหรียญทำให้คนไม่ออกันอยู่ที่เส้นชัย อันนี้ขอปรบมือให้ดังๆ ครับ</p>\n\n<p>ข้อเสียนะครับ เส้นทางที่ทับกันระหว่าง 32km กับ 21km นั้นตอนขึ้นเขาทำให้การจราจรหนาแน่นไปหน่อยครับ เพราะเป็น Single Track ทำคนคนเป็นหลักร้อยมารวมกันและต้องต่อคิวขึ้นและลงด้วย</p>\n\n<p>งานนี้กล้องเยอะมากๆๆ ต้องไปตามหารูปมาลงซะก่อนนนน</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/06/13435334_1301828839846668_4975694867286809379_n.jpg\" alt=\"\" /></center>\n\n<h3 id=\"สภาพสนาม\">สภาพสนาม</h3>\n\n<p>หลังจากฝนตกลงมาทั้งวันก่อนงานแข่งที่คิดเอาไว้คือมีหวังเละแน่นอน สนามช่วงแรกจะเป็นถนนดินแข็งธรรมดาทั่วไป ก่อนที่จะเข้าสู่ป่าพื้นราบที่เราต้องคอยหลบกิ่งไม้บ้าง ต้องคอยสังเกตดีๆ ตรงนี้ตอไม้ค่อนข้างเยอะพอสมควร ต้นไผ่ค่อนข้างเยอะต้นที่ล้มๆ เราต้องคอยก้มหรือโดดข้าม สนุกดี</p>\n\n<p>มีสวนสัตว์เล็กๆ (แบบนี้เรียกสวนสัตว์ก็ได้เหรอ) วิ่งวนไปทักทายสัตว์สักแป๊บนึง ก่อนจะขึ้นเนิน (เขาเรียกเนินนี้ว่าเลียงผา) ANG Gain ประมาณ 160m ไต่เรียบหิน และพื้นดินขึ้นไประมาณ 1km หินคมและดินลื่นต้องระวังกันเป็นพิเศษ มาถึงช่วงลงของเนินนี้ยิ่งลื่นครับ ฝนที่ตกลงมาเมื่อวานทำให้เกิดความลื่น และเป็นการลงเขาที่ทุกลักทุเลมาก เพราะมีความชัน ต้นไม้ที่จะจับก็มีหนามด้วยนะ โหดมันฮา กันเลยที่เดียว</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/06/13445700_10153495802602827_5743278946933801443_n.jpg?w=736\" alt=\"\" /></center>\n\n<p>ถัดจากเนินก็เป็นพื้นที่ป่าที่ต่างจากตอนแรก ตรงนี้จะมีหญ้าขึ้นเยอะกว่าเดิม ดินเริ่มร่วนคอยตัดกำลังไปเรื่อยๆ จากนั้นก็เริ่มขึ้นเนิน ที่เป็นหินมีความชันไม่มาก แต่มองทางเดินแทบไม่เห็น เกือบหลงไปเหมือนกัน ช่วงนี้จะเป็นทางขึ้นลงๆ Gain ไม่มากพอสนุกสนาน</p>\n\n<p>เข้าสู่ป่าโปร่ง ช่วงนี้เป็นดินทรายครับลากยาวเลย เชื่อว่าตรงนี้แหละที่เรียกตระคริวให้ใครหลายๆ คนรวมทั้งตัวผมเองด้วย ทางทรายบวกกับดินร่วนขนาดนี้ไม่ใช่ง่ายๆเลยนะครับ หมดจากทางทรายกลับเข้าสู่ป่ากันอีกครับ</p>\n\n<p>ก่อนจะจบก็จะมีเนินไม่รู้จบให้ไต่กันอีกหนึ่ง อันนี้สนุกจริงเพราะสูงและยาวเล่นทำเอาหลายๆ คนแทบถอดใจกันเลยทีเดียว ขึ้นยาวๆ กับหินแล้วดินลื่นหลังจากนั้นลงบันไดแล้วเข้าเส้นชัยครับ</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/06/pok-0867.jpg?w=736\" alt=\"\" /></center>\n\n<h3 id=\"การวิ่งในสนาม\">การวิ่งในสนาม</h3>\n\n<p>แปร้นนนนน เสียงแตรปล่อยตัวดังขึ้นนักวิ่งก็เริ่มวิ่งแล้วครับผมอยู่โชนกลางๆ ก็ต้องรอเวลาหน่อยนึงเพราะนักวิ่งค่อนข้างเยอะ ระยะ 32km มีทั้งหมด 1408 คนเยอะมากกก ช่วงแรกหลายๆ คนอัดกันออกเลยทีเดียวเราก็บ้าจี้ครับอัดเพส 5 กว่าๆไปเลยเหนื่อเลยย ทางเรียบวิ่งง่ายครับแล้วก็เลี้ยวขวาเข้าทางป่า เริ่มเป็นทางดินแข็งอยู่ครับยังวิ่งสบายแต่ต้งคอยหลบกิ่งไม้บ้าง คุมเพซตัวเองได้ดีเยี่ยมประมาณ 5-6 นาที/กิโลเมตร ช่วงนี้จะยาวประมาณ 8 กิโลเมตร</p>\n\n<p>หมดจากทางราบเริ่มขึ้นเขาลูกแรกแหงนขึ้นไปข้างไม่มีปัญหาใจอยากจะจ๊อกขึ้นไปด้วยซ้ำ แต่คนเยอะเลยได้แต่ค่อยๆ ไต่ตามตูดกันไปไม่ต้องถามเรื่องแซงยากมาก ดินค่อนข้างนุ่มแต่ลื่น รู้สึกแอบได้เปรียบเรื่องรองเท้ามากกเกาะหนึบเบยไต่ขึ้นไปเกาะไม้ไผ่ไป เอารองเท้าจิกขึ้นเป็นอะไรที่มันส์ (ได้เปรียบเรื่องรองเท้า)</p>\n\n<p>ช่วงขาลงของเนินนี้ก็เช่นกัน ทางลื่นมากประกอบกับหิน แต่ก็ยังทำความเร็วไม่ได้อยู่ดีเพราะคนเยอะต้องคอยต่อคิวกันลงเขา เขาลื่นๆกันส่วนเรายังชิวเพราะรองเท้ามีปุ่ม หลายคนจะเจอหนามต้นงิ้วแถวๆนี้เพราะความลื่นแต่เราไม่พลาดเพราะสังเกตตลอด ต้อนงิ้วเยอะมากกกก</p>\n\n<p>พอลงมาก็จะเป็นช่วงทางราบยาวเริ่มจะเป็นดินร่วนละครับ บางพื้นที่มีแฉะติดรองเท้าเลยทีนี้เมื่อกี้ได้เปรียบตอนนี้เสียเปรียบ ดินติดรองเท้า ยังทำเพจได้แค่ 7-8 คงเป็นเพราะวิ่งเร็วในช่วงแรกถึงตรงนี้ก็คงจะปาเข้าไปประมาณกิโลเมตรที่ 15 แล้วล่ะครับเริ่มวิ่งเร็วไม่ได้เพราะ HR  เริ่มขึ้นมาแต่ที่ 170 bpm ซะแล้วต้องค่อยๆผ่อนและเดินเพื่อเอา HR ลงก่อนไม่งั้นไม่จบแน่ ยังเป็นทางดินร่วนและแฉะไปเรื่อยๆ โอยๆ จะตัดกำลังไปถึงไหนกันนนน</p>\n\n<p>ในที่สุดก็ออกจากป่าทึบมาเป็นช่วงป่าโปร่งที่ไหนได้เป็นทรายเลยครับทีนี้เอาละแย่ละ โคลนมาเป็นทรายพระเจ้า ช่วงนี้ผมวิ่งช้ามากประมาณ 8 – 8.30 ได้ปัญหาที่ตามมาปัญหาหนึ่งก็คือ ถุงเท้าเริ่มแฉะแล้วครับ 17 กิโลเมตรเองเริ่มรู้สึกที่นิ้วเท้าแล้วเพราะรองเท้าบีบหน้าเท้ามาก ตอนแรกๆได้เปรียบเรื่องรองเท้าตอนนี้ชักจะเสียเปรียบซะแล้วสิ</p>\n\n<p>ถึงจุดให้น้ำประมาณกิโลเมตรที่ 19 คราวนี้จำเป็นต้องถอดรองเท้าถุงเท้าออกมาบีบน้ำออกให้หมด เห็นเท้าตัวเองเริ่มเหี่ยวแล้วเพราะแฉะมานานมาก พักสักหน่อยเห็นเขาฉีดเสปรย์กันก็ฉีดบ้าง ออกจากจุดให้น้ำซัก 300 เมตรขึ้นขาเลยครับบบ มาแล้วตะคริวมาแล้วววว มาเร็วมากตอนนี้ต้องตั้งใจแล้วครับว่ารักษาอาการให้ได้เพราะเหลืออีกสิบกว่าโลเอง</p>\n\n<p>เริ่มเข้ามาในป่าอีกครั้งและคราวนี้เริ่มขึ้นเนินหินอีกแล้วแต่ไม่ชันมากเท่าไหร่ มีน้องๆ คอยยื่นไม้ไผ่ให้เข้าท่าดี ตั้งหน้าตั้งตาไต่ไปเรื่อย จนมีน้องคนหนึ่งเรียก “พี่ๆ ทางนี้ๆ” เกือบหลงครับบบ แหม่ก็ไต่แบบไม่มองข้างหน้าแบบนั้นเขินนิดนึงวกกลับเข้าทางเดิมแล้วไปต่อ ลงเขาแบบหินๆ แล้วก็ขึ้นเขาแบบหินๆ อีกรอบ</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/06/pok-0868.jpg\" alt=\"\" /></center>\n\n<p>ลงจากเขาหินต่อไปเป็นทางป่าคราวนี้พลังมาแล้วครับ วิ่งเพจ 6 ได้แล้วววว จัดเลยครับ ช่วงนี้ไล่แซงขึ้นมาได้เรื่อยๆ ผมว่ามากกว่ายี่สิบคน ขอทางอย่างเดียวมาดีดเอาช่วงนี้จนกระทั่ง 2 กิโลเมตรสุดท้ายแล้ว ใครจะเชื่อว่าข้างหน้าเป็นเนินอีกแล้ว แหงนมองขึ้นไปทำไม่มันสูงอย่างนี้วะเนี่ยยยย สต๊าฟเรียกเนินนี้ว่า “เนินไม่รู้จบ”</p>\n\n<p>ไต่ขึ้นไปตามแนวดินและหิน ไม่ค่อยลื่นเหมือนเนินแรก ช่วงนี้แซงได้อีกสี่ห้าคนเพราะหลายๆ คนหมดแรงกลางทางที่ปีนขึ้น และได้ข่าวมาตอนหลังว่ามีคนเป็นลมที่เนินนี้ด้วยนะ แต่เราได้อานิสงค์จากดอยสุเทพเลยไต่ได้แบบไม่ต้องหยุดพัก</p>\n\n<p>ช่วงขาลงจากเนินนี้เป็นบันไดหิน ผมขอเรียกบันได้นี้ว่า บันได้เรียกตะคริว!!! เพราะตระคริวผมมันกลับมาแล้ว ช้าที่ตรงนี้พอสมควรเพราะวิ่งแซงไม่ได้ พอออกจากบันไดได้ปุ๊บ Sprint เลยครับที่ไหนได้ก่อนเส้นชัยสัก 300 เมตรตะคริวแดกครับบบบ หยุดเลยไม่นะ โดนแซงไปหนึ่งชุดดดดด กัดฟันเข้ามาจนได้ด้วยอาการบอบช้ำเหลือเกิน</p>\n\n<center>\n    <h3>~03:55:41~</h3>\n</center>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/06/cer.jpg?w=736\" alt=\"\" /></center>\n\n<h3 id=\"สรุป\">สรุป</h3>\n\n<p>งานวิ่งรายการนี้ทำได้น่าประทับใจในเกือบทุกเรื่องไม่รู้ว่าจะติเรื่องไหน ขอติดเรื่องเส้นทางซับซ้อนละกันครับนอกนั้นดีหมดเอาแบบนี้ละกันครับ ใครอยากรู้ว่าดียังไงปีหน้าลองไปวิ่งดูครับ แล้วจะหลงรักรายการนี้</p>\n\n<p>ผมจบสนามนี้ด้วยเวลา 03:55:41 ชั่วโมงซึ่งดีกว่าที่ผมตั้งใจไว้คือ 4 ชั่วโมงไม่เกิน 4:30 ชั่วโมง แม้จะเป็นตะคริว และเจ็บที่ร้องเท้าบีบ เท้าแฉะ แต่ไม่มีอาการบาดเจ็บอื่นเข้ามา ถือซ้อมได้ดีแต่ยังไม่พอ รายการหน้า 50 มั่นใจต้องดีกว่านี้</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/06/13427786_1302378973124988_1134612256483757838_n.jpg?w=736\" alt=\"\" /></center>\n"
    }
    ,
    {
      "title": "Camelbak Marathoner",
      "link": "/2016/06/Camelbak-Marathoner.html",
      "image": "https://bestrangers.files.wordpress.com/2016/06/232179_18180_xl1.jpg",
      "content": "เมื่อหันมาวิ่งเทรล หันมาวิ่งระยะไกล ก็ต้องมีอุปกรณ์เพื่อคงการวิ่งให้สม่ำเสมอ ใครว่าการวิ่งเป็นการออกกำลังกายราคาถูก ไม่เลยยยยย ยังมีอีกหลายสิ่งที่ต้องใช้ ที่จำเป็นในสนามแข่งและสนามซ้อม วันนี้มีโอกาสได้ใช้ Hydration Vest หรือเรียบกง่ายๆ ตามภาษาชาวบ้านคือ เป้น้ำนั่นเอง",
      "slug": "Camelbak-Marathoner",
      "detail": "<p>เมื่อหันมาวิ่งเทรล หันมาวิ่งระยะไกล ก็ต้องมีอุปกรณ์เพื่อคงการวิ่งให้สม่ำเสมอ ใครว่าการวิ่งเป็นการออกกำลังกายราคาถูก ไม่เลยยยยย ยังมีอีกหลายสิ่งที่ต้องใช้ ที่จำเป็นในสนามแข่งและสนามซ้อม วันนี้มีโอกาสได้ใช้ Hydration Vest หรือเรียบกง่ายๆ ตามภาษาชาวบ้านคือ เป้น้ำนั่นเอง</p>\n\n<h3 id=\"ทำไมต้องใช้เป้น้ำ\">ทำไมต้องใช้เป้น้ำ?</h3>\n\n<p>มีหลายๆคำถามเหมือนกันรวมถึงตัวผมเองเมื่อก่อนตอนเห็นนักวิ่งหลายคนสวมกระเป๋าที่เหมือนเสื้อกั๊ก ดูแล้วตลกดี ทำไมต้องใช้ด้วยถือกระป๋องน้ำ หรือดื่มน้ำตามทีเขาเตรียมไว้ให้ก็ได้  นั่นเป็นความคิดของเด็กหัดวิ่งอย่างตัวผมตอนนั้น ซึ่งวิ่งไกลสุดแค่ 10km เท่านั่นเอง</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/06/camelbak-brand-page-title-tiny.jpg?w=736\" alt=\"\" /></center>\n\n<p>จริงๆเป้น้ำเป็นสิ่งสำคัญของนักวิ่งระยะไกลระยะตั้งแต่ 30km ขึ้นไป เพราะการวิ่งในระยะไกลๆ การดิ่มน้ำเป็นสิ่งสำคัญ บางครั้งการถือขวดน้ำ ก็ลำบากในการถือ จำนวนน้ำที่มีอยู่ในขวดไม่พอสำหรับดื่มในการวิ่ง เมื่อเรามีกระเป๋าที่สามารถดึงสายแล้วดูดน้ำได้ทันที จะง่ายกว่า แถมยังใส่อุปกรณ์สิ่งของอะไรได้มากมายอีกด้วย</p>\n\n<p>อีกประการหนึ่งที่สำคัญคือเรื่องการซ้อมระยะไกล เพราะการซ้อมระยะไกล ไม่ได้เหมือนแข่งที่จะมีคนคอยเตรียมน้ำดื่มให้เราตลอดทาง ครั้นจะถือไปน้ำก็คงไม่พอ ไปหาเอาดาบหน้าก็คงยากเพราะวิ่งในป่า ดังนั้นมันจึงสำคัญตอนนี้แหละครับ</p>\n\n<h3 id=\"แล้วเราจะเลือกใช้แบบไหน\">แล้วเราจะเลือกใช้แบบไหน?</h3>\n\n<p>อันนี้แหละที่ตอบยาก สำหรับผมอาศัยการไปจับๆ ลูบๆ คลำๆ ของเพื่อนดูในอินเทอร์เน็ตบ้างอะไรบ้าง ดูตามรีวิวทั่วไปบ้าง แต่ทั้งนี้ทั้งนี้ก็ต้องลองใส่วิ่งดูก่อน ว่ากระชับไหม และที่สำคัญราคาครับ เอาที่เรารับได้และซื้อไหวนะครับไม่ใช่ซื้ออย่างแพงเอาจนกรอบไปทั้งเดือนแบบนั้นก็ไม่ไหวนะ ต้องลองไปอ่านรีวิวและเลือกใช้ดูครับ</p>\n\n<h3 id=\"camelbak-marathoner-vest\">Camelbak Marathoner Vest</h3>\n\n<p>วันนี้ได้มีโอกาสทดสอบเป้น้ำยี่ห้อนี้ (เพราะยังไม่สามารถเอื้อมยี่ห้ออื่นได้ ฮาาาาา) วันนี้ชวนน้องนีโม่ พี่กต ไปวิ่งขึ้นดอยสุเทพกันจะได้ถือโอกาสลองทดสอบไปด้วยในตัว</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/06/camelbak20marathoner.jpg?w=736\" alt=\"\" /></center>\n\n<p>รุ่นที่ผมเลือกเป็นรุ่น Marathoner เป็นรุ่นสำหรับการวิ่งระยะกลางคือประช่วงไม่เกิน 50km รุ่นนี้จะจุน้ำได้ประมาณ 2 ลิตร มีช่องใส่ของด้านหลังเล็กน้อย และด้านหน้าจะมีช่องใส่ของได้เยอะพอสมควร ทั้งโทรศัพท์มือถือ กุญแจ สิ่งของๆ ต่างเป็นต้น รวมไปถึงใส่กระป๋องน้ำด้านหน้าอีก 2 กระป๋อง ถือว่าเพียงพอสำหรับ 50km ครับ</p>\n\n<p>รุ่นนี้จะมีแต่  Free size ครับ หลายคนอาจจะกังวลว่าถ้าเป็น Free size แล้วมันจะกระชับได้ยังไงล่ะ? ที่จริงมันมีที่ปรับเพื่อให้เข้ากับเราเองครับ ผมยังห่วงเรื่องนี้ตอนแรกๆ แต่พอมันปรับระดับได้ พอลองใส่ปรับไปปรับมา ก็กระชับอยู่ครับ คลิปด้านหน้า คลิปด้านข้าง และที่เจ๋งคือตรงไหล่เราสามารถปรับสั้นยาวด้วยครับ สบายเลย</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/06/2015-04-16-12-21-59-2.jpg?w=736\" alt=\"\" /></center>\n\n<h3 id=\"เนื้อผ้า-และวัสดุ\">เนื้อผ้า และวัสดุ</h3>\n\n<p>บางและเบาแต่ค่อนข้างแข็งนะ ตอนใส่วิ่งยังมีแอบเสียวๆเสียดสีตรงไหล่ แต่พอใส่จริงๆ ถือว่าโอเคแต่เห็นหลายคนมีแอบบ่นเวลาเปียกหรือฝนตกจะปัญหาเรื่องบาดเนื้อ แต่ผมยังไม่เจอครับ คลิปล็อกด้านหน้าอันเล็กแต่แข็งแรงมาก อันนี้ชอบ ส่วนสายเล็กๆ เป็นสายยืดปรับระดับไม่ได้ยาก</p>\n\n<h3 id=\"ถุงน้ำ\">ถุงน้ำ</h3>\n\n<p>รุ่นนี้มาพร้อมกับถุงน้ำความจุ 2 ลิตร (เวลาวิ่งไม่จำเป็นต้องใส่หมดทั้งสองลิตรก็ได้) เป็นถุงวิ่งแบบเปิดแล้วเติมน้ำได้ทันทีไม่ต้องดึงถุงน้ำออกมาเติมอันนี้ชอบๆ เวลาดึงถุงน้ำออกจากเป้ก็ทำได้ไม่ยาก ถือว่าตรงนี้สอบผ่านมากมาย ถุงน้ำใช้งานครั้งแรกไม่มีกลิ่นพลาสติกเลย</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/06/hqdefault.jpg\" alt=\"\" /></center>\n\n<p>สายดูดน้ำ</p>\n\n<p>สายดูดน้ำคล้องมาข้างหน้า สายค่อนข้างใหญ่นิดนึงกัดเล็กน้อยถึงจะดูดน้ำได้ ข้อเสียคือถ้ากัดแรงเกินไปน้ำก็จะไปออกเพราะสายก็ไปปิดทางเดินน้ำ สามารถถอดทำความสะอาดได้ทั้งที่ก้นถุงน้ำ และตัวดูดน้ำ ถือว่ามีประโยชน์และสะดวกสบายเลยทีเดียว</p>\n\n<p>ใช้งานจริง</p>\n\n<p>ทดลองใช้งานจริงตอนวิ่งขึ้นดอยสุเทพทางเทรลเหมือนเดิม ครั้งแรกยังไม่ค่อยชิน เหมือนมีน้ำอยู่ข้างหลัง ถุงน้ำไม่เลื่อนไปมา เป้กระชับพอสมควร วิงไปได้ยินเสียงน้ำไปแต่ก็เป๋าติดหลังเหมือนเดิมชอบๆ</p>\n\n<p>แต่พอน้ำใกล้หมด ต้องคอยดึงสายเข้ามาเพื่อให้กระชับกับหลังอีกที เติมน้ำไป 1.5 ลิตรความรู้สึกเหมือนน้ำเกือบเต็มถุงน้ำ แต่ฝาเติมน้ำเปิดและปิดยากไปหน่อยอันนี้ต้องปรับปรุง</p>\n\n<p>สายดูดน้ำที่พาดผ่านหลังมา หากเราเก็บเข้าที่หนีบสายการดึงออกมาเพื่อดูดน้ำทำได้ยากมากไม่สะดวก ต้องพยายามหาที่คล้องตามรูในเป้ด้าหน้า</p>\n\n<p>สายที่พาดไหล่ลงมาด้านหน้าไม่ค่อยกระชับตัวสักเท่าไหร่ และดูเหมือนจะใหญ่ไปนิดนึงด้วย รุ่นนี้ไม่มีไซต์ เป็นอีกหนึ่งข้อเสียของยี่ห้อนี้</p>\n\n<p>สรุปแล้วรุ่นนี้ใช้งานได้ดีในระดับหนึ่ง แต่ยังมีคนคอมเม้นต์มาบอกว่าหากวิ่งตอนฝนตกอาจจะมีสายกระเป๋าเป้บาดเนื้อได้ด้วย แต่อันนี้ยังไม่เคย</p>\n\n<center><img src=\"https://bestrangers.files.wordpress.com/2016/06/13310623_10206249147378167_2893840914495608996_n.jpg\" alt=\"\" /></center>\n"
    }
  ]
  ,"next": "/api/feed-5.json"
  
  ,"prev": "/api/feed-3.json"
  
}